Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/active_buzzer.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Profitiere von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: Active Buzzer
de: Aktiver Summer

source: **Introduction**
de: **Einführung**

source: In this project, we will learn how to drive an active buzzer to produce a beeping sound using a NPN transistor. Active buzzers are simple components used in many electronic projects to produce sound signals.
de: In diesem Projekt lernen wir, wie man einen aktiven Summer mithilfe eines NPN-Transistors ansteuert, um ein Piepsgeräusch zu erzeugen. Aktive Summer sind einfache Bauteile, die in vielen Elektronikprojekten verwendet werden, um akustische Signale zu erzeugen.

source: **Circuit Diagram**
de: **Schaltplan**

source: The circuit uses an active buzzer, a NPN transistor, and a 1kΩ resistor. The resistor protects the transistor by limiting the base current. When GPIO17 outputs a high level (3.3V), the transistor conducts, allowing current to flow through the buzzer, causing it to beep. When GPIO17 outputs a low level, the transistor is cut off, and the buzzer remains silent.
de: Die Schaltung verwendet einen aktiven Summer, einen NPN-Transistor und einen 1 kΩ Widerstand. Der Widerstand schützt den Transistor, indem er den Basisstrom begrenzt. Wenn GPIO17 einen High-Pegel ( 3,3 V ) ausgibt, leitet der Transistor und lässt Strom durch den Summer fließen, sodass er piept. Wenn GPIO17 einen Low-Pegel ausgibt, sperrt der Transistor und der Summer bleibt stumm.

source: **Wiring Diagram**
de: **Verdrahtungsplan**

source: Follow these steps to build the circuit:
de: Folge diesen Schritten, um die Schaltung aufzubauen:

source: Place the NPN transistor, buzzer, and resistor on the breadboard.
de: Platziere den NPN-Transistor, den Summer und den Widerstand auf dem Breadboard.

source: Connect the base of the transistor to GPIO17 through the resistor.
de: Verbinde die Basis des Transistors über den Widerstand mit GPIO17.

source: Connect the emitter of the transistor to the power supply (+).
de: Verbinde den Emitter des Transistors mit der Stromversorgung ( + ).

source: Connect the collector of the transistor to one terminal of the buzzer.
de: Verbinde den Kollektor des Transistors mit einem Anschluss des Summers.

source: Connect the other terminal of the buzzer to the ground (-).
de: Verbinde den anderen Anschluss des Summers mit Masse ( - ).

source: The following Python code drives the active buzzer to beep on and off in a loop:
de: Der folgende Python-Code steuert den aktiven Summer so an, dass er in einer Schleife ein- und ausgeschaltet wird:

source: This Python script controls a buzzer connected to GPIO pin 17 on a Raspberry Pi. When executed:
de: Dieses Python-Skript steuert einen Summer, der am Raspberry Pi mit GPIO-Pin 17 verbunden ist. Beim Ausführen:

source: The buzzer alternates between turning on and off every 0.1 seconds, producing a beeping sound.
de: Der Summer wechselt alle 0,1 Sekunden zwischen Ein und Aus und erzeugt dadurch ein Piepsgeräusch.

source: The program prints "Buzzer On" and "Buzzer Off" to the console in sync with the buzzer's operation.
de: Das Programm gibt "Buzzer On" und "Buzzer Off" synchron zum Betrieb des Summers in der Konsole aus.

source: The buzzing continues indefinitely until the user interrupts the script by pressing ``Ctrl+C``.
de: Das Piepen läuft unbegrenzt weiter, bis der Benutzer das Skript durch Drücken von ``Ctrl+C`` unterbricht.
