Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/adc.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Profitiere von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: **Introduction**
de: **Einführung**

source: A photoresistor, also known as a light-dependent resistor (LDR), is a component that detects light intensity. Its resistance decreases as the light intensity increases, making it useful in devices like automatic night lamps and ambient light controllers.
de: Ein Fotowiderstand, auch bekannt als lichtabhängiger Widerstand ( LDR ), ist ein Bauteil, das die Lichtintensität erkennt. Sein Widerstand nimmt mit steigender Lichtintensität ab, was ihn in Geräten wie automatischen Nachtlampen und Umgebungslichtsteuerungen nützlich macht.

source: This project demonstrates how to use a photoresistor with Fusion HAT+ to adjust an LED's brightness based on ambient light levels. The working principle is similar to a potentiometer, except the input is light instead of manual adjustment.
de: Dieses Projekt zeigt, wie man einen Fotowiderstand mit dem Fusion HAT+ verwendet, um die Helligkeit einer LED basierend auf der Umgebungshelligkeit anzupassen. Das Funktionsprinzip ähnelt einem Potentiometer, nur dass der Eingang Licht statt einer manuellen Einstellung ist.

source: **Circuit Diagram**
de: **Schaltplan**

source: Below are the schematic diagrams illustrating how to connect the components:
de: Nachfolgend sind die Schaltpläne dargestellt, die zeigen, wie die Komponenten verbunden werden:

source: **Wiring Diagram**
de: **Verdrahtungsplan**

source: Build the circuit as shown in the diagram below:
de: Baue die Schaltung wie im untenstehenden Diagramm gezeigt auf:

source: Ensure that:
de: Stelle sicher, dass:

source: The photoresistor is connected to the Fusion HAT+ to convert analog signals into digital values.
de: Der Fotowiderstand mit dem Fusion HAT+ verbunden ist, um analoge Signale in digitale Werte umzuwandeln.

source: The LED is connected to a GPIO pin for PWM control.
de: Die LED mit einem GPIO-Pin zur PWM-Steuerung verbunden ist.

source: All connections are secure, and power and ground connections are properly set.
de: Alle Verbindungen sicher sind und die Strom- und Masseanschlüsse korrekt gesetzt sind.

source: Below is the Python code used in this project:
de: Unten steht der in diesem Projekt verwendete Python-Code:

source: This Python script continuously reads the photoresistor's value, maps it to a suitable range for setting the LED brightness, and adjusts the LED's brightness accordingly. The script also includes a graceful exit mechanism to turn off the LED when interrupted by the user. When executed:
de: Dieses Python-Skript liest kontinuierlich den Wert des Fotowiderstands, ordnet ihn einem geeigneten Bereich zur Einstellung der LED-Helligkeit zu und passt die Helligkeit der LED entsprechend an. Das Skript enthält zudem einen sauberen Beendigungsmechanismus, um die LED beim Abbruch durch den Benutzer auszuschalten. Beim Ausführen:

source: The Fusion HAT+ continuously reads photoresistor values from its input channel (ranging from 0 to 4095).
de: Das Fusion HAT+ liest kontinuierlich die Fotowiderstandswerte von seinem Eingangskanal ( im Bereich von 0 bis 4095 ).

source: The analog value, representing light intensity or another variable input, is printed to the console as ``result = <value>``.
de: Der Analogwert, der die Lichtintensität oder eine andere variable Eingabe repräsentiert, wird in der Konsole als ``result = <value>`` ausgegeben.

source: The script maps the analog value to a PWM signal to adjust the brightness of the LED.
de: Das Skript ordnet den Analogwert einem PWM-Signal zu, um die Helligkeit der LED anzupassen.

source: The LED brightness dynamically changes based on the ADC input, with updates every 0.2 seconds.
de: Die LED-Helligkeit ändert sich dynamisch basierend auf dem ADC-Eingang, mit Aktualisierungen alle 0,2 Sekunden.

source: The program runs indefinitely until interrupted with ``Ctrl+C``, at which point the LED turns off.
de: Das Programm läuft unbegrenzt, bis es mit ``Ctrl+C`` unterbrochen wird; dann schaltet sich die LED aus.
