Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/gpio_out.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Profitiere von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: GPIO Output
de: GPIO-Ausgang

source: **Introduction**
de: **Einführung**

source: In this tutorial, we’ll connect an LED to a GPIO pin and write a Python program to make it blink. Let’s get started!
de: In diesem Tutorial verbinden wir eine LED mit einem GPIO-Pin und schreiben ein Python-Programm, um sie blinken zu lassen. Lass uns anfangen!

source: **Circuit Diagram**
de: **Schaltplan**

source: Here’s how the circuit should look:
de: So sollte die Schaltung aussehen:

source: **GPIO Pin 17** connects to the anode (long pin) of the LED.
de: **GPIO-Pin 17** wird mit der Anode ( langer Pin ) der LED verbunden.

source: The cathode (short pin) of the LED connects to one leg of the resistor.
de: Die Kathode ( kurzer Pin ) der LED wird mit einem Anschluss des Widerstands verbunden.

source: The other leg of the resistor connects to the **GND** (Ground) pin.
de: Der andere Anschluss des Widerstands wird mit dem **GND** - ( Masse - ) Pin verbunden.

source: The resistor limits the current flowing through the LED, preventing it from burning out. Without a resistor, the LED may draw too much current, which can damage both the LED and the Raspberry Pi.
de: Der Widerstand begrenzt den durch die LED fließenden Strom und verhindert, dass sie durchbrennt. Ohne Widerstand könnte die LED zu viel Strom ziehen, was sowohl die LED als auch den Raspberry Pi beschädigen kann.

source: **Wiring Diagram**
de: **Verdrahtungsplan**

source: Follow the wiring diagram below to connect your components:
de: Folge dem untenstehenden Verdrahtungsplan, um deine Komponenten zu verbinden:

source: Let’s write the Python code to control the LED. You’ll create a script that turns the LED on and off at regular intervals.
de: Lass uns den Python-Code schreiben, um die LED zu steuern. Du erstellst ein Skript, das die LED in regelmäßigen Abständen ein- und ausschaltet.

source: Here’s the complete Python script for this project:
de: Hier ist das vollständige Python-Skript für dieses Projekt:

source: This Python script controls an LED connected to GPIO pin 17 of a Raspberry Pi. When executed, the LED alternates between turning on and off in half-second intervals. Simultaneously, the console prints "LED is ON" and "LED is OFF" to indicate the LED's current state. The program runs indefinitely until interrupted by a user pressing ``Ctrl+C``.
de: Dieses Python-Skript steuert eine LED, die mit GPIO-Pin 17 eines Raspberry Pi verbunden ist. Bei der Ausführung wechselt die LED in halben Sekundenintervallen zwischen Ein und Aus. Gleichzeitig gibt die Konsole "LED is ON" und "LED is OFF" aus, um den aktuellen Zustand der LED anzuzeigen. Das Programm läuft unbegrenzt, bis es durch den Benutzer mit ``Ctrl+C`` unterbrochen wird.
