Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/i2c.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Profitiere von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: **Introduction**
de: **Einführung**

source: The Fusion HAT+ have two different I2C ports, which can be used to connect multiple I2C devices. In this project, we will use the I2C port to connect an LCD1602 display.
de: Das Fusion HAT+ verfügt über zwei verschiedene I2C-Ports, die zum Anschließen mehrerer I2C-Geräte verwendet werden können. In diesem Projekt verwenden wir den I2C-Port, um ein LCD1602-Display anzuschließen.

source: The LCD1602 is a 16x2 character-type liquid crystal display capable of displaying up to 32 characters at a time. It uses the I2C communication protocol, reducing the number of GPIO pins required for control. This project demonstrates how to interface with the LCD1602 to display text messages.
de: Das LCD1602 ist ein 16x2-Zeichen-LCD, das bis zu 32 Zeichen gleichzeitig anzeigen kann. Es verwendet das I2C-Kommunikationsprotokoll, wodurch die Anzahl der für die Steuerung benötigten GPIO-Pins reduziert wird. Dieses Projekt zeigt, wie man das LCD1602 ansteuert, um Textnachrichten anzuzeigen.

source: **Circuit Diagram**
de: **Schaltplan**

source: The circuit diagram below shows how to connect the LCD1602 to the Raspberry Pi using the I2C interface.
de: Der folgende Schaltplan zeigt, wie das LCD1602 über die I2C-Schnittstelle mit dem Raspberry Pi verbunden wird.

source: **Wiring Diagram**
de: **Verdrahtungsplan**

source: Follow these steps to build the circuit:
de: Folge diesen Schritten, um die Schaltung aufzubauen:

source: Connect the I2C interface pins (SDA and SCL) of the LCD1602 to the corresponding pins on the Fusiuon HAT.
de: Verbinde die I2C-Schnittstellenpins ( SDA und SCL ) des LCD1602 mit den entsprechenden Pins am Fusion HAT.

source: Ensure proper power supply connections to the LCD1602.
de: Stelle sicher, dass das LCD1602 korrekt mit Strom versorgt wird.

source: Verify the wiring to avoid errors.
de: Überprüfe die Verdrahtung, um Fehler zu vermeiden.

source: **Writing the Code**
de: **Den Code schreiben**

source: The following Python code initializes the LCD1602 and displays a simple greeting message:
de: Der folgende Python-Code initialisiert das LCD1602 und zeigt eine einfache Begrüßungsnachricht an:

source: This Python script interfaces with an LCD1602 display module to present a brief message. When executed:
de: Dieses Python-Skript kommuniziert mit einem LCD1602-Displaymodul, um eine kurze Nachricht anzuzeigen. Bei der Ausführung:

source: It initializes the LCD1602 display with I2C communication (default address ``0x27``).
de: Es initialisiert das LCD1602-Display über I2C-Kommunikation ( Standardadresse ``0x27`` ).

source: The first line of the display shows the text "Greetings!".
de: Die erste Zeile des Displays zeigt den Text "Greetings!" an.

source: The second line displays the text "From SunFounder".
de: Die zweite Zeile zeigt den Text "From SunFounder" an.

source: The messages remain visible for 1 seconds before the next text.
de: Die Nachrichten bleiben 1 Sekunde sichtbar, bevor der nächste Text angezeigt wird.

source: The display clears if the user interrupts the script by pressing ``Ctrl+C``.
de: Das Display wird gelöscht, wenn der Benutzer das Skript mit ``Ctrl+C`` unterbricht.
