Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/microphone.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Profitiere von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: Funsion HAT+ Microphone
de: Fusion HAT+ Mikrofon

source: **Introduction**
de: **Einführung**

source: The Fusion HAT+ includes a built-in microphone, making it ideal for audio input applications such as voice recognition, sound detection, or recording logs in AI/IoT projects.
de: Das Fusion HAT+ verfügt über ein integriertes Mikrofon und eignet sich damit ideal für Audioeingabe-Anwendungen wie Spracherkennung, Geräuscherkennung oder die Aufzeichnung von Logs in AI/IoT-Projekten.

source: This guide will help you check if the microphone is recognized by the system and show you how to perform a basic recording test.
de: Diese Anleitung hilft dir zu überprüfen, ob das Mikrofon vom System erkannt wird, und zeigt dir, wie du einen einfachen Aufnahmetest durchführst.

source: **Check if the Microphone is Recognized**
de: **Überprüfen, ob das Mikrofon erkannt wird**

source: Use the following command to check whether the system has detected the microphone:
de: Verwende den folgenden Befehl, um zu überprüfen, ob das System das Mikrofon erkannt hat:

source: This will list all audio **capture** devices available on your Raspberry Pi. Sample output:
de: Dies listet alle auf deinem Raspberry Pi verfügbaren Audio- **Aufnahme** -Geräte auf. Beispielausgabe:

source: If you see the ``voicehat-hifi`` listed, it means the microphone hardware is detected correctly.
de: Wenn ``voicehat-hifi`` in der Liste erscheint, bedeutet das, dass die Mikrofon-Hardware korrekt erkannt wurde.

source: **Test the Microphone**
de: **Das Mikrofon testen**

source: Once the microphone is enabled, you can perform a basic recording test:
de: Sobald das Mikrofon aktiviert ist, kannst du einen einfachen Aufnahmetest durchführen:

source: Record a short audio sample:
de: Nimm ein kurzes Audiobeispiel auf:

source: **Parameter Explanation**:
de: **Parametererklärung**:

source: ``rec``: Command for recording (from the `sox` package)
de: ``rec``: Befehl zum Aufnehmen ( aus dem Paket `sox` )

source: ``-c 1``: Record in mono (1 channel)
de: ``-c 1``: Aufnahme in Mono ( 1 Kanal )

source: ``test.wav``: Output file name
de: ``test.wav``: Name der Ausgabedatei

source: Playback the recorded file:
de: Die aufgenommene Datei wiedergeben:

source: If you hear your recorded voice, the microphone is working properly.
de: Wenn du deine aufgenommene Stimme hörst, funktioniert das Mikrofon ordnungsgemäß.

source: If the recorded volume is too low, you can amplify it using `sox`:
de: Wenn die aufgenommene Lautstärke zu niedrig ist, kannst du sie mit `sox` verstärken:

source: ``input.wav``: The original recording
de: ``input.wav``: Die ursprüngliche Aufnahme

source: ``output.wav``: The amplified version
de: ``output.wav``: Die verstärkte Version

source: ``gain 5``: Increase the volume by 5 dB (you can adjust this value as needed)
de: ``gain 5``: Erhöht die Lautstärke um 5 dB ( du kannst diesen Wert nach Bedarf anpassen )

source: **Adjust Microphone Volume**
de: **Mikrofonlautstärke anpassen**

source: If the recording volume is too low or muted, you can manually adjust the microphone gain:
de: Wenn die Aufnahme zu leise ist oder stummgeschaltet wurde, kannst du die Mikrofonverstärkung manuell anpassen:

source: Launch the ALSA mixer:
de: Starte den ALSA-Mixer:

source: Press ``F6`` to select the correct sound card (e.g., USB or voiceHAT audio)
de: Drücke ``F6``, um die richtige Soundkarte auszuwählen ( z. B. USB oder voiceHAT Audio )

source: Use the arrow keys to increase the microphone level. If the mic is muted, unmute it (look for `MM` at the bottom—press ``M`` to toggle).
de: Verwende die Pfeiltasten, um den Mikrofonpegel zu erhöhen. Wenn das Mikrofon stummgeschaltet ist, aktiviere es ( suche unten nach `MM` — drücke ``M``, um umzuschalten ).

source: If ``rec`` or ``sox`` is not installed, you can install them using:
de: Wenn ``rec`` oder ``sox`` nicht installiert ist, kannst du sie mit folgendem Befehl installieren:

source: **Troubleshooting**
de: **Fehlerbehebung**

source: **No input detected**:
de: **Kein Eingangssignal erkannt**:

source: Verify that ``arecord -l`` lists the correct device
de: Überprüfe, ob ``arecord -l`` das richtige Gerät auflistet

source: Try using ``arecord`` instead of ``rec`` to test manually
de: Versuche, ``arecord`` anstelle von ``rec`` für einen manuellen Test zu verwenden

source: **Audio is distorted or noisy**:
de: **Audio ist verzerrt oder verrauscht**:

source: Reduce the microphone gain in ``alsamixer``
de: Reduziere die Mikrofonverstärkung in ``alsamixer``

source: Avoid recording in noisy environments
de: Vermeide Aufnahmen in lauten Umgebungen

source: **`rec` command not found**:
de: **`rec` - Befehl nicht gefunden**:

source: Install ``sox`` with ``sudo apt install sox``
de: Installiere ``sox`` mit ``sudo apt install sox``
