Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/neopixel.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Genieße exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: NeoPixel LED Strip
de: NeoPixel LED-Streifen

source: **Introduction**
de: **Einführung**

source: In this project, we will learn how to control an addressable RGB LED strip (NeoPixel) using SPI communication on a Raspberry Pi. NeoPixels are intelligent RGB LEDs that contain their own drivers, allowing individual control of each LED in a chain. This project demonstrates basic color control and filling the entire strip with different colors.
de: In diesem Projekt lernen wir, wie man einen adressierbaren RGB-LED-Streifen (NeoPixel) über die SPI-Kommunikation auf einem Raspberry Pi steuert. NeoPixels sind intelligente RGB-LEDs mit eigenen Treibern, die eine individuelle Steuerung jeder LED in einer Kette ermöglichen. Dieses Projekt демонстрiert die grundlegende Farbsteuerung und das Füllen des gesamten Streifens mit verschiedenen Farben.

source: **Wiring Diagram**
de: **Verdrahtungsdiagramm**

source: **Setup**
de: **Einrichtung**

source: Before running the code, you need to install the required library:
de: Bevor du den Code ausführst, musst du die erforderliche Bibliothek installieren:

source: This library provides the necessary functions to control NeoPixel LEDs using SPI communication.
de: Diese Bibliothek stellt die erforderlichen Funktionen bereit, um NeoPixel-LEDs über die SPI-Kommunikation zu steuern.

source: The following Python code controls a NeoPixel LED strip, cycling through different colors:
de: Der folgende Python-Code steuert einen NeoPixel-LED-Streifen und wechselt zyklisch zwischen verschiedenen Farben:

source: This Python script demonstrates basic control of a 12-LED WS2812 ring using the NeoPixel SPI driver. When executed:
de: Dieses Python-Skript demonstriert die grundlegende Steuerung eines 12-LED-WS2812-Rings mit dem NeoPixel-SPI-Treiber. Bei der Ausführung:

source: The script initializes the SPI interface and prepares the WS2812 LED ring.
de: initialisiert das Skript die SPI-Schnittstelle und bereitet den WS2812-LED-Ring vor.

source: All LEDs cycle through red, green, and blue with 1-second intervals.
de: Alle LEDs wechseln im Abstand von einer Sekunde zwischen Rot, Grün und Blau.

source: Each color change is printed to the console for debugging.
de: Jeder Farbwechsel wird zur Fehlersuche in der Konsole ausgegeben.

source: The LEDs briefly turn off between cycles.
de: Die LEDs schalten sich zwischen den Zyklen kurz aus.

source: The program loops continuously until interrupted with Ctrl+C.
de: Das Programm läuft kontinuierlich, bis es mit Ctrl+C unterbrochen wird.

source: Troubleshooting
de: Fehlerbehebung

source: **LED Ring Not Lighting Correctly**
de: **LED-Ring leuchtet nicht korrekt**

source: **Cause:** Wrong wiring or insufficient power
de: **Ursache:** Falsche Verdrahtung oder unzureichende Stromversorgung

source: **Solution:** Ensure VCC is 5V, GND is shared, and the data line is connected to DIN (sometimes labeled RGB)
de: **Lösung:** Stelle sicher, dass VCC 5 V beträgt, GND gemeinsam ist und die Datenleitung mit DIN (manchmal als RGB bezeichnet) verbunden ist

source: **Incorrect Colors**
de: **Falsche Farben**

source: **Cause:** LED color order mismatch
de: **Ursache:** Nicht übereinstimmende LED-Farbfolge

source: **Solution:** Try different pixel orders such as ``neopixel.RGB`` or ``neopixel.GRBW``
de: **Lösung:** Probiere verschiedene Pixel-Reihenfolgen wie ``neopixel.RGB`` oder ``neopixel.GRBW``

source: **SPI Not Working**
de: **SPI funktioniert nicht**

source: **Cause:** SPI disabled or hardware conflict
de: **Ursache:** SPI deaktiviert oder Hardwarekonflikt

source: **Solution:** Enable SPI via ``sudo raspi-config``
de: **Lösung:** Aktiviere SPI über ``sudo raspi-config``

source: **Library Import Fails**
de: **Bibliotheksimport fehlgeschlagen**

source: **Cause:** Missing dependency
de: **Ursache:** Fehlende Abhängigkeit

source: **Solution:**
de: **Lösung:**
