Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/speaker.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Genieße exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: Fusion HAT+ Speaker
de: Fusion HAT+ Lautsprecher

source: **Introduction**
de: **Einführung**

source: The Fusion HAT+ includes a built-in speaker, making it ideal for voice prompts, alarms, and other AI/IoT audio applications. This lesson shows you how to enable, test, and use the speaker with text-to-speech.
de: Der Fusion HAT+ verfügt über einen integrierten Lautsprecher und eignet sich ideal für Sprachansagen, Alarme und andere Audioanwendungen in AI- und IoT-Projekten. Diese Lektion zeigt dir, wie du den Lautsprecher aktivierst, testest und mit Text-to-Speech verwendest.

source: This guide assumes Raspberry Pi OS is installed and the Fusion HAT+ drivers are properly set up.
de: Diese Anleitung setzt voraus, dass Raspberry Pi OS installiert ist und die Fusion HAT+ Treiber korrekt eingerichtet sind.

source: Speaker Setup
de: Lautsprecher-Einrichtung

source: **1. Check if the Speaker Is Recognized**
de: **1. Überprüfen, ob der Lautsprecher erkannt wird**

source: Run the following command:
de: Führe den folgenden Befehl aus:

source: You should see a sound device similar to:
de: Du solltest ein Audiogerät ähnlich dem folgenden sehen:

source: If a device appears under **card 0** or another card number, the Fusion HAT+ audio hardware is detected.
de: Wenn ein Gerät unter **card 0** oder einer anderen Kartennummer erscheint, wird die Audio-Hardware des Fusion HAT+ erkannt.

source: **2. Testing the Speaker**
de: **2. Den Lautsprecher testen**

source: Play a stereo test sound:
de: Spiele einen Stereo-Testton ab:

source: You should hear “Front Left / Front Right”. Press **Ctrl+C** to stop.
de: Du solltest „Front Left / Front Right“ hören. Drücke **Ctrl+C**, um zu stoppen.

source: Troubleshooting
de: Fehlerbehebung

source: **No sound output**
de: **Kein Tonausgang**

source: Check audio volume with:
de: Überprüfe die Lautstärke mit:

source: Confirm your Pi sees the audio device:
de: Bestätige, dass dein Pi das Audiogerät erkennt:

source: **Speaker not recognized**
de: **Lautsprecher nicht erkannt**

source: Reseat the Fusion HAT+
de: Setze den Fusion HAT+ erneut ein

source: Reboot the Raspberry Pi
de: Starte den Raspberry Pi neu

source: Ensure drivers are installed
de: Stelle sicher, dass die Treiber installiert sind

source: Or rerun:
de: Oder führe erneut aus:
