Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/project/ultrasonic.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Genieße exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: Ultrasonic Sensor Module
de: Ultraschallsensor-Modul

source: **Introduction**
de: **Einführung**

source: The ultrasonic sensor module uses ultrasonic waves to measure distances with remarkable accuracy. It emits ultrasonic waves and listens for their echo, calculating the distance based on the time taken for the echo to return. This versatile technology is commonly used in robotics, obstacle detection, and range-finding applications.
de: Das Ultraschallsensor-Modul verwendet Ultraschallwellen, um Entfernungen mit bemerkenswerter Genauigkeit zu messen. Es sendet Ultraschallwellen aus und lauscht auf deren Echo, wobei die Entfernung anhand der Zeit berechnet wird, die das Echo für die Rückkehr benötigt. Diese vielseitige Technologie wird häufig in der Robotik, Hinderniserkennung und in Entfernungsmessanwendungen eingesetzt.

source: **Circuit Diagram**
de: **Schaltplan**

source: Below is the schematic diagram for the ultrasonic sensor module:
de: Unten ist der Schaltplan für das Ultraschallsensor-Modul dargestellt:

source: **Wiring Diagram**
de: **Verdrahtungsdiagramm**

source: Assemble the circuit as shown in the diagram below:
de: Baue die Schaltung wie im folgenden Diagramm gezeigt auf:

source: Ensure the connections are secure, with the Echo pin connected to GPIO 22 and the Trigger pin to GPIO 27 of the Raspberry Pi.
de: Stelle sicher, dass alle Verbindungen fest sitzen, wobei der Echo-Pin mit GPIO 22 und der Trigger-Pin mit GPIO 27 des Raspberry Pi verbunden ist.

source: Below is the Python code for this project:
de: Unten findest du den Python-Code für dieses Projekt:

source: This Python script uses an ultrasonic distance sensor to measure the distance to an object and displays the result on the console. When executed:
de: Dieses Python-Skript verwendet einen Ultraschall-Entfernungssensor, um die Entfernung zu einem Objekt zu messen und das Ergebnis in der Konsole anzuzeigen. Wenn es ausgeführt wird:

source: The sensor, connected to GPIO pins 27 (trigger) and 22 (echo), continuously measures the distance to the nearest object.
de: Der Sensor, der mit den GPIO-Pins 27 (Trigger) und 22 (Echo) verbunden ist, misst kontinuierlich die Entfernung zum nächstgelegenen Objekt.

source: The distance is calculated in meters and converted to centimeters, then displayed in the format: ``Distance: <value> cm`` with two decimal places of precision.
de: Die Entfernung wird in Metern berechnet und in Zentimeter umgerechnet und dann im Format ``Distance: <value> cm`` mit zwei Dezimalstellen Genauigkeit angezeigt.

source: The distance is updated every 0.3 seconds, allowing for near real-time monitoring.
de: Die Entfernung wird alle 0,3 Sekunden aktualisiert, was eine nahezu Echtzeit-Überwachung ermöglicht.

source: The program runs indefinitely until interrupted with ``Ctrl+C``, at which point it exits gracefully.
de: Das Programm läuft unbegrenzt, bis es mit ``Ctrl+C`` unterbrochen wird; dann wird es ordnungsgemäß beendet.
