Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/ai_interaction/python_stt_vosk.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauchen Sie gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum mitmachen?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support** : Lösen Sie After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen** : Tauschen Sie Tipps und Tutorials aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen** : Erhalten Sie frühzeitigen Zugriff auf neue Produktankündigungen und exklusive Einblicke.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Sonderrabatte** : Profitieren Sie von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele** : Nehmen Sie an Gewinnspielen und saisonalen Aktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie noch heute bei!

source: 3. STT with Vosk (Offline)
de: 3. STT mit Vosk ( Offline )

source: Vosk is a lightweight speech-to-text (STT) engine that supports many languages and runs fully **offline** on Raspberry Pi. You only need internet access once to download a language model. After that, everything works without a network connection.
de: Vosk ist eine leichtgewichtige Speech-to-Text ( STT )-Engine, die viele Sprachen unterstützt und auf dem Raspberry Pi vollständig **offline** läuft. Sie benötigen nur einmal Internetzugang, um ein Sprachmodell herunterzuladen. Danach funktioniert alles ohne Netzwerkverbindung.

source: In this lesson, we will:
de: In dieser Lektion werden wir:

source: Check the microphone on Raspberry Pi.
de: Das Mikrofon auf dem Raspberry Pi überprüfen.

source: Install and test Vosk with a chosen language model.
de: Vosk mit einem ausgewählten Sprachmodell installieren und testen.

source: 1. Check Your Microphone
de: 1. Mikrofon überprüfen

source: Before using speech recognition, make sure your USB microphone works correctly.
de: Bevor Sie die Spracherkennung verwenden, stellen Sie sicher, dass Ihr USB-Mikrofon korrekt funktioniert.

source: List available recording devices:
de: Verfügbare Aufnahmegeräte auflisten:

source: Look for a line like ``card 1: ... device 0``.
de: Suchen Sie nach einer Zeile wie ``card 1: ... device 0`` .

source: Record a short sample (replace ``1,0`` with the numbers you found):
de: Nehmen Sie eine kurze Probe auf ( ersetzen Sie ``1,0`` durch die Zahlen, die Sie gefunden haben ):

source: Example: if your device is ``card 2, device 0``, use:
de: Beispiel: Wenn Ihr Gerät ``card 2, device 0`` ist, verwenden Sie:

source: Play it back to confirm the recording:
de: Spielen Sie die Aufnahme ab, um sie zu bestätigen:

source: Adjust microphone volume if needed:
de: Passen Sie bei Bedarf die Mikrofonlautstärke an:

source: Press **F6** to select your USB microphone.
de: Drücken Sie **F6** , um Ihr USB-Mikrofon auszuwählen.

source: Find the **Mic** or **Capture** channel.
de: Suchen Sie den Kanal **Mic** oder **Capture** .

source: Make sure it is not muted (**[MM]** means mute, press ``M`` to unmute → should show **[OO]**).
de: Stellen Sie sicher, dass es nicht stummgeschaltet ist ( **[MM]** bedeutet stumm; drücken Sie ``M`` zum Aufheben → es sollte **[OO]** anzeigen ).

source: Use ↑ / ↓ arrow keys to change the recording volume.
de: Verwenden Sie die Pfeiltasten ↑ / ↓, um die Aufnahme-Lautstärke zu ändern.

source: 2. Test Vosk
de: 2. Vosk testen

source: **Run the program**
de: **Programm ausführen**

source: The first time you run this code with a new language, Vosk will:
de: Wenn Sie diesen Code zum ersten Mal mit einer neuen Sprache ausführen, wird Vosk:

source: **Automatically download the language model** (by default, the small version).
de: **Das Sprachmodell automatisch herunterladen** ( standardmäßig die kleine Version ).

source: **Print out the list of supported languages**.
de: **Die Liste der unterstützten Sprachen ausgeben** .

source: Start **listening** for audio input through the microphone.
de: Mit dem **Zuhören** auf Audioeingaben über das Mikrofon beginnen.

source: You’ll see something like this in the terminal:
de: Im Terminal sehen Sie etwas wie folgt:

source: This means:
de: Das bedeutet:

source: The model file (``vosk-model-small-en-us-0.15``) has been downloaded.
de: Die Modelldatei ( ``vosk-model-small-en-us-0.15`` ) wurde heruntergeladen.

source: The list of supported languages has been printed.
de: Die Liste der unterstützten Sprachen wurde ausgegeben.

source: The system is now listening — say something into the Fusion HAT+ microphone, and the recognized text will appear in the terminal.
de: Das System hört jetzt zu — sagen Sie etwas in das Fusion HAT+ -Mikrofon, und der erkannte Text erscheint im Terminal.

source: **Tips:**
de: **Tipps:**

source: Keep the microphone about **15–30 cm** away for better accuracy.
de: Halten Sie das Mikrofon etwa **15–30 cm** entfernt, um eine bessere Genauigkeit zu erzielen.

source: Choose a **model that matches your language and accent**.
de: Wählen Sie ein **Modell, das zu Ihrer Sprache und Ihrem Akzent passt** .

source: Use a quiet environment to improve recognition.
de: Verwenden Sie eine ruhige Umgebung, um die Erkennung zu verbessern.

source: **Code explanation:**
de: **Code-Erklärung:**

source: ``stt.listen(stream=True)`` — Starts streaming speech recognition and yields intermediate results as you speak.
de: ``stt.listen(stream=True)`` — Startet die Streaming-Spracherkennung und liefert Zwischenergebnisse, während Sie sprechen.

source: ``result["partial"]`` — Displays the **real-time recognized text** (updated continuously).
de: ``result["partial"]`` — Zeigt den **in Echtzeit erkannten Text** an ( fortlaufend aktualisiert ).

source: ``result["final"]`` — Displays the **final recognized sentence** when you stop speaking.
de: ``result["final"]`` — Zeigt den **final erkannten Satz** an, wenn Sie aufhören zu sprechen.

source: The loop runs continuously, allowing **hands-free real-time transcription**.
de: Die Schleife läuft kontinuierlich und ermöglicht eine **freihändige Echtzeit-Transkription** .

source: Tip: This streaming mode is perfect for **voice assistants**, **command control**, or **live transcription**.
de: Tipp: Dieser Streaming-Modus ist perfekt für **Sprachassistenten** , **Befehlssteuerung** oder **Live-Transkription** .

source: Troubleshooting
de: Fehlerbehebung

source: **No such file or directory (when running `arecord`)**
de: **No such file or directory ( beim Ausführen von `arecord` )**

source: You may have used the wrong card/device number. Run:
de: Möglicherweise haben Sie die falsche Card/Device-Nummer verwendet. Führen Sie aus:

source: and replace ``1,0`` with the numbers shown for your USB microphone.
de: und ersetzen Sie ``1,0`` durch die Zahlen, die für Ihr USB-Mikrofon angezeigt werden.

source: **Recorded file has no sound**
de: **Aufgenommene Datei hat keinen Ton**

source: Open the mixer and check the microphone volume:
de: Öffnen Sie den Mixer und prüfen Sie die Mikrofonlautstärke:

source: Press **F6** to select your USB mic.
de: Drücken Sie **F6** , um Ihr USB-Mikrofon auszuwählen.

source: Make sure **Mic/Capture** is not muted (**[OO]** instead of **[MM]**).
de: Stellen Sie sicher, dass **Mic/Capture** nicht stummgeschaltet ist ( **[OO]** statt **[MM]** ).

source: Increase the level with ↑.
de: Erhöhen Sie den Pegel mit ↑.

source: **Vosk does not recognize speech**
de: **Vosk erkennt Sprache nicht**

source: Make sure the **language code** matches your model (e.g. ``en-us`` for English, ``zh-cn`` for Chinese).
de: Stellen Sie sicher, dass der **Sprachcode** zu Ihrem Modell passt ( z. B. ``en-us`` für Englisch, ``zh-cn`` für Chinesisch ).

source: Keep the microphone 15–30 cm away and avoid background noise.
de: Halten Sie das Mikrofon 15–30 cm entfernt und vermeiden Sie Hintergrundgeräusche.

source: Speak clearly and slowly.
de: Sprechen Sie klar und langsam.

source: **High latency / slow recognition**
de: **Hohe Latenz / langsame Erkennung**

source: The default auto-download is a **small model** (faster, but less accurate).
de: Der automatische Standard-Download ist ein **kleines Modell** ( schneller, aber weniger genau ).

source: If it’s still slow, close other programs to free CPU.
de: Wenn es immer noch langsam ist, schließen Sie andere Programme, um CPU-Ressourcen freizugeben.
