Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/ai_interaction/python_llm_ollama.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauchen Sie gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum mitmachen?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support** : Lösen Sie After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen** : Tauschen Sie Tipps und Tutorials aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen** : Erhalten Sie frühzeitigen Zugriff auf neue Produktankündigungen und exklusive Einblicke.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Sonderrabatte** : Profitieren Sie von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele** : Nehmen Sie an Gewinnspielen und saisonalen Aktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie noch heute bei!

source: 4. Text Vision Talk with Ollama
de: 4. Text-Vision-Talk mit Ollama

source: In this lesson, you will learn how to use **Ollama**, a tool for running large language and vision models locally. We will show you how to install Ollama, download a model, and connect Fusion HAT+ to it.
de: In dieser Lektion lernen Sie, wie Sie **Ollama** verwenden — ein Tool, um große Sprach- und Vision-Modelle lokal auszuführen. Wir zeigen Ihnen, wie Sie Ollama installieren, ein Modell herunterladen und Fusion HAT+ damit verbinden.

source: With this setup, Fusion HAT+ can take a camera snapshot and the model will **see and tell** — you can ask any question about the image, and the model will reply in natural language.
de: Mit diesem Setup kann Fusion HAT+ einen Kameraschnappschuss aufnehmen und das Modell wird **sehen und beschreiben** — Sie können jede Frage zum Bild stellen, und das Modell antwortet in natürlicher Sprache.

source: 1. Install Ollama (LLM) and Download Model
de: 1. Ollama ( LLM ) installieren und Modell herunterladen

source: You can choose where to install **Ollama**:
de: Sie können auswählen, wo Sie **Ollama** installieren :

source: On your Raspberry Pi (local run)
de: Auf Ihrem Raspberry Pi ( lokal ausführen )

source: Or on another computer (Mac/Windows/Linux) in the **same local network**
de: Oder auf einem anderen Computer ( Mac / Windows / Linux ) im **gleichen lokalen Netzwerk**

source: **Recommended models vs hardware**
de: **Empfohlene Modelle vs. Hardware**

source: You can choose any model available on |link_ollama_hub|. Models come in different sizes (3B, 7B, 13B, 70B...). Smaller models run faster and require less memory, while larger models provide better quality but need powerful hardware.
de: Sie können jedes Modell wählen, das auf |link_ollama_hub| verfügbar ist. Modelle gibt es in verschiedenen Größen ( 3B, 7B, 13B, 70B ... ). Kleinere Modelle laufen schneller und benötigen weniger Speicher, während größere Modelle eine bessere Qualität liefern, aber leistungsstarke Hardware erfordern.

source: Check the table below to decide which model size fits your device.
de: Sehen Sie sich die Tabelle unten an, um zu entscheiden, welche Modellgröße zu Ihrem Gerät passt.

source: Model size
de: Modellgröße

source: Min RAM Required
de: Min. benötigter RAM

source: Recommended Hardware
de: Empfohlene Hardware

source: ~3B parameters
de: ~3B Parameter

source: 8GB (16GB better)
de: 8 GB ( 16 GB besser )

source: Raspberry Pi 5 (16GB) or mid-range PC/Mac
de: Raspberry Pi 5 ( 16 GB ) oder Mittelklasse-PC / Mac

source: ~7B parameters
de: ~7B Parameter

source: Pi 5 (16GB, just usable) or mid-range PC/Mac
de: Pi 5 ( 16 GB, gerade noch nutzbar ) oder Mittelklasse-PC / Mac

source: ~13B parameters
de: ~13B Parameter

source: Desktop PC / Mac with high RAM
de: Desktop-PC / Mac mit viel RAM

source: 30B+ parameters
de: 30B+ Parameter

source: Workstation / Server / GPU recommended
de: Workstation / Server / GPU empfohlen

source: 70B+ parameters
de: 70B+ Parameter

source: High-end server with multiple GPUs
de: High-End-Server mit mehreren GPUs

source: **Install on Raspberry Pi**
de: **Auf Raspberry Pi installieren**

source: If you want to run Ollama directly on your Raspberry Pi:
de: Wenn Sie Ollama direkt auf Ihrem Raspberry Pi ausführen möchten :

source: Use a **64-bit Raspberry Pi OS**
de: Verwenden Sie ein **64-Bit Raspberry Pi OS**

source: Strongly recommended: **Raspberry Pi 5 (16GB RAM)**
de: Dringend empfohlen : **Raspberry Pi 5 ( 16 GB RAM )**

source: Run the following commands:
de: Führen Sie die folgenden Befehle aus :

source: **Install on Mac / Windows / Linux (Desktop App)**
de: **Auf Mac / Windows / Linux installieren ( Desktop-App )**

source: Download and install Ollama from |link_ollama|
de: Laden Sie Ollama über |link_ollama| herunter und installieren Sie es

source: Open the Ollama app, go to the **Model Selector**, and use the search bar to find a model. For example, type ``llama3.2:3b`` (a small and lightweight model to start with).
de: Öffnen Sie die Ollama-App, gehen Sie zum **Model Selector** und verwenden Sie die Suchleiste, um ein Modell zu finden. Tippen Sie z. B. ``llama3.2:3b`` ein ( ein kleines und leichtgewichtiges Modell für den Einstieg ).

source: After the download is complete, type something simple like “Hi” in the chat window, Ollama will automatically start downloading it when you first use it.
de: Nachdem der Download abgeschlossen ist, geben Sie im Chatfenster etwas Einfaches wie „Hi“ ein. Ollama startet den Download automatisch, wenn Sie das Modell zum ersten Mal verwenden.

source: Go to **Settings** → enable **Expose Ollama to the network**. This allows your Raspberry Pi to connect to it over LAN.
de: Gehen Sie zu **Settings** → aktivieren Sie **Expose Ollama to the network** . Dadurch kann sich Ihr Raspberry Pi über LAN damit verbinden.

source: If you see an error like:
de: Wenn Sie einen Fehler sehen wie :

source: The model is too large for your machine. Use a **smaller model** or switch to a computer with more RAM.
de: Das Modell ist zu groß für Ihren Rechner. Verwenden Sie ein **kleineres Modell** oder wechseln Sie zu einem Computer mit mehr RAM.

source: 2. Test Ollama
de: 2. Ollama testen

source: Once Ollama is installed and your model is ready, you can quickly test it with a minimal chat loop.
de: Sobald Ollama installiert ist und Ihr Modell bereit ist, können Sie es schnell mit einer minimalen Chat-Schleife testen.

source: **Run the program**
de: **Programm ausführen**

source: Now you can chat with Fusion HAT+ directly from the terminal.
de: Jetzt können Sie direkt im Terminal mit Fusion HAT+ chatten.

source: You can choose **any model** available on |link_ollama_hub|, but smaller models (e.g. ``moondream:1.8b``, ``phi3:mini``) are recommended if you only have 8–16GB RAM.
de: Sie können **jedes Modell** wählen, das auf |link_ollama_hub| verfügbar ist, aber kleinere Modelle ( z. B. ``moondream:1.8b``, ``phi3:mini`` ) werden empfohlen, wenn Sie nur 8 – 16 GB RAM haben.

source: Make sure the model you specify in the code matches the model you have already pulled in Ollama.
de: Stellen Sie sicher, dass das im Code angegebene Modell mit dem Modell übereinstimmt, das Sie bereits in Ollama heruntergeladen haben.

source: Type ``exit`` or ``quit`` to stop the program.
de: Geben Sie ``exit`` oder ``quit`` ein, um das Programm zu beenden.

source: If you cannot connect, ensure that Ollama is running and that both devices are on the same LAN if you are using a remote host.
de: Wenn keine Verbindung möglich ist, stellen Sie sicher, dass Ollama läuft und dass sich beide Geräte im gleichen LAN befinden, wenn Sie einen Remote-Host verwenden.

source: 3. Vision Talk with Ollama
de: 3. Vision-Talk mit Ollama

source: In this demo, the Pi camera takes a snapshot **each time you type a question**. The program sends **your typed text + the new photo** to a local vision model via Ollama, and then streams the model’s reply in plain English. This is a minimal “see & tell” baseline you can later extend with color/face/QR checks.
de: In dieser Demo macht die Pi-Kamera **jedes Mal, wenn Sie eine Frage eingeben** , einen Schnappschuss. Das Programm sendet **Ihren eingegebenen Text + das neue Foto** über Ollama an ein lokales Vision-Modell und streamt anschließend die Antwort des Modells in einfachem Englisch. Dies ist eine minimale „see & tell“-Basis, die Sie später mit Farb- / Gesichts- / QR-Prüfungen erweitern können.

source: **Before You Start**
de: **Bevor Sie beginnen**

source: Open the **Ollama** app (or run the service) and make sure a **vision-capable model** is pulled.
de: Öffnen Sie die **Ollama** -App ( oder starten Sie den Dienst ) und stellen Sie sicher, dass ein **Vision-fähiges Modell** heruntergeladen ist.

source: If you have enough memory (≥16GB RAM), you may try ``llava:7b``.
de: Wenn Sie genügend Speicher ( ≥ 16 GB RAM ) haben, können Sie ``llava:7b`` ausprobieren.

source: If you only have **8GB RAM**, prefer a smaller model such as ``moondream:1.8b`` or ``granite3.2-vision:2b``.
de: Wenn Sie nur **8 GB RAM** haben, bevorzugen Sie ein kleineres Modell wie ``moondream:1.8b`` oder ``granite3.2-vision:2b`` .

source: **Run the Demo**
de: **Demo ausführen**

source: Go to the example folder and run the script:
de: Wechseln Sie in den Beispielordner und führen Sie das Skript aus :

source: What happens when it runs:
de: Was passiert beim Ausführen :

source: The program prints a welcome line and waits for your input (``>>>``).
de: Das Programm gibt eine Begrüßungszeile aus und wartet auf Ihre Eingabe ( ``>>>`` ).

source: **Every time you type anything** (e.g., “hello”, “Is there yellow?”, “Any faces?”, “What is on the desk?”), it:
de: **Jedes Mal, wenn Sie etwas eingeben** ( z. B. „hello“, „Is there yellow?“, „Any faces?“, „What is on the desk?“ ), wird :

source: **captures a photo** from the Pi camera (saved to ``/tmp/llm-img.jpg``),
de: **ein Foto aufgenommen** von der Pi-Kamera ( gespeichert unter ``/tmp/llm-img.jpg`` ),

source: **sends your text + the photo** to the vision model via Ollama,
de: **Ihr Text + das Foto gesendet** an das Vision-Modell über Ollama,

source: **streams back** the model’s answer to the terminal.
de: **die Antwort des Modells gestreamt** zurück ins Terminal.

source: Type ``exit`` or ``quit`` to end the program.
de: Geben Sie ``exit`` oder ``quit`` ein, um das Programm zu beenden.

source: Troubleshooting
de: Fehlerbehebung

source: **I get an error like: `model requires more system memory ...`.**
de: **Ich erhalte einen Fehler wie: `model requires more system memory ...`.**

source: This means the model is too large for your device.
de: Das bedeutet, dass das Modell zu groß für Ihr Gerät ist.

source: Use a smaller model such as ``moondream:1.8b`` or ``granite3.2-vision:2b``.
de: Verwenden Sie ein kleineres Modell wie ``moondream:1.8b`` oder ``granite3.2-vision:2b``.

source: Or switch to a machine with more RAM and expose Ollama to the network.
de: Oder wechseln Sie zu einem Rechner mit mehr RAM und geben Sie Ollama im Netzwerk frei.

source: **The code cannot connect to Ollama (connection refused).**
de: **Der Code kann keine Verbindung zu Ollama herstellen ( Verbindung verweigert ).**

source: Check the following:
de: Prüfen Sie Folgendes :

source: Make sure Ollama is running (``ollama serve`` or the desktop app is open).
de: Stellen Sie sicher, dass Ollama läuft ( ``ollama serve`` oder die Desktop-App ist geöffnet ).

source: If using a remote computer, enable **Expose to network** in Ollama settings.
de: Wenn Sie einen Remote-Computer verwenden, aktivieren Sie **Expose to network** in den Ollama-Einstellungen.

source: Double-check that the ``ip="..."`` in your code matches the correct LAN IP.
de: Überprüfen Sie, ob ``ip="..."`` in Ihrem Code mit der korrekten LAN-IP übereinstimmt.

source: Confirm both devices are on the same local network.
de: Bestätigen Sie, dass beide Geräte im gleichen lokalen Netzwerk sind.

source: **My Pi camera does not capture anything.**
de: **Meine Pi-Kamera nimmt nichts auf.**

source: Verify that ``Picamera2`` is installed and working with a simple test script.
de: Überprüfen Sie, ob ``Picamera2`` installiert ist und mit einem einfachen Testskript funktioniert.

source: Check that the camera cable is properly connected and enabled in ``raspi-config``.
de: Prüfen Sie, ob das Kamerakabel korrekt angeschlossen ist und in ``raspi-config`` aktiviert wurde.

source: Ensure your script has permission to write to the target path (``/tmp/llm-img.jpg``).
de: Stellen Sie sicher, dass Ihr Skript Schreibrechte für den Zielpfad hat ( ``/tmp/llm-img.jpg`` ).

source: **The output is too slow.**
de: **Die Ausgabe ist zu langsam.**

source: Smaller models reply faster, but with simpler answers.
de: Kleinere Modelle antworten schneller, liefern aber einfachere Antworten.

source: You can lower the camera resolution (e.g., 640×480 instead of 1280×720) to speed up image processing.
de: Sie können die Kameraauflösung verringern ( z. B. 640×480 statt 1280×720 ), um die Bildverarbeitung zu beschleunigen.

source: Close other programs on your Pi to free up CPU and RAM.
de: Schließen Sie andere Programme auf Ihrem Pi, um CPU und RAM freizugeben.
