Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/ai_interaction/python_online_llms.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauchen Sie gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum mitmachen?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support** : Lösen Sie After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen** : Tauschen Sie Tipps und Tutorials aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen** : Erhalten Sie frühzeitigen Zugriff auf neue Produktankündigungen und exklusive Einblicke.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Sonderrabatte** : Profitieren Sie von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele** : Nehmen Sie an Gewinnspielen und saisonalen Aktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie noch heute bei!

source: 5. Connecting to Online LLMs
de: 5. Verbindung zu Online-LLMs herstellen

source: In this lesson, we'll learn how to connect your Fusion HAT+ (or Raspberry Pi) to different **online Large Language Models (LLMs)**. Each provider requires an API key and offers different models you can choose from.
de: In dieser Lektion lernen wir, wie Sie Ihr Fusion HAT+ ( oder Raspberry Pi ) mit verschiedenen **Online Large Language Models ( LLMs )** verbinden. Jeder Anbieter benötigt einen API-Schlüssel und bietet unterschiedliche Modelle zur Auswahl an.

source: We'll cover how to:
de: Wir behandeln, wie Sie:

source: Create and save your API keys safely.
de: Ihre API-Schlüssel sicher erstellen und speichern.

source: Pick a model that fits your needs.
de: Ein Modell auswählen, das zu Ihren Anforderungen passt.

source: Run our example code to chat with the models.
de: Unser Beispielprogramm ausführen, um mit den Modellen zu chatten.

source: Let's go step by step for each provider.
de: Gehen wir Anbieter für Anbieter Schritt für Schritt vor.

source: OpenAI provides powerful models like **GPT-4o** and **GPT-4.1** that can be used for both text and vision tasks.
de: OpenAI bietet leistungsstarke Modelle wie **GPT-4o** und **GPT-4.1** , die sowohl für Text- als auch für Vision-Aufgaben verwendet werden können.

source: Here's how to set it up:
de: So richten Sie es ein:

source: **Get and Save your API Key**
de: **API-Schlüssel abrufen und speichern**

source: Go to |link_openai_platform| and log in. On the **API keys** page, click **Create new secret key**.
de: Gehen Sie zu |link_openai_platform| und melden Sie sich an. Klicken Sie auf der Seite **API keys** auf **Create new secret key** .

source: Fill in the details (Owner, Name, Project, and permissions if needed), then click **Create secret key**.
de: Füllen Sie die Details aus ( Owner, Name, Project und ggf. Berechtigungen ) und klicken Sie dann auf **Create secret key** .

source: Once the key is created, copy it right away — you won't be able to see it again. If you lose it, you'll need to generate a new one.
de: Sobald der Schlüssel erstellt ist, kopieren Sie ihn sofort — Sie können ihn später nicht mehr anzeigen. Wenn Sie ihn verlieren, müssen Sie einen neuen erzeugen.

source: In your project folder (for example: ``/``), create a file called ``secret.py``:
de: Erstellen Sie in Ihrem Projektordner ( zum Beispiel: ``/`` ) eine Datei mit dem Namen ``secret.py`` :

source: Paste your key into the file like this:
de: Fügen Sie Ihren Schlüssel so in die Datei ein:

source: **Enable billing and check models**
de: **Abrechnung aktivieren und Modelle prüfen**

source: Before using the key, go to the **Billing** page in your OpenAI account, add your payment details, and top up a small amount of credits.
de: Bevor Sie den Schlüssel verwenden, gehen Sie in Ihrem OpenAI-Konto zur Seite **Billing** , hinterlegen Sie Ihre Zahlungsdaten und laden Sie ein kleines Guthaben auf.

source: Then go to the **Limits** page to check which models are available for your account and copy the exact model ID to use in your code.
de: Gehen Sie anschließend zur Seite **Limits** , um zu prüfen, welche Modelle für Ihr Konto verfügbar sind, und kopieren Sie die exakte Modell-ID für Ihren Code.

source: **Test with example code**
de: **Mit Beispielcode testen**

source: Open our sample code:
de: Öffnen Sie unseren Beispielcode:

source: Replace the content with the code below, and update ``model="xxx"`` to the model you want (for example, ``gpt-4o``):
de: Ersetzen Sie den Inhalt durch den Code unten und aktualisieren Sie ``model="xxx"`` auf das gewünschte Modell ( zum Beispiel ``gpt-4o`` ):

source: Save and exit (``Ctrl+X``, then ``Y``, then ``Enter``).
de: Speichern und beenden ( ``Ctrl+X`` , dann ``Y`` , dann ``Enter`` ).

source: Finally, run the test:
de: Führen Sie abschließend den Test aus:

source: Gemini is Google's family of AI models. It's fast and great for general-purpose tasks.
de: Gemini ist Googles Familie von KI-Modellen. Es ist schnell und eignet sich hervorragend für allgemeine Aufgaben.

source: Log in to |link_google_ai|, then go to the API Keys page.
de: Melden Sie sich bei |link_google_ai| an und gehen Sie dann zur Seite „API Keys“.

source: Click the **Create API key** button in the top-right corner.
de: Klicken Sie oben rechts auf **Create API key** .

source: You can create a key for an existing project or a new one.
de: Sie können einen Schlüssel für ein bestehendes Projekt oder ein neues erstellen.

source: Copy the generated API key.
de: Kopieren Sie den generierten API-Schlüssel.

source: In your project folder:
de: In Ihrem Projektordner:

source: Paste the key:
de: Fügen Sie den Schlüssel ein:

source: **Check available models**
de: **Verfügbare Modelle prüfen**

source: Go to the official |link_gemini_model| page, here you’ll see the list of models, their exact API IDs, and which use case each one is optimized for.
de: Gehen Sie zur offiziellen Seite |link_gemini_model|. Dort sehen Sie die Liste der Modelle, ihre exakten API-IDs und für welchen Anwendungsfall jedes Modell optimiert ist.

source: Open the test file:
de: Öffnen Sie die Testdatei:

source: Replace the content with the code below, and update ``model="xxx"`` to the model you want (for example, ``gemini-2.5-flash``):
de: Ersetzen Sie den Inhalt durch den Code unten und aktualisieren Sie ``model="xxx"`` auf das gewünschte Modell ( zum Beispiel ``gemini-2.5-flash`` ):

source: Save and run:
de: Speichern und ausführen:

source: Qwen is a family of large language and multimodal models provided by Alibaba Cloud. These models support text generation, reasoning, and multimodal understanding (such as image analysis).
de: Qwen ist eine Familie großer Sprach- und multimodaler Modelle von Alibaba Cloud. Diese Modelle unterstützen Textgenerierung, Schlussfolgern und multimodales Verständnis ( z. B. Bildanalyse ).

source: **Get an API Key**
de: **API-Schlüssel erhalten**

source: To call Qwen models, you need an **API Key**. Most international users should use the **DashScope International (Model Studio)** console. Mainland China users can instead use the **Bailian (百炼)** console.
de: Um Qwen-Modelle aufzurufen, benötigen Sie einen **API-Schlüssel** . Die meisten internationalen Nutzer sollten die Konsole **DashScope International ( Model Studio )** verwenden. Nutzer in Festlandchina können stattdessen die Konsole **Bailian ( 百炼 )** verwenden.

source: **For International Users**
de: **Für internationale Nutzer**

source: Go to the official |link_qwen_inter| page on **Alibaba Cloud**.
de: Gehen Sie zur offiziellen Seite |link_qwen_inter| auf **Alibaba Cloud** .

source: Sign in or create an **Alibaba Cloud** account.
de: Melden Sie sich an oder erstellen Sie ein **Alibaba Cloud** -Konto.

source: Navigate to **Model Studio** (choose Singapore or Beijing region).
de: Navigieren Sie zu **Model Studio** ( wählen Sie die Region Singapur oder Peking ).

source: If an “Activate Now” prompt appears at the top of the page, click it to activate Model Studio and receive the free quota (Singapore only).
de: Wenn oben auf der Seite eine Aufforderung „Activate Now“ erscheint, klicken Sie darauf, um Model Studio zu aktivieren und das kostenlose Kontingent zu erhalten ( nur Singapur ).

source: Activation is free — you will only be charged after your free quota is used.
de: Die Aktivierung ist kostenlos — Ihnen werden erst Kosten berechnet, nachdem Ihr kostenloses Kontingent aufgebraucht ist.

source: If no activation prompt appears, the service is already active.
de: Wenn keine Aktivierungsaufforderung erscheint, ist der Dienst bereits aktiv.

source: Go to the **Key Management** page. On the **API Key** tab, click **Create API Key**.
de: Gehen Sie zur Seite **Key Management** . Klicken Sie im Tab **API Key** auf **Create API Key** .

source: After creation, copy your API Key and keep it safe.
de: Nach dem Erstellen kopieren Sie Ihren API-Schlüssel und bewahren Sie ihn sicher auf.

source: Users in Hong Kong, Macau, and Taiwan should also choose the **International (Model Studio)** option.
de: Nutzer in Hongkong, Macau und Taiwan sollten ebenfalls die Option **International ( Model Studio )** wählen.

source: **For Mainland China Users**
de: **Für Nutzer in Festlandchina**

source: If you are in Mainland China, you can use the **Alibaba Cloud Bailian (百炼)** console instead:
de: Wenn Sie sich in Festlandchina befinden, können Sie stattdessen die Konsole **Alibaba Cloud Bailian ( 百炼 )** verwenden:

source: Log in to |link_aliyun| (Bailian console) and complete account verification.
de: Melden Sie sich bei |link_aliyun| ( Bailian-Konsole ) an und schließen Sie die Kontoverifizierung ab.

source: Select **Create API Key**. If prompted that model services are not activated, click **Activate**, agree to the terms, and claim your free quota. After activation, the **Create API Key** button will be enabled.
de: Wählen Sie **Create API Key** . Wenn Sie darauf hingewiesen werden, dass Modelldienste nicht aktiviert sind, klicken Sie auf **Activate** , stimmen Sie den Bedingungen zu und fordern Sie Ihr kostenloses Kontingent an. Nach der Aktivierung wird die Schaltfläche **Create API Key** verfügbar.

source: Click **Create API Key** again, check your account, and then click **Confirm**.
de: Klicken Sie erneut auf **Create API Key** , prüfen Sie Ihr Konto und klicken Sie dann auf **Confirm** .

source: Once created, copy your API Key.
de: Sobald er erstellt ist, kopieren Sie Ihren API-Schlüssel.

source: **Save your API Key**
de: **API-Schlüssel speichern**

source: Paste your key like this:
de: Fügen Sie Ihren Schlüssel so ein:

source: Replace the content with the code below, and update ``model="xxx"`` to the model you want (for example, ``qwen-plus``):
de: Ersetzen Sie den Inhalt durch den Code unten und aktualisieren Sie ``model="xxx"`` auf das gewünschte Modell ( zum Beispiel ``qwen-plus`` ):

source: Run with:
de: Ausführen mit:

source: Grok is xAI’s conversational AI, created by Elon Musk’s team. You can connect to it through the xAI API.
de: Grok ist die konversationelle KI von xAI, entwickelt vom Team von Elon Musk. Sie können sie über die xAI-API anbinden.

source: Sign up for an account here: |link_grok_ai|. Add some credits to your account first — otherwise the API won’t work.
de: Registrieren Sie sich hier: |link_grok_ai|. Laden Sie zuerst Guthaben auf Ihr Konto — sonst funktioniert die API nicht.

source: Go to the API Keys page, click **Create API key**.
de: Gehen Sie zur Seite „API Keys“ und klicken Sie auf **Create API key** .

source: Enter a name for the key, then click **Create API key**.
de: Geben Sie einen Namen für den Schlüssel ein und klicken Sie dann auf **Create API key** .

source: Copy the generated key and keep it safe.
de: Kopieren Sie den generierten Schlüssel und bewahren Sie ihn sicher auf.

source: Go to the Models page in the xAI console. Here you can see all the models available to your team, along with their exact API IDs — use these IDs in your code.
de: Gehen Sie in der xAI-Konsole zur Seite „Models“. Dort sehen Sie alle für Ihr Team verfügbaren Modelle zusammen mit ihren exakten API-IDs — verwenden Sie diese IDs in Ihrem Code.

source: Replace the content with the code below, and update ``model="xxx"`` to the model you want (for example, ``grok-4-latest``):
de: Ersetzen Sie den Inhalt durch den Code unten und aktualisieren Sie ``model="xxx"`` auf das gewünschte Modell ( zum Beispiel ``grok-4-latest`` ):

source: DeepSeek is a Chinese LLM provider that offers affordable and capable models.
de: DeepSeek ist ein chinesischer LLM-Anbieter, der günstige und leistungsfähige Modelle anbietet.

source: Log in to |link_deepseek|.
de: Melden Sie sich bei |link_deepseek| an.

source: In the top-right menu, select **API Keys → Create API Key**.
de: Wählen Sie im Menü oben rechts **API Keys → Create API Key** .

source: Enter a name, click **Create**, then copy the key.
de: Geben Sie einen Namen ein, klicken Sie auf **Create** und kopieren Sie dann den Schlüssel.

source: Add your key:
de: Fügen Sie Ihren Schlüssel hinzu:

source: **Enable billing**
de: **Abrechnung aktivieren**

source: You'll need to recharge your account first. Start with a small amount (like ¥10 RMB).
de: Sie müssen Ihr Konto zuerst aufladen. Beginnen Sie mit einem kleinen Betrag ( z. B. ¥10 RMB ).

source: **Available models**
de: **Verfügbare Modelle**

source: At the time of writing (2025-09-12), DeepSeek offers:
de: Zum Zeitpunkt der Erstellung ( 2025-09-12 ) bietet DeepSeek an:

source: Replace the content with the code below, and update ``model="xxx"`` to the model you want (for example, ``deepseek-chat``):
de: Ersetzen Sie den Inhalt durch den Code unten und aktualisieren Sie ``model="xxx"`` auf das gewünschte Modell ( zum Beispiel ``deepseek-chat`` ):

source: Run:
de: Ausführen:

source: Doubao is ByteDance's AI model platform (Volcengine Ark).
de: Doubao ist ByteDances KI-Modellplattform ( Volcengine Ark ).

source: Log in to |link_doubao|.
de: Melden Sie sich bei |link_doubao| an.

source: In the left menu, scroll down to **API Key Management → Create API Key**.
de: Scrollen Sie im linken Menü nach unten zu **API Key Management → Create API Key** .

source: Choose a name and click **Create**.
de: Wählen Sie einen Namen und klicken Sie auf **Create** .

source: Click the **Show API Key** icon and copy it.
de: Klicken Sie auf das Symbol **Show API Key** und kopieren Sie den Schlüssel.

source: **Choose a model**
de: **Ein Modell auswählen**

source: Go to the model marketplace and pick a model.
de: Gehen Sie zum Modell-Marktplatz und wählen Sie ein Modell aus.

source: For example, choose **Doubao-seed-1.6**, then click **API 接入**.
de: Wählen Sie zum Beispiel **Doubao-seed-1.6** und klicken Sie dann auf **API 接入** .

source: Select your API Key and click **Use API**.
de: Wählen Sie Ihren API-Schlüssel aus und klicken Sie auf **Use API** .

source: Click **Enable Model**.
de: Klicken Sie auf **Enable Model** .

source: Hover over the model ID to copy it.
de: Fahren Sie mit der Maus über die Modell-ID, um sie zu kopieren.

source: Replace the content with the code below, and update ``model="xxx"`` to the model you want (for example, ``doubao-seed-1-6-250615``):
de: Ersetzen Sie den Inhalt durch den Code unten und aktualisieren Sie ``model="xxx"`` auf das gewünschte Modell ( zum Beispiel ``doubao-seed-1-6-250615`` ):

source: General
de: Allgemein

source: This project supports connecting to multiple LLM platforms through a unified interface. We have built-in compatibility with:
de: Dieses Projekt unterstützt die Verbindung zu mehreren LLM-Plattformen über eine einheitliche Schnittstelle. Wir bieten integrierte Kompatibilität mit:

source: In addition, you can connect to **any other LLM service that is compatible with the OpenAI API format**. For those platforms, you will need to manually obtain your **API Key** and the correct **base_url**.
de: Außerdem können Sie **jeden anderen LLM-Dienst verbinden, der mit dem OpenAI-API-Format kompatibel ist** . Für diese Plattformen müssen Sie Ihren **API-Schlüssel** und die korrekte **base_url** manuell beschaffen.

source: **Get and Save Your API Key**
de: **API-Schlüssel abrufen und speichern**

source: Obtain an **API Key** from the platform you want to use. (See each platform’s official console for details.)
de: Besorgen Sie sich einen **API-Schlüssel** von der Plattform, die Sie verwenden möchten. ( Details finden Sie in der offiziellen Konsole des jeweiligen Anbieters. )

source: In your project folder, create a new file:
de: Erstellen Sie in Ihrem Projektordner eine neue Datei:

source: Add your key into ``secret.py``:
de: Fügen Sie Ihren Schlüssel in ``secret.py`` ein:

source: Keep your API Key private. Do not upload ``secret.py`` to public repositories.
de: Halten Sie Ihren API-Schlüssel privat. Laden Sie ``secret.py`` nicht in öffentliche Repositories hoch.

source: **Test With Example Code**
de: **Mit Beispielcode testen**

source: Replace the content of a Python file with the following example, and fill in the correct ``base_url`` and ``model`` for your platform:
de: Ersetzen Sie den Inhalt einer Python-Datei durch das folgende Beispiel und tragen Sie die korrekte ``base_url`` und ``model`` für Ihre Plattform ein:

source: About ``base_url``: We support the **OpenAI API format**, as well as any API that is **compatible** with it. Each provider has its own ``base_url``. Please check their documentation.
de: Zu ``base_url`` : Wir unterstützen das **OpenAI-API-Format** sowie jede API, die damit **kompatibel** ist. Jeder Anbieter hat seine eigene ``base_url``. Bitte prüfen Sie die Dokumentation des Anbieters.

source: Run the program:
de: Führen Sie das Programm aus:
