Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/ai_interaction/python_ai_assistant.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauchen Sie gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum mitmachen?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support** : Lösen Sie After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen** : Tauschen Sie Tipps und Tutorials aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen** : Erhalten Sie frühzeitigen Zugriff auf neue Produktankündigungen und exklusive Einblicke.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Sonderrabatte** : Profitieren Sie von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele** : Nehmen Sie an Gewinnspielen und saisonalen Aktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie noch heute bei!

source: 7. AI Voice Assistant
de: 7. KI-Sprachassistent

source: This lesson turns your Fusion HAT+ into a **voice-first AI assistant**. With the provided code, the robot will: **wait for a wake word**, **transcribe your speech** with Vosk, send it to an **OpenAI LLM**, and **speak back** using Piper TTS.
de: Diese Lektion verwandelt Ihren Fusion HAT+ in einen **sprachzentrierten KI-Assistenten**. Mit dem bereitgestellten Code wird der Roboter : **auf ein Aktivierungswort warten** , **Ihre Sprache mit Vosk transkribieren** , sie an ein **OpenAI LLM** senden und **mit Piper TTS antworten** .

source: Before You Start
de: Bevor Sie beginnen

source: Make sure you have:
de: Stellen Sie sicher, dass Sie Folgendes haben :

source: :ref:`test_piper` — Piper voice works (e.g., you can play “Hello”).
de: :ref:`test_piper` — Die Piper-Stimme funktioniert ( z. B. können Sie „Hello“ abspielen ).

source: :ref:`test_vosk` — Vosk STT works for your language (e.g., ``en-us``).
de: :ref:`test_vosk` — Vosk STT funktioniert für Ihre Sprache ( z. B. ``en-us`` ).

source: :ref:`py_online_llm` — Your **OpenAI API key** saved in ``secret.py`` as ``OPENAI_API_KEY``.
de: :ref:`py_online_llm` — Ihr **OpenAI API-Schlüssel** ist in ``secret.py`` als ``OPENAI_API_KEY`` gespeichert.

source: A working **microphone** and **speaker** on Fusion HAT.
de: Ein funktionierendes **Mikrofon** und ein **Lautsprecher** am Fusion HAT.

source: A stable network connection (LLM is online).
de: Eine stabile Netzwerkverbindung ( das LLM ist online ).

source: Run the Example
de: Beispiel ausführen

source: **Configuration used by the code:**
de: **Vom Code verwendete Konfiguration:**

source: Wake word: ``"hey buddy"``
de: Aktivierungswort : ``"hey buddy"``

source: Keyboard input: **enabled** (optional manual input)
de: Tastatureingabe : **aktiviert** ( optionale manuelle Eingabe )

source: Image mode: **enabled** (``WITH_IMAGE=True``) — requires a multimodal-capable LLM if you decide to use images later
de: Bildmodus : **aktiviert** ( ``WITH_IMAGE=True`` ) — erfordert ein multimodalfähiges LLM, wenn Sie später Bilder verwenden möchten

source: **What happens:**
de: **Was passiert:**

source: The assistant shows a welcome message with the wake phrase.
de: Der Assistent zeigt eine Willkommensnachricht mit der Aktivierungsphrase an.

source: It listens for **“hey buddy”**.
de: Er hört auf **„hey buddy“** .

source: After wake, your speech is transcribed (Vosk → text).
de: Nach der Aktivierung wird Ihre Sprache transkribiert ( Vosk → Text ).

source: The text is sent to **OpenAI (gpt-4o-mini)** for a response.
de: Der Text wird zur Antwort an **OpenAI ( gpt-4o-mini )** gesendet.

source: The answer is spoken with **Piper** (``en_US-ryan-low``).
de: Die Antwort wird mit **Piper** ( ``en_US-ryan-low`` ) gesprochen.

source: **Example interaction**
de: **Beispielinteraktion**

source: **Code explanation:**
de: **Code-Erklärung:**

source: ``OpenAI(..., model="gpt-4o-mini")`` — Uses **OpenAI** as the only LLM in this lesson.
de: ``OpenAI( ..., model="gpt-4o-mini" )`` — Verwendet **OpenAI** als einziges LLM in dieser Lektion.

source: ``NAME`` / ``WAKE_WORD`` — Personalize the assistant (“Buddy”, “hey buddy”).
de: ``NAME`` / ``WAKE_WORD`` — Personalisieren Sie den Assistenten ( „Buddy“, „hey buddy“ ).

source: ``WITH_IMAGE=True`` — Enables image mode in the assistant (no image I/O logic included here).
de: ``WITH_IMAGE=True`` — Aktiviert den Bildmodus im Assistenten ( hier ist keine Bild-E/A-Logik enthalten ).

source: ``TTS_MODEL="en_US-ryan-low"`` — Piper voice used for replies.
de: ``TTS_MODEL="en_US-ryan-low"`` — Für Antworten wird die Piper-Stimme verwendet.

source: ``STT_LANGUAGE="en-us"`` — Vosk language for recognition.
de: ``STT_LANGUAGE="en-us"`` — Vosk-Sprache für die Erkennung.

source: ``KEYBOARD_ENABLE=True`` — Allows optional manual text input during debugging.
de: ``KEYBOARD_ENABLE=True`` — Ermöglicht eine optionale manuelle Texteingabe während des Debuggings.

source: ``WELCOME`` / ``INSTRUCTIONS`` — Startup message and assistant persona/system prompt.
de: ``WELCOME`` / ``INSTRUCTIONS`` — Startnachricht und Persona- bzw. System-Prompt des Assistenten.

source: ``va.run()`` — Starts the loop: **wake → listen → LLM → speak**.
de: ``va.run()`` — Startet die Schleife : **Aktivieren → Zuhören → LLM → Sprechen** .

source: Switching to Other LLMs or TTS
de: Wechsel zu anderen LLMs oder TTS

source: You can easily switch to other LLMs, TTS, or STT languages with just a few edits:
de: Sie können mit nur wenigen Änderungen einfach zu anderen LLMs, TTS oder STT-Sprachen wechseln :

source: Supported LLMs:
de: Unterstützte LLMs :

source: :ref:`test_piper` — Check the supported languages of **Piper TTS**.
de: :ref:`test_piper` — Überprüfen Sie die unterstützten Sprachen von **Piper TTS** .

source: :ref:`test_vosk` — Check the supported languages of **Vosk STT**.
de: :ref:`test_vosk` — Überprüfen Sie die unterstützten Sprachen von **Vosk STT** .

source: To switch, simply modify the initialization part in the code:
de: Um zu wechseln, ändern Sie einfach den Initialisierungsteil im Code :

source: Troubleshooting
de: Fehlerbehebung

source: **Robot doesn’t respond to wake word**
de: **Der Roboter reagiert nicht auf das Aktivierungswort**

source: Check if the microphone works.
de: Überprüfen Sie, ob das Mikrofon funktioniert.

source: Make sure ``WAKE_ENABLE = True``.
de: Stellen Sie sicher, dass ``WAKE_ENABLE = True`` gesetzt ist.

source: Adjust the wake word to match your pronunciation.
de: Passen Sie das Aktivierungswort an Ihre Aussprache an.

source: Reduce background noise and speak clearly.
de: Reduzieren Sie Hintergrundgeräusche und sprechen Sie deutlich.

source: **No sound from the speaker**
de: **Kein Ton aus dem Lautsprecher**

source: Check the TTS model name (e.g., ``en_US-ryan-low``).
de: Überprüfen Sie den TTS-Modellnamen ( z. B. ``en_US-ryan-low`` ).

source: Test Piper or Espeak manually.
de: Testen Sie Piper oder Espeak manuell.

source: Verify speaker connection and volume.
de: Überprüfen Sie die Lautsprecherverbindung und die Lautstärke.

source: **API key error or timeout**
de: **API-Schlüssel-Fehler oder Zeitüberschreitung**

source: Check your key in ``secret.py``.
de: Überprüfen Sie Ihren Schlüssel in ``secret.py`` .

source: Make sure your network connection is stable.
de: Stellen Sie sicher, dass Ihre Netzwerkverbindung stabil ist.

source: Confirm the LLM model is supported (e.g., ``gpt-4o-mini``).
de: Bestätigen Sie, dass das LLM-Modell unterstützt wird ( z. B. ``gpt-4o-mini`` ).

source: **Wake word works but no response**
de: **Das Aktivierungswort funktioniert, aber es gibt keine Antwort**

source: Check if the STT language matches your accent.
de: Überprüfen Sie, ob die STT-Sprache zu Ihrem Akzent passt.

source: Make sure the model downloaded correctly.
de: Stellen Sie sicher, dass das Modell korrekt heruntergeladen wurde.

source: Try printing debug logs to confirm STT is running.
de: Versuchen Sie, Debug-Protokolle auszugeben, um zu bestätigen, dass STT ausgeführt wird.

source: **TTS works but no LLM reply**
de: **TTS funktioniert, aber keine LLM-Antwort**

source: Check if the API key is valid.
de: Überprüfen Sie, ob der API-Schlüssel gültig ist.

source: Verify model name and LLM settings.
de: Überprüfen Sie den Modellnamen und die LLM-Einstellungen.

source: Ensure internet connectivity.
de: Stellen Sie sicher, dass eine Internetverbindung besteht.
