Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/ai_interaction/python_tts_espeak_pico2wave.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauchen Sie gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum mitmachen?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support** : Lösen Sie After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen** : Tauschen Sie Tipps und Tutorials aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen** : Erhalten Sie frühzeitigen Zugriff auf neue Produktankündigungen und exklusive Einblicke.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Sonderrabatte** : Profitieren Sie von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele** : Nehmen Sie an Gewinnspielen und saisonalen Aktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie noch heute bei!

source: 1. TTS with Espeak and Pico2Wave
de: 1. TTS mit Espeak und Pico2Wave

source: In this lesson, we'll use two built-in text-to-speech (TTS) engines on Raspberry Pi — **Espeak** and **Pico2Wave** — to make the Fusion HAT+ talk.
de: In dieser Lektion verwenden wir zwei integrierte Text-to-Speech ( TTS )-Engines auf dem Raspberry Pi — **Espeak** und **Pico2Wave** — um Fusion HAT+ sprechen zu lassen.

source: These two engines are both simple and run offline, but they sound quite different:
de: Diese beiden Engines sind beide einfach und laufen offline, aber sie klingen ziemlich unterschiedlich:

source: **Espeak**: very lightweight and fast, but the voice is robotic. You can adjust speed, pitch, and volume.
de: **Espeak** : Sehr leichtgewichtig und schnell, aber die Stimme klingt robotisch. Sie können Geschwindigkeit, Tonhöhe und Lautstärke anpassen.

source: **Pico2Wave**: produces a smoother and more natural voice than Espeak, but has fewer options to configure.
de: **Pico2Wave** : Erzeugt eine weichere und natürlichere Stimme als Espeak, bietet jedoch weniger Konfigurationsoptionen.

source: You'll hear the difference in **voice quality** and **features**.
de: Sie hören den Unterschied in **Sprachqualität** und **Funktionen** .

source: 1. Testing Espeak
de: 1. Espeak testen

source: Espeak is a lightweight TTS engine included in Raspberry Pi OS. Its voice sounds robotic, but it is highly configurable: you can adjust volume, pitch, speed, and more.
de: Espeak ist eine leichtgewichtige TTS-Engine, die in Raspberry Pi OS enthalten ist. Ihre Stimme klingt robotisch, ist aber sehr gut konfigurierbar: Sie können Lautstärke, Tonhöhe, Sprechgeschwindigkeit und mehr anpassen.

source: **Run the program**
de: **Programm ausführen**

source: You should hear the Fusion HAT+ say: “Hello! I'm Espeak TTS.”
de: Sie sollten Fusion HAT+ sagen hören: „Hallo! Ich bin Espeak TTS.“

source: Try changing the tuning parameters in the code to experiment with how ``amp``, ``speed``, ``gap``, and ``pitch`` affect the sound.
de: Versuchen Sie, die Abstimmungsparameter im Code zu ändern, um zu testen, wie ``amp`` , ``speed`` , ``gap`` und ``pitch`` den Klang beeinflussen.

source: **Code explanation:**
de: **Code-Erklärung:**

source: ``tts.set_amp()`` — Controls the volume (0–200).
de: ``tts.set_amp()`` — Steuert die Lautstärke ( 0–200 ).

source: ``tts.set_speed()`` — Adjusts the speaking speed (80–260).
de: ``tts.set_speed()`` — Passt die Sprechgeschwindigkeit an ( 80–260 ).

source: ``tts.set_gap()`` — Sets the word gap (0–200).
de: ``tts.set_gap()`` — Legt die Wortpause fest ( 0–200 ).

source: ``tts.set_pitch()`` — Sets the pitch (0–99).
de: ``tts.set_pitch()`` — Legt die Tonhöhe fest ( 0–99 ).

source: ``tts.say()`` — Converts text to speech and plays it.
de: ``tts.say()`` — Wandelt Text in Sprache um und spielt sie ab.

source: 💡 **Tip:** Try increasing the pitch and speed to make the robot sound cheerful, or lowering them to make it sound serious.
de: 💡 **Tipp:** Versuchen Sie, Tonhöhe und Geschwindigkeit zu erhöhen, damit der Roboter fröhlicher klingt, oder sie zu verringern, damit er ernster klingt.

source: 2. Testing Pico2Wave
de: 2. Pico2Wave testen

source: Pico2Wave produces a **more natural and human-like voice** compared to Espeak. It’s very easy to use, but less flexible — you can only **change the language**, not the pitch, speed, or volume. This makes Pico2Wave a great choice when you want clear and smooth speech without too much configuration.
de: Pico2Wave erzeugt im Vergleich zu Espeak eine **natürlichere und menschenähnlichere Stimme** . Es ist sehr einfach zu verwenden, aber weniger flexibel — Sie können nur **die Sprache ändern** , nicht Tonhöhe, Geschwindigkeit oder Lautstärke. Das macht Pico2Wave zu einer guten Wahl, wenn Sie klare und flüssige Sprache ohne zu viel Konfiguration möchten.

source: You should hear the Fusion HAT+ say: “Hello! I'm Pico2Wave TTS.”
de: Sie sollten Fusion HAT+ sagen hören: „Hallo! Ich bin Pico2Wave TTS.“

source: Try changing the language (for example, ``es-ES`` for Spanish) and listen to how the voice changes.
de: Versuchen Sie, die Sprache zu ändern ( z. B. ``es-ES`` für Spanisch ) und hören Sie, wie sich die Stimme verändert.

source: ``tts.set_lang()`` — Sets the output language for speech synthesis.
de: ``tts.set_lang()`` — Legt die Ausgabesprache für die Sprachsynthese fest.

source: ``en-US`` (default)
de: ``en-US`` ( Standard )

source: ``tts.say()`` — Converts the text to speech and plays it immediately.
de: ``tts.say()`` — Wandelt den Text in Sprache um und spielt sie sofort ab.

source: Troubleshooting
de: Fehlerbehebung

source: **No sound when running Espeak or Pico2Wave**
de: **Kein Ton beim Ausführen von Espeak oder Pico2Wave**

source: Check that your speakers/headphones are connected and volume is not muted.
de: Prüfen Sie, ob Ihre Lautsprecher / Kopfhörer angeschlossen sind und die Lautstärke nicht stummgeschaltet ist.

source: Run a quick test in terminal:
de: Führen Sie einen kurzen Test im Terminal aus:

source: If you hear nothing, the issue is with audio output, not your Python code.
de: Wenn Sie nichts hören, liegt das Problem an der Audioausgabe, nicht an Ihrem Python-Code.

source: **Espeak voice sounds too fast or too robotic**
de: **Die Espeak-Stimme klingt zu schnell oder zu robotisch**

source: Try adjusting the parameters in your code:
de: Versuchen Sie, die Parameter in Ihrem Code anzupassen:

source: **Permission denied when running code**
de: **Permission denied beim Ausführen des Codes**

source: Try running with ``sudo``:
de: Versuchen Sie, mit ``sudo`` auszuführen:

source: Comparison: Espeak vs Pico2Wave
de: Vergleich: Espeak vs Pico2Wave

source: Feature
de: Funktion

source: Voice quality
de: Sprachqualität

source: Robotic, synthetic
de: Robotisch, synthetisch

source: More natural, human-like
de: Natürlicher, menschenähnlich

source: Languages
de: Sprachen

source: Default English
de: Standardmäßig Englisch

source: Fewer, but common ones
de: Weniger, aber gängige

source: Adjustable
de: Anpassbar

source: Yes (speed, pitch, etc.)
de: Ja ( Geschwindigkeit, Tonhöhe usw. )

source: No (only language)
de: Nein ( nur Sprache )

source: Performance
de: Leistung

source: Very fast, lightweight
de: Sehr schnell, leichtgewichtig

source: Slightly slower, heavier
de: Etwas langsamer, schwerer
