Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/ai_interaction/python_local_chatbot.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauchen Sie gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum mitmachen?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support** : Lösen Sie After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen** : Tauschen Sie Tipps und Tutorials aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen** : Erhalten Sie frühzeitigen Zugriff auf neue Produktankündigungen und exklusive Einblicke.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Sonderrabatte** : Profitieren Sie von exklusiven Rabatten auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele** : Nehmen Sie an Gewinnspielen und saisonalen Aktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie noch heute bei!

source: 6. Local Voice Chatbot
de: 6. Lokaler Sprach-Chatbot

source: In this lesson, you will combine everything you've learned — **speech recognition (STT)**, **text-to-speech (TTS)**, and a **local LLM (Ollama)** — to build a fully offline **voice chatbot** that runs on your Fusion HAT.
de: In dieser Lektion kombinieren Sie alles, was Sie gelernt haben — **Spracherkennung ( STT )** , **Text-to-Speech ( TTS )** und ein **lokales LLM ( Ollama )** — um einen vollständig offline laufenden **Sprach-Chatbot** zu bauen, der auf Ihrem Fusion HAT läuft.

source: The workflow is simple:
de: Der Ablauf ist einfach :

source: **Listen** — The microphone captures your speech and transcribes it with **Vosk**.
de: **Zuhören** — Das Mikrofon erfasst Ihre Sprache und transkribiert sie mit **Vosk** .

source: **Think** — The text is sent to a local **LLM** running on Ollama (e.g., ``llama3.2:3b``).
de: **Denken** — Der Text wird an ein lokales **LLM** gesendet, das über Ollama läuft ( z. B. ``llama3.2:3b`` ).

source: **Speak** — The chatbot answers aloud using **Piper TTS**.
de: **Sprechen** — Der Chatbot antwortet laut mit **Piper TTS** .

source: This creates a **hands-free conversational robot** that can understand and respond in real time.
de: Dadurch entsteht ein **freihändig bedienbarer Konversationsroboter** , der in Echtzeit verstehen und antworten kann.

source: Before You Start
de: Bevor Sie beginnen

source: Make sure you have prepared the following:
de: Stellen Sie sicher, dass Sie Folgendes vorbereitet haben :

source: Tested **Piper TTS** (:ref:`test_piper`) and chosen a working voice model.
de: Testen Sie **Piper TTS** ( :ref:`test_piper` ) und wählen Sie ein funktionierendes Sprachmodell aus.

source: Tested **Vosk STT** (:ref:`test_vosk`) and chosen the right language pack (e.g., ``en-us``).
de: Testen Sie **Vosk STT** ( :ref:`test_vosk` ) und wählen Sie das richtige Sprachpaket ( z. B. ``en-us`` ).

source: Installed **Ollama** (:ref:`download_ollama`) on your Pi or another computer, and downloaded a model such as ``llama3.2:3b`` (or a smaller one like ``moondream:1.8b`` if memory is limited).
de: Installieren Sie **Ollama** ( :ref:`download_ollama` ) auf Ihrem Pi oder einem anderen Computer und laden Sie ein Modell wie ``llama3.2:3b`` herunter ( oder ein kleineres wie ``moondream:1.8b`` , wenn der Speicher begrenzt ist ).

source: Run the Code
de: Code ausführen

source: Open the example script:
de: Öffnen Sie das Beispielskript :

source: Update the parameters as needed:
de: Passen Sie die Parameter nach Bedarf an :

source: ``stt = Vosk(language="en-us")``: Change this to match your accent/language package (e.g., ``en-us``, ``zh-cn``, ``es``).
de: ``stt = Vosk(language="en-us")`` : Ändern Sie dies so, dass es zu Ihrem Akzent / Sprachpaket passt ( z. B. ``en-us``, ``zh-cn``, ``es`` ).

source: ``tts.set_model("en_US-amy-low")``: Replace with the Piper voice model you verified in :ref:`test_piper`.
de: ``tts.set_model("en_US-amy-low")`` : Ersetzen Sie dies durch das Piper-Sprachmodell, das Sie in :ref:`test_piper` überprüft haben.

source: ``llm = Ollama(ip="localhost", model="llama3.2:3b")``: Update both ``ip`` and ``model`` to your own setup.
de: ``llm = Ollama(ip="localhost", model="llama3.2:3b")`` : Aktualisieren Sie sowohl ``ip`` als auch ``model`` entsprechend Ihrem Setup.

source: ``ip``: If Ollama runs on the **same Pi**, use ``localhost``. If Ollama runs on another computer in your LAN, enable **Expose to network** in Ollama and set ``ip`` to that computer’s LAN IP.
de: ``ip`` : Wenn Ollama auf dem **gleichen Pi** läuft, verwenden Sie ``localhost``. Wenn Ollama auf einem anderen Computer in Ihrem LAN läuft, aktivieren Sie **Expose to network** in Ollama und setzen Sie ``ip`` auf die LAN-IP dieses Computers.

source: ``model``: Must exactly match the model name you downloaded/activated in Ollama.
de: ``model`` : Muss exakt mit dem Modellnamen übereinstimmen, den Sie in Ollama heruntergeladen / aktiviert haben.

source: Run the script:
de: Führen Sie das Skript aus :

source: After running, you should see:
de: Nach dem Start sollten Sie Folgendes sehen :

source: The bot greets you with a spoken welcome message.
de: Der Bot begrüßt Sie mit einer gesprochenen Willkommensnachricht.

source: It waits for speech input.
de: Er wartet auf Spracheingabe.

source: Vosk transcribes your speech into text.
de: Vosk transkribiert Ihre Sprache in Text.

source: The text is sent to Ollama, which streams back a reply.
de: Der Text wird an Ollama gesendet, das eine Antwort zurück streamt.

source: The reply is cleaned (removing hidden reasoning) and spoken aloud by Piper.
de: Die Antwort wird bereinigt ( versteckte Begründungen werden entfernt ) und anschließend von Piper laut gesprochen.

source: Stop the program anytime with ``Ctrl+C``.
de: Beenden Sie das Programm jederzeit mit ``Ctrl+C`` .

source: Code Analysis
de: Code-Analyse

source: **Imports and global setup**
de: **Imports und globale Einrichtung**

source: Brings in the three subsystems you built earlier: **Vosk** for speech-to-text (STT), **Ollama** for the LLM, and **Piper** for text-to-speech (TTS).
de: Bindet die drei Teilsysteme ein, die Sie zuvor aufgebaut haben: **Vosk** für Speech-to-Text ( STT ), **Ollama** für das LLM und **Piper** für Text-to-Speech ( TTS ).

source: **Initialize STT (Vosk)**
de: **STT initialisieren ( Vosk )**

source: Loads the Vosk model for US English. Change the language code (e.g., ``zh-cn``, ``es``) to match your voice pack for better accuracy.
de: Lädt das Vosk-Modell für US-Englisch. Ändern Sie den Sprachcode ( z. B. ``zh-cn``, ``es`` ), damit er zu Ihrem Sprachpaket passt, um eine bessere Genauigkeit zu erzielen.

source: **Initialize TTS (Piper)**
de: **TTS initialisieren ( Piper )**

source: Creates a Piper engine and selects a specific voice. Pick a model you’ve tested in :ref:`test_piper`. Lower-quality voices are faster and use less CPU.
de: Erstellt eine Piper-Engine und wählt eine bestimmte Stimme aus. Wählen Sie ein Modell, das Sie in :ref:`test_piper` getestet haben. Stimmen mit geringerer Qualität sind schneller und benötigen weniger CPU.

source: **LLM instructions and welcome line**
de: **LLM-Anweisungen und Begrüßungszeile**

source: Two key UX choices:
de: Zwei zentrale UX-Entscheidungen :

source: Keep **answers short and direct** (helps with TTS clarity).
de: Halten Sie **Antworten kurz und direkt** ( hilft bei der TTS-Verständlichkeit ).

source: Explicitly forbid hidden “chain-of-thought” tags to reduce noisy outputs.
de: Verbieten Sie ausdrücklich versteckte „chain-of-thought“-Tags, um störende Ausgaben zu reduzieren.

source: **Connect to Ollama and set conversation scope**
de: **Mit Ollama verbinden und Gesprächsumfang festlegen**

source: ``ip="localhost"`` assumes the Ollama server runs on the same Pi. If it runs on another LAN machine, put that computer’s **LAN IP** and enable *Expose to network* in Ollama.
de: ``ip="localhost"`` setzt voraus, dass der Ollama-Server auf dem gleichen Pi läuft. Wenn er auf einem anderen LAN-Rechner läuft, tragen Sie dessen **LAN-IP** ein und aktivieren Sie *Expose to network* in Ollama.

source: ``set_max_messages(20)`` keeps a short conversational history. Lower this if memory/latency is tight.
de: ``set_max_messages(20)`` hält die Gesprächshistorie kurz. Verringern Sie diesen Wert, wenn Speicher / Latenz knapp ist.

source: **Strip hidden reasoning / tags before speaking**
de: **Versteckte Begründungen / Tags vor dem Sprechen entfernen**

source: Some models may emit internal-style tags (e.g., ``<think>…``). This function removes those so your TTS **only** speaks the final answer.
de: Einige Modelle geben möglicherweise interne Tags aus ( z. B. ``<think>…`` ). Diese Funktion entfernt sie, damit Ihre TTS **nur** die endgültige Antwort spricht.

source: **Tip:** If you see other artifacts on screen (because you stream raw tokens), this function already ensures **spoken** output stays clean.
de: **Tipp:** Wenn Sie andere Artefakte auf dem Bildschirm sehen ( weil Sie rohe Tokens streamen ), sorgt diese Funktion bereits dafür, dass die **gesprochene** Ausgabe sauber bleibt.

source: **Main loop: greet once, then listen → think → speak**
de: **Hauptschleife: einmal begrüßen, dann zuhören → denken → sprechen**

source: Greets the user via terminal and speaker. Happens once at startup.
de: Begrüßt den Benutzer über Terminal und Lautsprecher. Passiert einmal beim Start.

source: **Listen (streaming STT with live partials)**
de: **Zuhören ( Streaming-STT mit Live-Teilergebnissen )**

source: ``stream=True`` yields **partial** transcripts for immediate feedback and a **final** transcript when the utterance ends.
de: ``stream=True`` liefert **Teil-Transkripte** für unmittelbares Feedback und ein **finales** Transkript, wenn die Äußerung endet.

source: The final recognized text is stored in ``text`` and printed once.
de: Der final erkannte Text wird in ``text`` gespeichert und einmal ausgegeben.

source: **Guard:** If nothing was recognized, you skip the LLM call:
de: **Schutz:** Wenn nichts erkannt wurde, überspringen Sie den LLM-Aufruf :

source: This avoids sending empty prompts to the model (saves time and tokens).
de: Dadurch werden leere Prompts an das Modell vermieden ( spart Zeit und Tokens ).

source: **Think (LLM) with streamed printing**
de: **Denken ( LLM ) mit gestreamter Ausgabe**

source: Sends the final transcript to the local LLM and **prints tokens as they arrive** for low latency.
de: Sendet das finale Transkript an das lokale LLM und **gibt Tokens aus, sobald sie eintreffen** , für geringe Latenz.

source: Meanwhile, you accumulate the full reply in ``reply_accum`` for post-processing.
de: Gleichzeitig sammeln Sie die vollständige Antwort in ``reply_accum`` für die Nachbearbeitung.

source: **Note:** If you’d rather **not** show raw tokens, set ``stream=False`` and just print the final string.
de: **Hinweis:** Wenn Sie rohe Tokens lieber **nicht** anzeigen möchten, setzen Sie ``stream=False`` und geben Sie nur die finale Zeichenkette aus.

source: **Speak (clean first, then TTS once)**
de: **Sprechen ( erst bereinigen, dann einmal TTS )**

source: Cleans the final text to remove hidden tags, then **speaks exactly once**.
de: Bereinigt den finalen Text, um versteckte Tags zu entfernen, und **spricht dann genau einmal** .

source: Keeping TTS to a single pass avoids repeated prompts like “[LLM] / [SAY]”.
de: TTS auf einen einzigen Durchlauf zu beschränken, vermeidet wiederholte Prompts wie „[LLM] / [SAY]“.

source: **Exit and teardown**
de: **Beenden und Aufräumen**

source: Use **Ctrl+C** to stop. The bot says a short goodbye to signal a clean exit.
de: Verwenden Sie **Ctrl+C** , um zu stoppen. Der Bot sagt kurz auf Wiedersehen, um ein sauberes Beenden zu signalisieren.

source: Troubleshooting & FAQ
de: Fehlerbehebung & FAQ

source: **Model is too large (memory error)**
de: **Modell ist zu groß ( Speicherfehler )**

source: Use a smaller model like ``moondream:1.8b`` or run Ollama on a more powerful computer.
de: Verwenden Sie ein kleineres Modell wie ``moondream:1.8b`` oder führen Sie Ollama auf einem leistungsstärkeren Computer aus.

source: **No response from Ollama**
de: **Keine Antwort von Ollama**

source: Make sure Ollama is running (``ollama serve`` or desktop app open). If remote, enable **Expose to network** and check IP address.
de: Stellen Sie sicher, dass Ollama läuft ( ``ollama serve`` oder Desktop-App geöffnet ). Wenn remote, aktivieren Sie **Expose to network** und prüfen Sie die IP-Adresse.

source: **Vosk not recognizing speech**
de: **Vosk erkennt Sprache nicht**

source: Verify your microphone works. Try another language pack (``zh-cn``, ``es`` etc.) if needed.
de: Überprüfen Sie, ob Ihr Mikrofon funktioniert. Versuchen Sie bei Bedarf ein anderes Sprachpaket ( ``zh-cn`` , ``es`` usw. ).

source: **Piper silent or errors**
de: **Piper stumm oder Fehler**

source: Confirm the chosen voice model is downloaded and tested in :ref:`test_piper`.
de: Bestätigen Sie, dass das gewählte Sprachmodell heruntergeladen wurde und in :ref:`test_piper` getestet ist.

source: **Answers too long or off-topic**
de: **Antworten zu lang oder am Thema vorbei**

source: Edit ``INSTRUCTIONS`` to add: **“Keep answers short and to the point.”**
de: Bearbeiten Sie ``INSTRUCTIONS`` und fügen Sie hinzu: **„Keep answers short and to the point.“**
