Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.voice_assistant.po
Languages: de, ja

source: fusion\_hat.voice\_assistant module
de: fusion\_hat.voice\_assistant Modul
ja: fusion\_hat.voice\_assistant モジュール

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: Voice assistant class
de: Sprachassistenten-Klasse
ja: 音声アシスタントクラス

source: Parameters
de: Parameter

source: Language model
de: Sprachmodell
ja: 言語モデル

source: Robot name, default is NAME
de: Robotername, Standard ist NAME
ja: ロボット名、デフォルトは NAME です

source: Enable image, need to set up a multimodal language model, default is WITH_IMAGE
de: Bilder aktivieren, ein multimodales Sprachmodell muss eingerichtet werden, Standard ist WITH_IMAGE
ja: 画像を有効化するにはマルチモーダル言語モデルを設定する必要があります。デフォルトは WITH_IMAGE です

source: Text-to-speech model, default is TTS_MODEL
de: Text-to-Speech-Modell, Standard ist TTS_MODEL
ja: テキスト読み上げモデル、デフォルトは TTS_MODEL です

source: Speech-to-text language, default is STT_LANGUAGE
de: Speech-to-Text-Sprache, Standard ist STT_LANGUAGE
ja: 音声認識言語、デフォルトは STT_LANGUAGE です

source: Enable keyboard input, default is KEYBOARD_ENABLE
de: Tastatureingabe aktivieren, Standard ist KEYBOARD_ENABLE
ja: キーボード入力を有効化、デフォルトは KEYBOARD_ENABLE です

source: Enable wake word, default is WAKE_ENABLE
de: Aktivierungswort aktivieren, Standard ist WAKE_ENABLE
ja: ウェイクワードを有効化、デフォルトは WAKE_ENABLE です

source: Wake word, default is WAKE_WORD
de: Aktivierungswort, Standard ist WAKE_WORD
ja: ウェイクワード、デフォルトは WAKE_WORD です

source: Answer on wake word, default is ANSWER_ON_WAKE
de: Auf Aktivierungswort antworten, Standard ist ANSWER_ON_WAKE
ja: ウェイクワードで応答、デフォルトは ANSWER_ON_WAKE です

source: Welcome message, default is WELCOME
de: Begrüßungsnachricht, Standard ist WELCOME
ja: ウェルカムメッセージ、デフォルトは WELCOME です

source: Set instructions, default is INSTRUCTIONS
de: Anweisungen festlegen, Standard ist INSTRUCTIONS
ja: 指示を設定、デフォルトは INSTRUCTIONS です

source: Disable think, default is False
de: Den Denkprozess deaktivieren, Standard ist False
ja: 思考を無効化、デフォルトは False です

source: Before listen
de: Vor dem Zuhören
ja: リッスン前

source: After listen
de: Nach dem Zuhören
ja: リッスン後

source: Speech-to-text result
de: Speech-to-Text-Ergebnis
ja: 音声認識結果

source: Before think
de: Vor dem Denken
ja: 思考前

source: Text to think
de: Text zum Denken
ja: 思考するテキスト

source: After think
de: Nach dem Denken
ja: 思考後

source: On start
de: Beim Start
ja: 開始時

source: On wake
de: Bei Aktivierung
ja: ウェイク時

source: On heard
de: Bei Gehört
ja: 音声認識時

source: Text heard
de: Gehörter Text
ja: 認識されたテキスト

source: Parse response
de: Antwort analysieren
ja: レスポンスを解析

source: Text to parse
de: Zu analysierender Text
ja: 解析するテキスト

source: Returns
de: Rückgabewerte

source: Parsed text
de: Analysierter Text
ja: 解析されたテキスト

source: Return type
de: Rückgabetyp

source: Add trigger function
de: Trigger-Funktion hinzufügen
ja: トリガー関数を追加

source: Trigger function
de: Trigger-Funktion
ja: トリガー関数

source: Before say
de: Vor dem Sprechen
ja: 発話前

source: Text to say
de: Zu sprechender Text
ja: 発話するテキスト

source: After say
de: Nach dem Sprechen
ja: 発話後

source: On stop
de: Beim Stoppen
ja: 停止時

source: On finish a round
de: Beim Abschluss einer Runde
ja: 1 ラウンド終了時

source: Capture image
de: Bild aufnehmen
ja: 画像をキャプチャ

source: Path to save image
de: Pfad zum Speichern des Bildes
ja: 画像の保存パス

source: Trigger wake word
de: Aktivierungswort auslösen
ja: ウェイクワードをトリガー

source: Triggered, disable image, message
de: Ausgelöst, Bild deaktivieren, Nachricht
ja: トリガーされました。画像を無効化、メッセージ

source: Trigger keyboard input
de: Tastatureingabe auslösen
ja: キーボード入力をトリガー

source: Initialize camera
de: Kamera initialisieren
ja: カメラを初期化

source: Close camera
de: Kamera schließen
ja: カメラを閉じる

source: Listen
de: Zuhören
ja: リッスン

source: Think
de: Denken
ja: 思考

source: Disable image, defaults to False
de: Bild deaktivieren, Standard ist False
ja: 画像を無効化、デフォルトは False です

source: LLM response
de: LLM-Antwort
ja: LLM の応答

source: Main loop
de: Hauptschleife
ja: メインループ

source: Run
de: Ausführen
ja: 実行

source: パラメータ
ja: パラメーター
