Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.stt.po
Languages: de, ja

source: fusion\_hat.stt module
de: fusion\_hat.stt Modul
ja: fusion\_hat.stt モジュール

source: Speech to Text module
de: Sprach-zu-Text-Modul
ja: 音声認識 ( STT ) モジュール

source: Convert speech to text.
de: Sprache in Text umwandeln.
ja: 音声をテキストに変換します。

source: Example
de: Beispiel

source: import STT and instantiate it
de: STT importieren und eine Instanz erstellen
ja: STT をインポートしてインスタンス化します

source: Listen for speech input
de: Auf Spracheingabe hören
ja: 音声入力をリッスンします

source: Use Stream to get partial results
de: Stream verwenden, um Teilergebnisse zu erhalten
ja: Stream を使用して部分的な結果を取得します

source: Wait for wake words
de: Auf Aktivierungswörter warten
ja: ウェイクワードを待機します

source: Wake word in thread
de: Aktivierungswort in einem Thread
ja: スレッド内のウェイクワード

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: Vosk STT class
de: Vosk-STT-Klasse
ja: Vosk STT クラス

source: Check if Vosk STT is ready
de: Prüfen, ob Vosk-STT bereit ist
ja: Vosk STT の準備ができているか確認します

source: Returns
de: Rückgabewerte

source: True if ready, False otherwise
de: True, wenn bereit, andernfalls False
ja: 準備ができている場合は True、そうでなければ False

source: Return type
de: Rückgabetyp

source: Initialize Vosk STT
de: Vosk-STT initialisieren
ja: Vosk STT を初期化します

source: Update available models
de: Verfügbare Modelle aktualisieren
ja: 利用可能なモデルを更新します

source: Wait until heard a wake word
de: Warten, bis ein Aktivierungswort gehört wird
ja: ウェイクワードが検出されるまで待機します

source: Parameters
de: Parameter

source: Wake words, default is None
de: Aktivierungswörter, Standard ist None
ja: ウェイクワード。デフォルトは None です

source: Print callback, default is None
de: Print-Callback, Standard ist None
ja: 表示用コールバック。デフォルトは None です

source: Heard wake word
de: Gehörtes Aktivierungswort
ja: 検出されたウェイクワード

source: Check if heard a wake word
de: Prüfen, ob ein Aktivierungswort gehört wurde
ja: ウェイクワードを検出したか確認します

source: True if heard a wake word, False otherwise
de: True, wenn ein Aktivierungswort gehört wurde, andernfalls False
ja: ウェイクワードを検出した場合は True、そうでなければ False

source: Wait for wake word
de: Auf Aktivierungswort warten
ja: ウェイクワードを待機します

source: Start listening for wake words
de: Das Hören auf Aktivierungswörter starten
ja: ウェイクワードのリッスンを開始します

source: Check if the wake word thread is running
de: Prüfen, ob der Aktivierungswort-Thread läuft
ja: ウェイクワードのスレッドが実行中か確認します

source: True if running, False otherwise
de: True, wenn er läuft, andernfalls False
ja: 実行中なら True、そうでなければ False

source: Perform STT on audio file
de: STT auf eine Audiodatei anwenden
ja: 音声ファイルに対して STT を実行します

source: Audio file path
de: Pfad zur Audiodatei
ja: 音声ファイルのパス

source: Stream mode, default is False
de: Stream-Modus, Standard ist False
ja: ストリームモード。デフォルトは False です

source: STT result
de: STT-Ergebnis
ja: STT 結果

source: Get streaming results from recognizer
de: Streaming-Ergebnisse vom Erkenner abrufen
ja: 認識器からストリーミング結果を取得します

source: Wave file object
de: Wave-Dateiobjekt
ja: Wave ファイルオブジェクト

source: Vosk recognizer
de: Vosk-Erkenner
ja: Vosk 認識器

source: Yields
de: Liefert

source: *str* -- STT result
de: *str* -- STT-Ergebnis
ja: *str* -- STT 結果

source: Listen from microphone and return results
de: Über das Mikrofon hören und Ergebnisse zurückgeben
ja: マイクから音声をリッスンして結果を返します

source: Device index, default is None
de: Geräteindex, Standard ist None
ja: デバイスインデックス。デフォルトは None です

source: Sampling rate, default is None
de: Abtastrate, Standard ist None
ja: サンプリングレート。デフォルトは None です

source: Listen from microphone and return streaming results
de: Über das Mikrofon hören und Streaming-Ergebnisse zurückgeben
ja: マイクから音声をリッスンしてストリーミング結果を返します

source: Queue to store audio data
de: Warteschlange zum Speichern von Audiodaten
ja: 音声データを保存するキュー

source: Callback function, default is None
de: Callback-Funktion, Standard ist None
ja: コールバック関数。デフォルトは None です

source: *dict* -- STT result
de: *dict* -- STT-Ergebnis
ja: *dict* -- STT 結果

source: Listen from microphone and return final result
de: Über das Mikrofon hören und das Endergebnis zurückgeben
ja: マイクから音声をリッスンして最終結果を返します

source: Set wake words
de: Aktivierungswörter festlegen
ja: ウェイクワードを設定します

source: List of wake words
de: Liste der Aktivierungswörter
ja: ウェイクワードのリスト

source: Get current language
de: Aktuelle Sprache abrufen
ja: 現在の言語を取得します

source: Current language
de: Aktuelle Sprache
ja: 現在の言語

source: Set language
de: Sprache festlegen
ja: 言語を設定します

source: Language to set
de: Festzulegende Sprache
ja: 設定する言語

source: Initialize recognizer, default is True
de: Erkenner initialisieren, Standard ist True
ja: 認識器を初期化します。デフォルトは True です

source: Get model name for language
de: Modellnamen für die Sprache abrufen
ja: 言語のモデル名を取得します

source: Language
de: Sprache

source: Model name
de: Modellname
ja: モデル名

source: Get model path for language
de: Modellpfad für die Sprache abrufen
ja: 言語のモデルパスを取得します

source: Model path
de: Modellpfad
ja: モデルパス

source: Check if model is downloaded
de: Prüfen, ob das Modell heruntergeladen ist
ja: モデルがダウンロード済みか確認します

source: True if model is downloaded, False otherwise
de: True, wenn das Modell heruntergeladen ist, andernfalls False
ja: モデルがダウンロード済みなら True、そうでなければ False

source: Public method to cancel ongoing download
de: Öffentliche Methode zum Abbrechen eines laufenden Downloads
ja: 進行中のダウンロードをキャンセルするための公開メソッド

source: Download model for language
de: Modell für die Sprache herunterladen
ja: 言語用のモデルをダウンロードします

source: Progress callback function, default is None
de: Fortschritts-Callback-Funktion, Standard ist None
ja: 進捗コールバック関数。デフォルトは None です

source: Maximum retries, default is 5
de: Maximale Wiederholungen, Standard ist 5
ja: 最大リトライ回数。デフォルトは 5 です

source: Download progress hook function
de: Hook-Funktion für den Download-Fortschritt
ja: ダウンロード進捗フック関数

source: tqdm progress bar, default is None
de: tqdm-Fortschrittsbalken, Standard ist None
ja: tqdm 進捗バー。デフォルトは None です

source: Stop listening for wake word
de: Das Hören auf Aktivierungswörter stoppen
ja: ウェイクワードのリッスンを停止します

source: Close STT
de: STT schließen
ja: STT を終了します

source: パラメータ
ja: パラメーター
