Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.rotary_encoder.po
Languages: de

source: fusion\_hat.modules.rotary\_encoder module
de: fusion\_hat.modules.rotary\_encoder Modul

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: Called on rising edge of channel A. Read channel B to determine rotation direction. Typical rule:
de: Wird bei der steigenden Flanke von Kanal A aufgerufen. Kanal B lesen, um die Drehrichtung zu bestimmen. Typische Regel:

source: A↑ with B=0 -> CW (+1) A↑ with B=1 -> CCW (-1)
de: A↑ mit B=0 -> CW ( +1 ) A↑ mit B=1 -> CCW ( -1 )

source: Called on falling edge of channel A. Read channel B to determine rotation direction. Typical rule:
de: Wird bei der fallenden Flanke von Kanal A aufgerufen. Kanal B lesen, um die Drehrichtung zu bestimmen. Typische Regel:

source: A↓ with B=1 -> CW (+1) A↓ with B=0 -> CCW (-1)
de: A↓ mit B=1 -> CW ( +1 ) A↓ mit B=0 -> CCW ( -1 )

source: Apply one step of rotation, considering direction and reverse flag. Then invoke the external callback if set.
de: Einen Rotationsschritt anwenden, unter Berücksichtigung der Richtung und des Reverse-Flags. Anschließend den externen Callback aufrufen, falls gesetzt.

source: Return the current step count.
de: Gibt die aktuelle Schrittanzahl zurück.

source: Reset the encoder position to zero.
de: Setzt die Encoderposition auf Null zurück.

source: Release interrupts and clean up GPIO resources.
de: Gibt Interrupts frei und bereinigt die GPIO-Ressourcen.
