Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.ultrasonic.po
Languages: de, ja

source: fusion\_hat.modules.ultrasonic module
de: fusion\_hat.modules.ultrasonic Modul
ja: fusion\_hat.modules.ultrasonic モジュール

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: Ultrasonic sensor module.
de: Ultraschallsensor-Modul.
ja: 超音波 センサー モジュール 。

source: Parameters
de: Parameter

source: Trigger pin object.
de: Trigger-Pin-Objekt.
ja: トリガー ピン オブジェクト 。

source: Echo pin object.
de: Echo-Pin-Objekt.
ja: エコー ピン オブジェクト 。

source: Timeout duration in seconds. Default is 0.02.
de: Timeout-Dauer in Sekunden. Standard ist 0.02.
ja: タイムアウト 時間 ( 秒 ) 。 デフォルト は 0.02 です 。

source: Raises
de: Wirft

source: If trig or echo is not a Pin object.
de: Wenn trig oder echo kein Pin-Objekt ist.
ja: trig または echo が Pin オブジェクト で ない 場合 。

source: Sound speed in meters per second.
de: Schallgeschwindigkeit in Metern pro Sekunde.
ja: 音速 ( メートル / 秒 ) 。

source: Read raw distance value from ultrasonic sensor.
de: Rohwert der Distanz vom Ultraschallsensor lesen.
ja: 超音波 センサー から 生 の 距離 値 を 読み取ります 。

source: Returns
de: Rückgabewerte

source: Distance in centimeters. Returns -1 if timeout occurs, -2 if pulse start or end is 0, or any other error.
de: Entfernung in Zentimetern. Gibt -1 zurück, wenn ein Timeout auftritt, -2, wenn der Pulsstart oder das Pulsende 0 ist, oder bei einem anderen Fehler.
ja: 距離 ( センチメートル ) 。 タイムアウト が 発生 した 場合 は -1 、 パルス の 開始 または 終了 が 0 の 場合 は -2 、 それ 以外 の エラー の 場合 。

source: Distance in centimeters. Returns -1 if timeout occurs,
de: Entfernung in Zentimetern. Gibt -1 zurück, wenn ein Timeout auftritt,

source: -2 if pulse start or end is 0, or any other error.
de: -2, wenn der Pulsstart oder das Pulsende 0 ist, oder bei einem anderen Fehler.

source: Return type
de: Rückgabetyp

source: Read distance value with retry mechanism.
de: Entfernungswert mit Wiederholungsmechanismus lesen.
ja: リトライ 機構 を 用い て 距離 値 を 読み取ります 。

source: Number of retry attempts. Default is 10.
de: Anzahl der Wiederholungsversuche. Standard ist 10.
ja: リトライ 回数 。 デフォルト は 10 です 。

source: Distance in centimeters. Returns -1 if all attempts fail.
de: Entfernung in Zentimetern. Gibt -1 zurück, wenn alle Versuche fehlschlagen.
ja: 距離 ( センチメートル ) 。 すべて の 試行 が 失敗 した 場合 は -1 を 返します 。

source: Read distance value.
de: Entfernungswert lesen.
ja: 距離 値 を 読み取ります 。

source: Distance in centimeters. Returns -1 if thread is running, otherwise returns the last read value.
de: Entfernung in Zentimetern. Gibt -1 zurück, wenn der Thread läuft, ansonsten wird der zuletzt gelesene Wert zurückgegeben.
ja: 距離 ( センチメートル ) 。 スレッド が 実行 中 の 場合 は -1 を 返し 、 それ 以外 の 場合 は 最後 に 読み取られた 値 を 返します 。

source: Distance in centimeters. Returns -1 if thread is running,
de: Entfernung in Zentimetern. Gibt -1 zurück, wenn der Thread läuft,

source: otherwise returns the last read value.
de: ansonsten wird der zuletzt gelesene Wert zurückgegeben.

source: Thread loop for reading distance value periodically.
de: Thread-Schleife zum periodischen Lesen des Entfernungswerts.
ja: 距離 値 を 定期 的 に 読み取る ため の スレッド ループ 。

source: Start the thread for reading distance value periodically.
de: Den Thread zum periodischen Lesen des Entfernungswerts starten.
ja: 距離 値 を 定期 的 に 読み取る スレッド を 開始 します 。

source: Interval duration in seconds. Default is 0.01.
de: Intervall-Dauer in Sekunden. Standard ist 0.01.
ja: 実行 間隔 ( 秒 ) 。 デフォルト は 0.01 です 。

source: Stop the thread for reading distance value.
de: Den Thread zum Lesen des Entfernungswerts stoppen.
ja: 距離 値 を 読み取る スレッド を 停止 します 。
