Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.pwm.po
Languages: de, ja

source: fusion\_hat.pwm module
de: fusion\_hat.pwm Modul
ja: fusion\_hat.pwm モジュール

source: PWM class to control a single PWM channel
de: PWM-Klasse zur Steuerung eines einzelnen PWM-Kanals
ja: 単一 の PWM チャンネル を 制御 する PWM クラス

source: Example
de: Beispiel

source: Simple example to control PWM channel 0 at 50Hz with 50% duty cycle.
de: Einfaches Beispiel zur Steuerung des PWM-Kanals 0 mit 50 Hz und 50 % Tastverhältnis.
ja: 50Hz 、 デューティ サイクル 50% で PWM チャンネル 0 を 制御 する シンプル な 例 。

source: Advanced example to control PWM channel with 50 Hz frequency, 20000us and pulse width 500-2500us for servos.
de: Fortgeschrittenes Beispiel zur Steuerung eines PWM-Kanals mit 50 Hz Frequenz, 20000 us und einer Pulsbreite von 500–2500 us für Servos.
ja: サーボ 用 に 周波数 50 Hz 、 周期 20000us 、 パルス 幅 500-2500us で PWM チャンネル を 制御 する 高度 な 例 。

source: Bases: :py:class:`~fusion_hat._base._Base`
de: Basisklassen: :py:class:`~fusion_hat._base._Base`

source: Parameters
de: Parameter

source: PWM channel number(0-11/P0-P11)
de: PWM-Kanalnummer ( 0–11 / P0–P11 )
ja: PWM チャンネル 番号 (0-11 / P0-P11)

source: PWM frequency, default is 50Hz
de: PWM-Frequenz, Standard ist 50 Hz
ja: PWM 周波数 。 デフォルト は 50Hz

source: I2C address, default is 0x17
de: I2C-Adresse, Standard ist 0x17
ja: I2C アドレス 。 デフォルト は 0x17

source: Additional arguments for :class:`fusion_hat._i2c.I2C`
de: Zusätzliche Argumente für :py:class:`fusion_hat._i2c.I2C`
ja: :class:`fusion_hat._i2c.I2C` へ 渡す 追加 引数

source: Additional keyword arguments for :class:`fusion_hat._i2c.I2C`
de: Zusätzliche Schlüsselwortargumente für :py:class:`fusion_hat._i2c.I2C`
ja: :class:`fusion_hat._i2c.I2C` へ 渡す 追加 キーワード 引数

source: Raises
de: Wirft

source: Invalid channel number
de: Ungültige Kanalnummer
ja: 無効 な チャンネル 番号

source: Enable/disable PWM channel
de: PWM-Kanal aktivieren oder deaktivieren
ja: PWM チャンネル を 有効 / 無効 に する

source: enable or disable, default is True
de: aktivieren oder deaktivieren, Standard ist True
ja: 有効 または 無効 。 デフォルト は True

source: Get period in ms
de: Periode in ms abrufen
ja: 周期 を ms 単位 で 取得 する

source: Returns
de: Rückgabewerte

source: period in ms
de: Periode in ms
ja: ms 単位 の 周期

source: Return type
de: Rückgabetyp

source: Set period in ms
de: Periode in ms setzen
ja: 周期 を ms 単位 で 設定 する

source: Get duty cycle in ms
de: Tastverhältnis in ms abrufen
ja: デューティ サイクル を ms 単位 で 取得 する

source: duty cycle in ms
de: Tastverhältnis in ms
ja: ms 単位 の デューティ サイクル

source: Set duty cycle in ms
de: Tastverhältnis in ms setzen
ja: デューティ サイクル を ms 単位 で 設定 する

source: Set/get frequency, leave blank to get frequency
de: Frequenz setzen oder abrufen, leer lassen, um die Frequenz abzurufen
ja: 周波数 を 設定 / 取得 する 。 空欄 の 場合 は 周波数 を 取得

source: frequency(0-65535)(Hz), default is 50Hz
de: Frequenz ( 0–65535 ) ( Hz ), Standard ist 50 Hz
ja: 周波数 (0-65535) (Hz) 。 デフォルト は 50Hz

source: frequency
de: Frequenz
ja: 周波数

source: [Deprecated] Set/get prescaler, leave blank to get prescaler
de: [ VERALTET ] Prescaler setzen oder abrufen, leer lassen, um den Prescaler abzurufen
ja: [非推奨] プリスケーラ を 設定 / 取得 する 。 空欄 の 場合 は プリスケーラ を 取得

source: Set/get period, leave blank to get period
de: Periode setzen oder abrufen, leer lassen, um die Periode abzurufen
ja: 周期 を 設定 / 取得 する 。 空欄 の 場合 は 周期 を 取得

source: period(0-65535), default is 0
de: Periode ( 0–65535 ), Standard ist 0
ja: 周期 (0-65535) 。 デフォルト は 0

source: Whether to write period directly, default is False
de: Ob die Periode direkt geschrieben wird, Standard ist False
ja: 周期 を 直接 書き込む か どうか 。 デフォルト は False

source: period
de: Periode
ja: 周期

source: Set/get duty cycle, in ms
de: Tastverhältnis setzen oder abrufen, in ms
ja: デューティ サイクル を ms 単位 で 設定 / 取得 する

source: duty cycle
de: Tastverhältnis
ja: デューティ サイクル

source: Set/get pulse width, in ms
de: Pulsbreite setzen oder abrufen, in ms
ja: パルス 幅 を ms 単位 で 設定 / 取得 する

source: pulse width in ms
de: Pulsbreite in ms
ja: ms 単位 の パルス 幅

source: pulse width
de: Pulsbreite
ja: パルス 幅

source: Set/get pulse width percentage, leave blank to get pulse width percentage
de: Pulsbreitenprozentsatz setzen oder abrufen, leer lassen, um den Pulsbreitenprozentsatz abzurufen
ja: パルス 幅 の 割合 を 設定 / 取得 する 。 空欄 の 場合 は 割合 を 取得

source: pulse width percentage(0-100), default is 0
de: Pulsbreitenprozentsatz ( 0–100 ), Standard ist 0
ja: パルス 幅 の 割合 (0-100) 。 デフォルト は 0

source: pulse width percentage
de: Pulsbreitenprozentsatz
ja: パルス 幅 の 割合

source: Close PWM channel
de: PWM-Kanal schließen
ja: PWM チャンネル を クローズ する

source: Close PWM channel when object is deleted
de: PWM-Kanal schließen, wenn das Objekt gelöscht wird
ja: オブジェクト が 削除 さ れ た 際 に PWM チャンネル を クローズ する
