Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.music.po
Languages: de, ja

source: fusion\_hat.music module
de: fusion\_hat.music Modul
ja: fusion\_hat.music モジュール

source: Music
de: Musik
ja: ミュージック

source: This module provides a class for playing music, sound affect and note control.
de: Dieses Modul stellt eine Klasse zum Abspielen von Musik, Soundeffekten und zur Notensteuerung bereit.
ja: この モジュール は 音楽 、 効果 音 、 および 音符 制御 を 再生 する ため の クラス を 提供 します 。

source: Example
de: Beispiel

source: Import the module and create an instance
de: Das Modul importieren und eine Instanz erstellen
ja: モジュール を インポート し 、 インスタンス を 作成 します

source: Play a music file
de: Eine Musikdatei abspielen
ja: 音楽 ファイル を 再生 します

source: Play music in a thread
de: Musik in einem Thread abspielen
ja: スレッド 内 で 音楽 を 再生 します

source: Control the music
de: Die Musik steuern
ja: 音楽 を 制御 します

source: Play a sound file
de: Eine Sounddatei abspielen
ja: 効果 音 ファイル を 再生 します

source: Play a sound file in a thread
de: Eine Sounddatei in einem Thread abspielen
ja: スレッド 内 で 効果 音 ファイル を 再生 します

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: Play music, sound affect and note control
de: Musik, Soundeffekte und Notensteuerung abspielen
ja: 音楽 、 効果 音 、 および 音符 制御 を 再生 します

source: Base note frequency for calculation (A4)
de: Basis-Notenfrequenz für Berechnungen ( A4 )
ja: 計算 用 の 基準 音符 周波数 ( A4 )

source: Base note index for calculation (A4) MIDI compatible
de: Basis-Notenindex für Berechnungen ( A4 ), MIDI-kompatibel
ja: 計算 用 の 基準 音符 インデックス ( A4 ) MIDI 互換

source: Notes name, MIDI compatible
de: Notennamen, MIDI-kompatibel
ja: 音符 名 、 MIDI 互換

source: Set/get time signature
de: Taktart setzen oder abrufen
ja: 拍子 を 設定 / 取得 します

source: Parameters
de: Parameter

source: top number of time signature. Defaults to None.
de: Obere Zahl der Taktart. Standard ist None.
ja: 拍子 の 分子 。 デフォルト は None です 。

source: bottom number of time signature. Defaults to None.
de: Untere Zahl der Taktart. Standard ist None.
ja: 拍子 の 分母 。 デフォルト は None です 。

source: Returns
de: Rückgabewerte

source: time signature
de: Taktart
ja: 拍子

source: Return type
de: Rückgabetyp

source: Set/get key signature
de: Tonart setzen oder abrufen
ja: 調号 を 設定 / 取得 します

source: key signature use KEY_XX_MAJOR or String "#", "##", or "bbb", "bbbb". Defaults to None.
de: Tonart verwendet KEY_XX_MAJOR oder die Zeichenkette "#", "##", oder "bbb", "bbbb". Standard ist None.
ja: 調号 は KEY_XX_MAJOR または 文字列 "#" 、 "##" 、 "bbb" 、 "bbbb" を 使用 します 。 デフォルト は None です 。

source: key signature
de: Tonart
ja: 調号

source: Set/get tempo beat per minute(bpm)
de: Tempo in Schlägen pro Minute ( bpm ) setzen oder abrufen
ja: テンポ ( bpm ) を 設定 / 取得 します

source: tempo. Defaults to None.
de: Tempo. Standard ist None.
ja: テンポ 。 デフォルト は None です 。

source: note value(1, 1/2, Music.HALF_NOTE, etc). Defaults to QUARTER_NOTE.
de: Notenwert ( 1, 1/2, Music.HALF_NOTE, usw. ). Standard ist QUARTER_NOTE.
ja: 音符 の 値 ( 1 、 1/2 、 Music.HALF_NOTE など ) 。 デフォルト は QUARTER_NOTE です 。

source: Calculate beat delay in seconds from tempo
de: Schlagverzögerung in Sekunden aus dem Tempo berechnen
ja: テンポ から 拍 の 遅延 ( 秒 ) を 計算 します

source: beat index
de: Schlagindex
ja: 拍 インデックス

source: beat delay
de: Schlagverzögerung
ja: 拍 の 遅延

source: Get frequency of a note
de: Die Frequenz einer Note abrufen
ja: 音符 の 周波数 を 取得 します

source: note name(See NOTES)
de: Notenname ( siehe NOTES )
ja: 音符 名 ( NOTES を 参照 )

source: if natural note. Defaults to False.
de: Ob es eine natürliche Note ist. Standard ist False.
ja: ナチュラル 音符 か どうか 。 デフォルト は False です 。

source: frequency of note
de: Frequenz der Note
ja: 音符 の 周波数

source: Play sound effect file
de: Soundeffektdatei abspielen
ja: 効果 音 ファイル を 再生 します

source: sound effect file name
de: Name der Soundeffektdatei
ja: 効果 音 ファイル 名

source: volume 0-100, leave empty will not change volume. Defaults to None.
de: Lautstärke 0–100, leer lassen ändert die Lautstärke nicht. Standard ist None.
ja: 音量 0-100 。 未 指定 の 場合 、 音量 は 変更 されません 。 デフォルト は None です 。

source: Play sound effect in thread(in the background)
de: Soundeffekt in einem Thread ( im Hintergrund ) abspielen
ja: バックグラウンド の スレッド で 効果 音 を 再生 します

source: Play music file
de: Musikdatei abspielen
ja: 音楽 ファイル を 再生 します

source: sound file name
de: Name der Sounddatei
ja: 音声 ファイル 名

source: number of loops, 0:loop forever, 1:play once, 2:play twice, ... Defaults to 1.
de: Anzahl der Wiederholungen, 0: Endlosschleife, 1: einmal abspielen, 2: zweimal abspielen, ... Standard ist 1.
ja: ループ 回数 。 0 : 無限 ループ 、 1 : 1 回 再生 、 2 : 2 回 再生 、 … 。 デフォルト は 1 です 。

source: start time in seconds. Defaults to 0.0.
de: Startzeit in Sekunden. Standard ist 0.0.
ja: 開始 時刻 ( 秒 ) 。 デフォルト は 0.0 です 。

source: Set music volume
de: Musiklautstärke einstellen
ja: 音楽 の 音量 を 設定 します

source: volume 0-100
de: Lautstärke 0–100
ja: 音量 0-100

source: Stop music
de: Musik stoppen
ja: 音楽 を 停止 します

source: Pause music
de: Musik pausieren
ja: 音楽 を 一時 停止 します

source: Resume music
de: Musik fortsetzen
ja: 音楽 を 再開 します

source: Unpause music(resume music)
de: Musik fortsetzen ( Resume )
ja: 音楽 の 一時 停止 を 解除 ( 再開 ) します

source: Get sound effect length in seconds
de: Die Länge des Soundeffekts in Sekunden abrufen
ja: 効果 音 の 長さ ( 秒 ) を 取得 します

source: length in seconds
de: Länge in Sekunden
ja: 長さ ( 秒 )

source: Get tone data for playing
de: Tondaten zum Abspielen abrufen
ja: 再生 用 の トーン データ を 取得 します

source: Credit to: Aditya Shankar & Gringo Suave https://stackoverflow.com/a/53231212/14827323
de: Dank an: Aditya Shankar & Gringo Suave https://stackoverflow.com/a/53231212/14827323
ja: クレジット : Aditya Shankar & Gringo Suave https://stackoverflow.com/a/53231212/14827323

source: frequency
de: Frequenz
ja: 周波数

source: duration in seconds
de: Dauer in Sekunden
ja: 継続 時間 ( 秒 )

source: tone data
de: Tondaten
ja: トーン データ

source: Play tone for duration seconds Credit to: Aditya Shankar & Gringo Suave https://stackoverflow.com/a/53231212/14827323
de: Einen Ton für die angegebene Dauer abspielen. Dank an: Aditya Shankar & Gringo Suave https://stackoverflow.com/a/53231212/14827323
ja: 指定 した 秒数 だけ トーン を 再生 します 。 クレジット : Aditya Shankar & Gringo Suave https://stackoverflow.com/a/53231212/14827323

source: frequency, you can use NOTES to get frequency
de: Frequenz, Sie können NOTES verwenden, um die Frequenz zu erhalten
ja: 周波数 。 NOTES を 使用 して 周波数 を 取得 できます

source: tempo
ja: テンポ
