Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.adc.po
Languages: de, ja

source: fusion\_hat.adc module
de: Modul fusion\_hat.adc
ja: fusion\_hat.adc モジュール

source: Fusion Hat on-board analog to digital converter
de: Onboard-Analog-zu-Digital-Wandler des Fusion HAT
ja: Fusion Hat 搭載のアナログ・デジタル変換器

source: Example
de: Beispiel

source: Import ADC
de: ADC importieren
ja: ADC をインポート

source: Init ADC channel 0
de: ADC-Kanal 0 initialisieren
ja: ADC チャンネル 0 を初期化

source: Read ADC channel 0 value
de: Wert von ADC-Kanal 0 lesen
ja: ADC チャンネル 0 の値を読み取る

source: Read ADC channel 0 voltage
de: Spannung von ADC-Kanal 0 lesen
ja: ADC チャンネル 0 の電圧を読み取る

source: Bases: :py:class:`~fusion_hat._base._Base`
de: Basisklassen: :py:class:`~fusion_hat._base._Base`

source: ADC class
de: ADC-Klasse
ja: ADC クラス

source: Parameters
de: Parameter

source: channel number or Str start with A
de: Kanalnummer oder Zeichenkette beginnend mit A
ja: チャンネル番号、または A で始まる文字列

source: pass to :class:`fusion_hat._base._base`
de: Wird an :class:`fusion_hat._base._base` übergeben
ja: :class:`fusion_hat._base._base` に渡されます

source: Raises
de: Ausnahmen

source: channel must be channel number or Str start with A
de: channel muss eine Kanalnummer oder eine mit A beginnende Zeichenkette sein
ja: channel はチャンネル番号、または A で始まる文字列である必要があります

source: find adc device
de: ADC-Gerät finden
ja: ADC デバイスを検出

source: Returns
de: Rückgabewert

source: adc device index
de: ADC-Geräteindex
ja: ADC デバイスのインデックス

source: Return type
de: Rückgabetyp

source: read raw value
de: Rohwert lesen
ja: 生データ値を読み取る

source: raw value
de: Rohwert
ja: 生データ値

source: read voltage value in V
de: Spannungswert in V lesen
ja: 電圧値（V）を読み取る

source: voltage value in V
de: Spannungswert in V
ja: 電圧値（V）

source: get channel
de: Kanal abrufen
ja: チャンネルを取得

source: channel number
de: Kanalnummer
ja: チャンネル番号

source: get voltage
de: Spannung abrufen
ja: 電圧を取得

source: voltage value in mV
de: Spannungswert in mV
ja: 電圧値（mV）

source: get raw value
de: Rohwert abrufen
ja: 生データ値を取得
