Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.pin.po
Languages: de, ja

source: fusion\_hat.pin module
de: fusion\_hat.pin Modul
ja: fusion\_hat.pin モジュール

source: Pin manipulation class
de: Pin-Manipulationsklasse
ja: ピン 操作 クラス

source: Example
de: Beispiel

source: Simple example with auto mode
de: Einfaches Beispiel mit Auto-Modus
ja: 自動 モード を 使用 した 簡単 な 例

source: Output mode
de: Ausgabemodus
ja: 出力 モード

source: Input mode
de: Eingabemodus
ja: 入力 モード

source: Active state, If your LED active LOW, you can set active_state make things easier.
de: Aktiver Zustand. Wenn Ihre LED aktiv LOW ist, können Sie active_state setzen, um die Verwendung zu vereinfachen.
ja: アクティブ 状態 。 LED が LOW で 有効 な 場合 、 active_state を 設定 する ことで 操作 が 簡単 に なります 。

source: And also if your button active LOW, you can set active_state to Pin.ACTIVE_LOW. you can also do the same.
de: Wenn auch Ihre Taste aktiv LOW ist, können Sie active_state auf Pin.ACTIVE_LOW setzen. Sie können dasselbe tun.
ja: また 、 ボタン が LOW で 有効 な 場合 は 、 active_state を Pin.ACTIVE_LOW に 設定 できます 。 同様 に 設定 可能 です 。

source: You can also set interrupts on activated or deactivated state.
de: Sie können auch Interrupts für den aktivierten oder deaktivierten Zustand setzen.
ja: アクティブ または 非 アクティブ 状態 に 割り込み を 設定 する こと も できます 。

source: Bases: :py:class:`~enum.Enum`
de: Basisklassen: :py:class:`~enum.Enum`

source: Pin direction
de: Pin-Richtung
ja: ピン の 方向

source: Pin direction auto
de: Pin-Richtung Auto
ja: ピン 方向 自動

source: Pin direction input
de: Pin-Richtung Eingang
ja: ピン 方向 入力

source: Pin direction output
de: Pin-Richtung Ausgang
ja: ピン 方向 出力

source: Pin pull up/down
de: Pin Pull-Up / Pull-Down
ja: ピン プルアップ / プルダウン

source: Pin internal pull up
de: Interner Pull-Up des Pins
ja: ピン 内部 プルアップ

source: Pin internal pull down
de: Interner Pull-Down des Pins
ja: ピン 内部 プルダウン

source: Pin internal pull none
de: Kein interner Pull-Widerstandstand des Pins
ja: ピン 内部 プル なし

source: Pin active state
de: Pin-Aktivzustand
ja: ピン アクティブ 状態

source: Pin active state high
de: Pin-Aktivzustand High
ja: ピン アクティブ 状態 HIGH

source: Pin active state low
de: Pin-Aktivzustand Low
ja: ピン アクティブ 状態 LOW

source: Pin interrupt falling
de: Pin-Interrupt fallend
ja: ピン 割り込み 立ち下がり

source: Pin interrupt rising
de: Pin-Interrupt steigend
ja: ピン 割り込み 立ち上がり

source: Pin interrupt both rising and falling
de: Pin-Interrupt sowohl steigend als auch fallend
ja: ピン 割り込み 立ち上がり / 立ち下がり 両方

source: Bases: :py:class:`~fusion_hat._base._Base`
de: Basisklassen: :py:class:`~fusion_hat._base._Base`

source: a pin wraping class of RPi.GPIO. you need to install rpi.lgpio instead of RPi.GPIO on Pi 5
de: Eine Pin-Wrapper-Klasse für RPi.GPIO. Auf dem Pi 5 müssen Sie rpi.lgpio statt RPi.GPIO installieren.
ja: RPi.GPIO の ピン ラッパー クラス です 。 Pi 5 では RPi.GPIO の 代わり に rpi.lgpio を インストール する 必要 が あります 。

source: Parameters
de: Parameter

source: pin number of Raspberry Pi
de: Pin-Nummer des Raspberry Pi
ja: Raspberry Pi の ピン 番号

source: pin mode(IN/OUT/AUTO). Defaults to Mode.AUTO.
de: Pin-Modus ( IN / OUT / AUTO ). Standard ist Mode.AUTO.
ja: ピン モード ( IN / OUT / AUTO ) 。 デフォルト は Mode.AUTO です 。

source: pin pull (Pull.UP/Pull.DOWN/Pull.NONE). Defaults to Pull.NONE.
de: Pin-Pull ( Pull.UP / Pull.DOWN / Pull.NONE ). Standard ist Pull.NONE.
ja: ピン プル ( Pull.UP / Pull.DOWN / Pull.NONE ) 。 デフォルト は Pull.NONE です 。

source: active state of pin, If True, when the hardware pin state is HIGH, the software pin is HIGH. If False, the input polarity is reversed. Defaults to Active.HIGH.
de: Aktiver Zustand des Pins. Wenn True, ist der Software-Pin HIGH, wenn der Hardware-Pin HIGH ist. Wenn False, wird die Eingangspolarität invertiert. Standard ist Active.HIGH.
ja: ピン の アクティブ 状態 。 True の 場合 、 ハードウェア ピン が HIGH の とき ソフトウェア ピン も HIGH に なります 。 False の 場合 、 入力 極性 が 反転 します 。 デフォルト は Active.HIGH です 。

source: bounce time of pin interrupt in seconds. Defaults to 0.02.
de: Entprellzeit des Pin-Interrupts in Sekunden. Standard ist 0.02.
ja: ピン 割り込み の バウンス 時間 ( 秒 ) 。 デフォルト は 0.02 です 。

source: Additional arguments for :class:`fusion_hat._base._Base`
de: Zusätzliche Argumente für :py:class:`fusion_hat._base._Base`
ja: :class:`fusion_hat._base._Base` 用 の 追加 引数

source: Additional keyword arguments for :class:`fusion_hat._base._Base`
de: Zusätzliche Schlüsselwortargumente für :py:class:`fusion_hat._base._Base`
ja: :class:`fusion_hat._base._Base` 用 の 追加 キーワード 引数

source: Pin mode output
de: Pin-Modus Ausgang

source: Pin mode input
de: Pin-Modus Eingang

source: Pin mode auto
de: Pin-Modus Auto

source: Close the pin
de: Den Pin schließen
ja: ピン を クローズ します

source: Deinitialize the pin
de: Den Pin deinitialisieren
ja: ピン を 初期化 解除 します

source: Setup the pin
de: Den Pin einrichten
ja: ピン を 設定 します

source: Set/get the pin value
de: Pin-Wert setzen oder abrufen
ja: ピン の 値 を 設定 / 取得 します

source: pin value, leave it empty to get the value(0/1). Defaults to None.
de: Pin-Wert, leer lassen, um den Wert ( 0 / 1 ) zu erhalten. Standard ist None.
ja: ピン 値 。 空 の 場合 は 値 ( 0 / 1 ) を 取得 します 。 デフォルト は None です 。

source: Returns
de: Rückgabewerte

source: pin value(0/1)
de: Pin-Wert ( 0 / 1 )
ja: ピン 値 ( 0 / 1 )

source: Return type
de: Rückgabetyp

source: Set/get the pin raw value
de: Rohwert des Pins setzen oder abrufen
ja: ピン の 生 値 を 設定 / 取得 します

source: Raises
de: Wirft

source: if pin mode is IN
de: wenn der Pin-Modus IN ist
ja: ピン モード が IN の 場合

source: Set pin on(high)
de: Pin auf Ein ( High ) setzen
ja: ピン を オン ( HIGH ) に 設定 します

source: pin value(1)
de: Pin-Wert ( 1 )

source: Set pin off(low)
de: Pin auf Aus ( Low ) setzen
ja: ピン を オフ ( LOW ) に 設定 します

source: pin value(0)
de: Pin-Wert ( 0 )

source: Set pin high(1)
de: Pin auf High ( 1 ) setzen
ja: ピン を HIGH ( 1 ) に 設定 します

source: Set pin low(0)
de: Pin auf Low ( 0 ) setzen
ja: ピン を LOW ( 0 ) に 設定 します

source: Set the pin interrupt
de: Den Pin-Interrupt setzen
ja: ピン 割り込み を 設定 します

source: interrupt handler callback function
de: Callback-Funktion des Interrupt-Handlers
ja: 割り込み ハンドラ の コールバック 関数

source: interrupt trigger(RISING, FALLING, RISING_FALLING). Defaults to Trigger.BOTH.
de: Interrupt-Trigger ( RISING, FALLING, RISING_FALLING ). Standard ist Trigger.BOTH.
ja: 割り込み トリガ ( RISING 、 FALLING 、 RISING_FALLING ) 。 デフォルト は Trigger.BOTH です 。

source: if trigger is not valid
de: wenn der Trigger nicht gültig ist

source: Initialize the pin interrupt
de: Den Pin-Interrupt initialisieren
ja: ピン 割り込み を 初期化 します

source: Handle the pin interrupt
de: Den Pin-Interrupt verarbeiten
ja: ピン 割り込み を 処理 します

source: pin number
de: Pin-Nummer
ja: ピン 番号

source: Get the pressed handler
de: Den Handler für Gedrückt abrufen
ja: 押下 時 の ハンドラ を 取得 します

source: pressed handler
de: Gedrückt-Handler
ja: 押下 ハンドラ

source: Get the released handler
de: Den Handler für Losgelassen abrufen
ja: 解放 時 の ハンドラ を 取得 します

source: released handler
de: Losgelassen-Handler
ja: 解放 ハンドラ

source: Pin interrupt
ja: ピン 割り込み
