Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.device.po
Languages: de, ja

source: fusion\_hat.device module
de: Modul fusion\_hat.device
ja: fusion\_hat.device モジュール

source: Fusion Hat device related functions
de: Gerätebezogene Funktionen des Fusion Hat
ja: Fusion Hat デバイス関連の関数

source: Example
de: Beispiel

source: Import device module
de: Gerätemodul importieren
ja: device モジュールをインポートします

source: Enable speaker
de: Lautsprecher aktivieren
ja: スピーカーを有効にします

source: Disable speaker
de: Lautsprecher deaktivieren
ja: スピーカーを無効にします

source: Get user button state
de: Status der Benutzertaste abrufen
ja: ユーザーボタンの状態を取得します

source: Get shutdown request state
de: Status der Herunterfahranforderung abrufen
ja: シャットダウン要求の状態を取得します

source: Toggle user LED
de: Benutzer-LED umschalten
ja: ユーザー LED を切り替えます

source: Get firmware version
de: Firmware-Version abrufen
ja: ファームウェアのバージョンを取得します

source: Set volume
de: Lautstärke einstellen
ja: 音量を設定します

source: Get battery voltage
de: Batteriespannung abrufen
ja: バッテリー電圧を取得します

source: Name of the board
de: Name der Platine
ja: ボード名

source: ID of the board
de: ID der Platine
ja: ボード ID

source: UUID of the board
de: UUID der Platine
ja: ボードの UUID

source: Product ID of the board
de: Produkt-ID der Platine
ja: ボードの製品 ID

source: Product version of the board
de: Produktversion der Platine
ja: ボードの製品バージョン

source: Vendor of the board
de: Hersteller der Platine
ja: ボードのベンダー

source: Check if a Fusion Hat board is installed
de: Prüfen, ob eine Fusion-Hat-Platine installiert ist
ja: Fusion Hat ボードがインストールされているかを確認します

source: Returns
de: Rückgabewert

source: True if installed, False otherwise
de: True, wenn installiert, sonst False
ja: インストールされている場合は True、そうでない場合は False

source: Return type
de: Rückgabetyp

source: Parameters
de: Parameter

source: volume(0~100)
de: Lautstärke (0~100)
ja: 音量（0～100）
