Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.mpu6050.po
Languages: de, ja

source: fusion\_hat.modules.mpu6050 module
de: fusion\_hat.modules.mpu6050 Modul
ja: fusion\_hat.modules.mpu6050 モジュール

source: This code is based on Martijn's(martijn@mrtijn.nl) project mpu6050. Follow the MIT protocol.
de: Dieser Code basiert auf dem Projekt mpu6050 von Martijn ( martijn@mrtijn.nl ). Folgt dem MIT-Protokoll.
ja: この コード は Martijn ( martijn@mrtijn.nl ) の プロジェクト mpu6050 を 基に して います 。 MIT ライセンス に 従い ます 。

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: Read two i2c registers and combine them.
de: Zwei I2C-Register lesen und sie kombinieren.
ja: 2 つ の I2C レジスタ を 読み取り 、 それら を 結合 します 。

source: register -- the first register to read from. Returns the combined read results.
de: register -- das erste Register, von dem gelesen wird. Gibt die kombinierten Leseergebnisse zurück.
ja: register -- 読み取り を 開始 する 最初 の レジスタ 。 読み取り 結果 を 結合 して 返し ます 。

source: Reads the temperature from the onboard temperature sensor of the MPU-6050.
de: Liest die Temperatur vom integrierten Temperatursensor des MPU-6050.
ja: MPU-6050 に 搭載 されて いる 温度 センサー から 温度 を 読み取り ます 。

source: Returns the temperature in degrees Celcius.
de: Gibt die Temperatur in Grad Celsius zurück.
ja: 摂氏 度 ( °C ) で の 温度 を 返し ます 。

source: Sets the range of the accelerometer to range.
de: Setzt den Bereich des Beschleunigungssensors auf den angegebenen Bereich.
ja: 加速度 センサー の レンジ を 指定 された 範囲 に 設定 します 。

source: accel_range -- the range to set the accelerometer to. Using a pre-defined range is advised.
de: accel_range -- der Bereich, auf den der Beschleunigungssensor eingestellt wird. Die Verwendung eines vordefinierten Bereichs wird empfohlen.
ja: accel_range -- 加速度 センサー に 設定 する レンジ 。 事前 定義 された レンジ を 使用 する こと を 推奨 します 。

source: Reads the range the accelerometer is set to.
de: Liest den Bereich, auf den der Beschleunigungssensor eingestellt ist.
ja: 現在 設定 されて いる 加速度 センサー の レンジ を 読み取り ます 。

source: If raw is True, it will return the raw value from the ACCEL_CONFIG register If raw is False, it will return an integer: -1, 2, 4, 8 or 16. When it returns -1 something went wrong.
de: Wenn raw True ist, wird der Rohwert aus dem ACCEL_CONFIG-Register zurückgegeben. Wenn raw False ist, wird eine Ganzzahl zurückgegeben: -1, 2, 4, 8 oder 16. Wenn -1 zurückgegeben wird, ist etwas schiefgelaufen.
ja: raw が True の 場合 、 ACCEL_CONFIG レジスタ から の 生 の 値 を 返し ます 。 raw が False の 場合 、 -1 、 2 、 4 、 8 、 16 の いずれか の 整数 を 返し ます 。 -1 が 返る 場合 は 何らか の エラー が 発生 して います 。

source: Gets and returns the X, Y and Z values from the accelerometer.
de: Ruft die X-, Y- und Z-Werte des Beschleunigungssensors ab und gibt sie zurück.
ja: 加速度 センサー から X 、 Y 、 Z の 値 を 取得 して 返し ます 。

source: If g is True, it will return the data in g If g is False, it will return the data in m/s^2 Returns a dictionary with the measurement results.
de: Wenn g True ist, werden die Daten in g zurückgegeben. Wenn g False ist, werden die Daten in m/s^2 zurückgegeben. Gibt ein Wörterbuch mit den Messergebnissen zurück.
ja: g が True の 場合 、 データ を g 単位 で 返し ます 。 g が False の 場合 、 データ を m/s^2 単位 で 返し ます 。 測定 結果 を 含む 辞書 を 返し ます 。

source: Sets the range of the gyroscope to range.
de: Setzt den Bereich des Gyroskops auf den angegebenen Bereich.
ja: ジャイロ スコープ の レンジ を 指定 された 範囲 に 設定 します 。

source: gyro_range -- the range to set the gyroscope to. Using a pre-defined range is advised.
de: gyro_range -- der Bereich, auf den das Gyroskop eingestellt wird. Die Verwendung eines vordefinierten Bereichs wird empfohlen.
ja: gyro_range -- ジャイロ スコープ に 設定 する レンジ 。 事前 定義 された レンジ を 使用 する こと を 推奨 します 。

source: Sets the low-pass bandpass filter frequency
de: Setzt die Frequenz des Tiefpass-Bandpassfilters
ja: ローパス / バンドパス フィルタ の 周波数 を 設定 します

source: Reads the range the gyroscope is set to.
de: Liest den Bereich, auf den das Gyroskop eingestellt ist.
ja: 現在 設定 されて いる ジャイロ スコープ の レンジ を 読み取り ます 。

source: If raw is True, it will return the raw value from the GYRO_CONFIG register. If raw is False, it will return 250, 500, 1000, 2000 or -1. If the returned value is equal to -1 something went wrong.
de: Wenn raw True ist, wird der Rohwert aus dem GYRO_CONFIG-Register zurückgegeben. Wenn raw False ist, werden 250, 500, 1000, 2000 oder -1 zurückgegeben. Wenn der zurückgegebene Wert -1 ist, ist etwas schiefgelaufen.
ja: raw が True の 場合 、 GYRO_CONFIG レジスタ から の 生 の 値 を 返し ます 。 raw が False の 場合 、 250 、 500 、 1000 、 2000 、 または -1 を 返し ます 。 -1 が 返る 場合 は 何らか の エラー が 発生 して います 。

source: Gets and returns the X, Y and Z values from the gyroscope.
de: Ruft die X-, Y- und Z-Werte des Gyroskops ab und gibt sie zurück.
ja: ジャイロ スコープ から X 、 Y 、 Z の 値 を 取得 して 返し ます 。

source: Returns the read values in a dictionary.
de: Gibt die gelesenen Werte in einem Wörterbuch zurück.
ja: 読み取っ た 値 を 辞書 として 返し ます 。

source: Reads and returns all the available data.
de: Liest alle verfügbaren Daten und gibt sie zurück.
ja: 利用 可能 な すべて の データ を 読み取り 、 返し ます 。

source: Enable MPU6050 bypass mode
de: MPU6050-Bypass-Modus aktivieren
ja: MPU6050 の バイパス モード を 有効 に します

source: Returns
de: Rückgabewerte

source: USER_CTRL and INT_PIN_CFG register values
de: Werte der Register USER_CTRL und INT_PIN_CFG
ja: USER_CTRL および INT_PIN_CFG レジスタ の 値

source: Return type
de: Rückgabetyp
