Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat._config.po
Languages: de, ja

source: fusion\_hat.\_config module
de: Modul fusion\_hat.\_config
ja: fusion\_hat.\_config モジュール

source: Bases: :py:class:`~fusion_hat._base._Base`
de: Basisklassen: :py:class:`~fusion_hat._base._Base`

source: Config class
de: Konfigurationsklasse
ja: Config クラス

source: Parameters
de: Parameter

source: config file path
de: Pfad zur Konfigurationsdatei
ja: 設定ファイルのパス

source: pass to :class:`#fusion_hat._base._Base`
de: an :class:`#fusion_hat._base._Base` übergeben
ja: :class:`#fusion_hat._base._Base` に渡されます

source: Get the value of the key
de: Ruft den Wert des Schlüssels ab
ja: キーの値を取得します

source: key name
de: Schlüsselname
ja: キー名

source: default value if the key is not found. Defaults to None.
de: Standardwert, wenn der Schlüssel nicht gefunden wird. Standard ist None.
ja: キーが見つからない場合のデフォルト値。デフォルトは None です。

source: Returns
de: Rückgabe

source: value of the key
de: Wert des Schlüssels
ja: キーの値

source: Return type
de: Rückgabetyp

source: Set the value of the key
de: Setzt den Wert des Schlüssels
ja: キーの値を設定します

source: Delete the key
de: Löscht den Schlüssel
ja: キーを削除します

source: Check if the key exists
de: Prüft, ob der Schlüssel existiert
ja: キーが存在するかどうかを確認します

source: True if the key exists, False otherwise
de: True, wenn der Schlüssel existiert, andernfalls False
ja: キーが存在する場合は True、存在しない場合は False

source: Iterate over the keys
de: Iteriert über die Schlüssel
ja: キーを反復処理します

source: iterator over the keys
de: Iterator über die Schlüssel
ja: キーのイテレータ

source: Get the number of keys
de: Ruft die Anzahl der Schlüssel ab
ja: キーの数を取得します

source: number of keys
de: Anzahl der Schlüssel
ja: キーの数

source: Get the string representation of the config
de: Ruft die String-Darstellung der Konfiguration ab
ja: 設定の文字列表現を取得します

source: string representation of the config
de: String-Darstellung der Konfiguration
ja: 設定の文字列表現
