Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.magnetometer.po
Languages: de, ja

source: fusion\_hat.modules.magnetometer module
de: fusion\_hat.modules.magnetometer Modul
ja: fusion\_hat.modules.magnetometer モジュール

source: Bases: :py:class:`~enum.Enum`
de: Basisklassen: :py:class:`~enum.Enum`

source: Check if a device responds at the specified I2C address
de: Prüfen, ob ein Gerät auf der angegebenen I2C-Adresse antwortet
ja: 指定 された I2C アドレス で デバイス が 応答 する か を 確認 します

source: Parameters
de: Parameter

source: SMBus instance
de: SMBus-Instanz
ja: SMBus インスタンス

source: I2C address to check
de: Zu prüfende I2C-Adresse
ja: 確認 する I2C アドレス

source: Returns
de: Rückgabewerte

source: True if the device responds, False otherwise
de: True, wenn das Gerät antwortet, andernfalls False
ja: デバイス が 応答 する 場合 は True 、 それ以外 は False

source: Return type
de: Rückgabetyp

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: # Define register address of QMC6310 compass sensor
de: # Definiere die Registeradresse des QMC6310-Kompasssensors
ja: # QMC6310 コンパス センサー の レジスタ アドレス を 定義

source: # Define the register parameter configuration of the sensor
de: # Definiere die Registerparameterkonfiguration des Sensors
ja: # センサー の レジスタ パラメータ 設定 を 定義

source: Read raw magnetometer data
de: Rohdaten des Magnetometers lesen
ja: 生 の 磁気 センサー データ を 読み取り ます

source: [x, y, z] raw magnetic field values
de: [x, y, z] rohe Magnetfeldwerte
ja: [x, y, z] の 生 磁場 値

source: Read magnetometer data in Gauss units (consistent with other magnetometer classes)
de: Magnetometerdaten in Gauss-Einheiten lesen ( konsistent mit anderen Magnetometer-Klassen )
ja: ガウス 単位 で 磁気 センサー データ を 読み取り ます ( 他 の 磁気 センサー クラス と 一貫 )

source: (x, y, z) magnetic field values in Gauss
de: (x, y, z) Magnetfeldwerte in Gauss
ja: (x, y, z) ガウス 単位 の 磁場 値

source: HMC5883L 3-axis magnetometer sensor driver class Used to measure Earth's magnetic field strength, suitable for direction detection and heading angle calculation
de: HMC5883L 3-Achsen-Magnetometersensor-Treiberklasse Zur Messung der Stärke des Magnetfeldes der Erde, geeignet für Richtungsbestimmung und Berechnung des Heading-Winkels
ja: HMC5883L 3 軸 磁気 センサー ドライバー クラス 。 地磁気 の 強さ を 測定 し 、 方位 検出 や 方位 角 計算 に 適して います

source: Read a signed 16-bit integer from the sensor
de: Einen vorzeichenbehafteten 16-Bit-Integer vom Sensor lesen
ja: センサー から 符号 付き 16 ビット 整数 を 読み取り ます

source: high-byte register address
de: High-Byte-Registeradresse
ja: 上位 バイト の レジスタ アドレス

source: converted signed 16-bit integer
de: Konvertierter vorzeichenbehafteter 16-Bit-Integer
ja: 変換 された 符号 付き 16 ビット 整数

source: Read magnetometer data
de: Magnetometerdaten lesen
ja: 磁気 センサー データ を 読み取り ます

source: X, Y, Z axis magnetic field strength values (unit: Gauss) Note: HMC5883L data register order is X, Z, Y
de: X-, Y-, Z-Achsen-Magnetfeldstärkewerte ( Einheit: Gauss ) Hinweis: Die Datenregisterreihenfolge des HMC5883L ist X, Z, Y
ja: X 、 Y 、 Z 軸 の 磁場 強度 値 ( 単位 : ガウス ) 。 注意 : HMC5883L の データ レジスタ 順序 は X 、 Z 、 Y です

source: QMC5883L 3-axis magnetometer sensor driver class Used to measure Earth's magnetic field strength, is a common alternative to HMC5883L
de: QMC5883L 3-Achsen-Magnetometersensor-Treiberklasse Zur Messung der Stärke des Magnetfeldes der Erde, ist eine gängige Alternative zum HMC5883L
ja: QMC5883L 3 軸 磁気 センサー ドライバー クラス 。 地磁気 の 強さ を 測定 し 、 HMC5883L の 一般的 な 代替 として 使用 され ます

source: Read a signed 16-bit integer from the sensor in little-endian format Note: QMC5883L uses little-endian format to store data
de: Einen vorzeichenbehafteten 16-Bit-Integer vom Sensor im Little-Endian-Format lesen Hinweis: QMC5883L verwendet das Little-Endian-Format zur Datenspeicherung
ja: リトル エンディアン 形式 で センサー から 符号 付き 16 ビット 整数 を 読み取り ます 。 注意 : QMC5883L は データ 保存 に リトル エンディアン 形式 を 使用 します

source: Low byte register address
de: Low-Byte-Registeradresse
ja: 下位 バイト の レジスタ アドレス

source: Converted signed 16-bit integer
de: Konvertierter vorzeichenbehafteter 16-Bit-Integer
ja: 変換 された 符号 付き 16 ビット 整数

source: X, Y, Z axis magnetic field strength values (unit: Gauss) Note: QMC5883L data register order is X, Y, Z (different from HMC5883L)
de: X-, Y-, Z-Achsen-Magnetfeldstärkewerte ( Einheit: Gauss ) Hinweis: Die Datenregisterreihenfolge des QMC5883L ist X, Y, Z ( unterschiedlich zum HMC5883L )
ja: X 、 Y 、 Z 軸 の 磁場 強度 値 ( 単位 : ガウス ) 。 注意 : QMC5883L の データ レジスタ 順序 は X 、 Y 、 Z ( HMC5883L と 異なり ます )

source: QMC5883P 3-axis magnetometer sensor driver class Another version of the QMC5883 series with I2C address 0x2C
de: QMC5883P 3-Achsen-Magnetometersensor-Treiberklasse Eine weitere Version der QMC5883-Serie mit der I2C-Adresse 0x2C
ja: QMC5883P 3 軸 磁気 センサー ドライバー クラス 。 I2C アドレス 0x2C を 持つ QMC5883 シリーズ の 別 バージョン です

source: Convert two bytes to a 16-bit signed integer
de: Zwei Bytes in einen vorzeichenbehafteten 16-Bit-Integer umwandeln
ja: 2 バイト を 16 ビット 符号 付き 整数 に 変換 します

source: Low byte value
de: Low-Byte-Wert
ja: 下位 バイト の 値

source: High byte value
de: High-Byte-Wert
ja: 上位 バイト の 値

source: Converted 16-bit signed integer
de: Konvertierter 16-Bit-Integer mit Vorzeichen
ja: 変換 された 16 ビット 符号 付き 整数

source: Read magnetometer data Reads 6 bytes starting from 0x01 register (little-endian signed format) Features: Returns zero on error, does not interrupt main loop
de: Magnetometerdaten lesen Liest 6 Bytes beginnend beim Register 0x01 ( Little-Endian-Vorzeichenformat ) Eigenschaften: Gibt bei Fehler Null zurück und unterbricht nicht die Hauptschleife
ja: 磁気 センサー データ を 読み取り ます 。 0x01 レジスタ から 開始 して 6 バイト を 読み取り ( リトル エンディアン 符号 付き 形式 ) 。 特徴 : エラー 時 は 0 を 返し 、 メイン ループ を 中断 し ません

source: X, Y, Z axis magnetic field strength values (unit: Gauss)
de: X-, Y-, Z-Achsen-Magnetfeldstärkewerte ( Einheit: Gauss )
ja: X 、 Y 、 Z 軸 の 磁場 強度 値 ( 単位 : ガウス )

source: Magnetometer sensor driver class Integrates QMC6310, HMC5883L, QMC5883L, and QMC5883P magnetometers
de: Magnetometersensor-Treiberklasse Integriert die Magnetometer QMC6310, HMC5883L, QMC5883L und QMC5883P
ja: 磁気 センサー ドライバー クラス 。 QMC6310 、 HMC5883L 、 QMC5883L 、 QMC5883P 磁気 センサー を 統合 します

source: (x, y, z) magnetic field values in appropriate units based on sensor type None: if no magnetometer is initialized
de: (x, y, z) Magnetfeldwerte in geeigneten Einheiten basierend auf dem Sensortyp None: wenn kein Magnetometer initialisiert ist
ja: (x, y, z) センサー 種別 に 応じた 適切 な 単位 の 磁場 値 。 初期化 された 磁気 センサー が 無い 場合 は None

source: Get the type of initialized magnetometer
de: Den Typ des initialisierten Magnetometers abrufen
ja: 初期化 された 磁気 センサー の 種類 を 取得 します

source: Magnetometer type
de: Magnetometertyp
ja: 磁気 センサー の 種類
