Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.user_button.po
Languages: de, ja

source: fusion\_hat.user\_button module
de: fusion\_hat.user\_button Modul
ja: fusion\_hat.user\_button モジュール

source: Bases: :py:class:`object`
de: Basisklassen: :py:class:`object`

source: User button class using evdev for Linux input events
de: Benutzerbutton-Klasse, die evdev für Linux-Eingabeereignisse verwendet
ja: Linux の 入力 イベント に evdev を 使用 する ユーザー ボタン クラス

source: Set the callback function when the user button is clicked
de: Die Callback-Funktion festlegen, wenn der Benutzerbutton geklickt wird
ja: ユーザー ボタン が クリック された とき の コールバック 関数 を 設定 します

source: Parameters
de: Parameter

source: callback function
de: Callback-Funktion
ja: コールバック 関数

source: Set the callback function when the user button is pressed
de: Die Callback-Funktion festlegen, wenn der Benutzerbutton gedrückt wird
ja: ユーザー ボタン が 押された とき の コールバック 関数 を 設定 します

source: Set the callback function when the user button is released
de: Die Callback-Funktion festlegen, wenn der Benutzerbutton losgelassen wird
ja: ユーザー ボタン が 離された とき の コールバック 関数 を 設定 します

source: Set the callback function when the user button is pressed and released
de: Die Callback-Funktion festlegen, wenn der Benutzerbutton gedrückt und wieder losgelassen wird
ja: ユーザー ボタン が 押されて から 離された とき の コールバック 関数 を 設定 します

source: [Deprecated] Set the callback function when the user button is pressed for a long time
de: [ VERALTET ] Die Callback-Funktion festlegen, wenn der Benutzerbutton lange gedrückt wird
ja: [非推奨] ユーザー ボタン が 長押し された とき の コールバック 関数 を 設定 します

source: [Deprecated] Set the callback function when the user button is pressed for a long time and released
de: [ VERALTET ] Die Callback-Funktion festlegen, wenn der Benutzerbutton lange gedrückt und anschließend losgelassen wird
ja: [非推奨] ユーザー ボタン が 長押し されて から 離された とき の コールバック 関数 を 設定 します

source: long press duration(2.0~5.0)
de: Dauer des langen Tastendrucks ( 2.0~5.0 )
ja: 長押し の 継続 時間 (2.0~5.0)

source: Find the Fusion HAT USR button device
de: Das Fusion HAT USR-Button-Gerät finden
ja: Fusion HAT の USR ボタン デバイス を 検出 します

source: Get the state of the user button
de: Den Status des Benutzerbuttons abrufen
ja: ユーザー ボタン の 状態 を 取得 します

source: Returns
de: Rückgabewerte

source: True if pressed, False if released
de: True, wenn gedrückt, False, wenn losgelassen
ja: 押されて いる 場合 は True、 離されて いる 場合 は False

source: Return type
de: Rückgabetyp

source: Check if the user button is pressed
de: Prüfen, ob der Benutzerbutton gedrückt ist
ja: ユーザー ボタン が 押されて いる か を 確認 します

source: Get the time the user button has been pressed for
de: Die Zeit abrufen, wie lange der Benutzerbutton gedrückt wurde
ja: ユーザー ボタン が 押されて いる 継続 時間 を 取得 します

source: time in seconds
de: Zeit in Sekunden
ja: 時間 (秒)

source: 设置事件监听器，在独立线程中处理输入事件
de: Ereignis-Listener einrichten und Eingabeereignisse in einem separaten Thread verarbeiten
ja: イベント リスナー を 設定 し、 独立 した スレッド で 入力 イベント を 処理 します

source: 此方法已弃用，不再需要调用
de: Diese Methode ist veraltet und muss nicht mehr aufgerufen werden
ja: この メソッド は 非推奨 であり、 呼び出す 必要 は ありません

source: 由于使用了Linux输入事件系统，按钮事件会自动被监听和处理，无需手动启动轮询循环。
de: Da das Linux-Eingabeereignissystem verwendet wird, werden Button-Ereignisse automatisch überwacht und verarbeitet, ohne dass die Polling-Schleife manuell gestartet werden muss.
ja: Linux の 入力 イベント システム を 使用 して いる ため、 ボタン イベント は 自動 的 に 監視 および 処理 され、 手動 で ポーリング ループ を 開始 する 必要 は ありません

source: 关闭按钮设备连接
de: Die Verbindung zum Button-Gerät schließen
ja: ボタン デバイス との 接続 を 閉じます
