Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.gy87.po
Languages: de, ja

source: fusion\_hat.modules.gy87 module
de: Modul fusion\_hat.modules.gy87
ja: fusion\_hat.modules.gy87 モジュール

source: Scan the I2C bus for all responding device addresses
de: Den I2C-Bus nach allen antwortenden Geräteadressen durchsuchen
ja: 応答する すべて の デバイス アドレス を 対象 に I2C バス を スキャン する

source: Parameters
de: Parameter

source: I2C bus number, defaults to I2C_BUS (1)
de: I2C-Busnummer, Standard ist I2C_BUS (1)
ja: I2C バス 番号 。 デフォルト は I2C_BUS ( 1 )

source: Returns
de: Rückgabe

source: list of all detected I2C device addresses
de: Liste aller erkannten I2C-Geräteadressen
ja: 検出 された すべて の I2C デバイス アドレス の リスト

source: Return type
de: Rückgabetyp

source: Calculate tilt-compensated heading: Use accelerometer data to calculate roll/pitch angles, then compensate magnetometer data
de: Neigungskompensierte Richtung berechnen: Beschleunigungsdaten werden zur Berechnung der Roll-/Nickwinkel verwendet, danach werden die Magnetometerdaten kompensiert
ja: 傾斜 補正 された 方位角 を 計算 する : 加速度 センサー の データ を 使用 して ロール / ピッチ 角 を 計算 し 、 その後 磁気 センサー の データ を 補正 する

source: Three-axis data from the magnetometer (Gauss)
de: Dreiachsige Daten vom Magnetometer (Gauss)
ja: 磁気 センサー から の 3 軸 データ ( ガウス )

source: Three-axis data from the accelerometer (g)
de: Dreiachsige Daten vom Beschleunigungssensor (g)
ja: 加速度 センサー から の 3 軸 データ ( g )

source: Magnetic declination (degrees), used to convert magnetic north to true north
de: Magnetische Deklination (Grad), wird verwendet, um magnetischen Norden in wahren Norden umzuwandeln
ja: 磁気 偏角 ( 度 ) 。 磁北 を 真北 に 変換 する ため に 使用 される

source: Compensated heading angle, range 0-360 degrees
de: Kompensierter Richtungswinkel, Bereich 0–360 Grad
ja: 補正 後 の 方位角 。 範囲 は 0 〜 360 度

source: Bases: :py:class:`object`
de: Basisklasse: :py:class:`object`

source: GY-87 sensor module main class Integrate MPU6050 (accelerometer + gyroscope), BMP180 (barometer), and magnetometer (support multiple models) Provide complete sensor data reading functionality, including self-recovery mechanism
de: Hauptklasse des GY-87-Sensormoduls. Integriert MPU6050 (Beschleunigungssensor + Gyroskop), BMP180 (Barometer) und Magnetometer (unterstützt mehrere Modelle) und stellt vollständige Funktionen zum Auslesen der Sensordaten bereit, einschließlich Selbstwiederherstellungsmechanismus
ja: GY-87 センサー モジュール の メイン クラス 。 MPU6050 ( 加速度 + ジャイロ ) 、 BMP180 ( 気圧 センサー ) 、 および 磁気 センサー ( 複数 モデル を サポート ) を 統合 し 、 自己 回復 メカニズム を 含む 完全 な センサー データ 読み取り 機能 を 提供 する

source: Read all sensor data Include automatic error handling and self-recovery mechanism to ensure system stability
de: Alle Sensordaten lesen. Beinhaltet automatische Fehlerbehandlung und Selbstwiederherstellungsmechanismus zur Sicherstellung der Systemstabilität
ja: すべて の センサー データ を 読み取る 。 システム の 安定性 を 確保 する ため に 、 自動 エラー 処理 および 自己 回復 メカニズム を 含む

source: Dictionary containing all sensor data {accel_g: (x,y,z), gyro_dps: (x,y,z), temp_mpu_c: float, temp_bmp_c: float, pressure_pa: float, altitude_m: float, mag_gauss: (x,y,z), heading_deg: float}
de: Wörterbuch mit allen Sensordaten {accel_g: (x,y,z), gyro_dps: (x,y,z), temp_mpu_c: float, temp_bmp_c: float, pressure_pa: float, altitude_m: float, mag_gauss: (x,y,z), heading_deg: float}
ja: すべて の センサー データ を 含む 辞書 {accel_g: (x, y, z), gyro_dps: (x, y, z), temp_mpu_c: float, temp_bmp_c: float, pressure_pa: float, altitude_m: float, mag_gauss: (x, y, z), heading_deg: float}

source: Dictionary containing all sensor data
de: Wörterbuch mit allen Sensordaten

source: GY-87 sensor module demo loop function
de: Demo-Schleifenfunktion des GY-87-Sensormoduls
ja: GY-87 センサー モジュール の デモ ループ 関数

source: Functions:
de: Funktionen:
ja: 機能 :

source: Scan and display connected I2C devices
de: Angeschlossene I2C-Geräte scannen und anzeigen
ja: 接続 されている I2C デバイス を スキャン して 表示 する

source: Initialize the GY87 sensor module
de: GY87-Sensormodul initialisieren
ja: GY87 センサー モジュール を 初期化 する

source: Continuously read and display all sensor data
de: Alle Sensordaten kontinuierlich lesen und anzeigen
ja: すべて の センサー データ を 継続 的 に 読み取り 表示 する

source: Adjust output format based on magnetometer presence
de: Ausgabeformat je nach Vorhandensein des Magnetometers anpassen
ja: 磁気 センサー の 有無 に 応じて 出力 フォーマット を 調整 する

source: Output format:
de: Ausgabeformat:
ja: 出力 フォーマット :

source: With magnetometer: displays acceleration, angular velocity, magnetic field strength, heading, temperature, pressure, and altitude
de: Mit Magnetometer: zeigt Beschleunigung, Winkelgeschwindigkeit, Magnetfeldstärke, Richtung, Temperatur, Druck und Höhe an
ja: 磁気 センサー あり : 加速度 、 角速度 、 磁場 強度 、 方位 、 温度 、 気圧 、 高度 を 表示 する

source: Without magnetometer: displays all data except magnetic field strength and heading
de: Ohne Magnetometer: zeigt alle Daten außer Magnetfeldstärke und Richtung an
ja: 磁気 センサー なし : 磁場 強度 と 方位 を 除く すべて の データ を 表示 する

source: Sampling frequency:
de: Abtastfrequenz:
ja: サンプリング 周波数 :

source: ~5 Hz (0.2 s pause after each read)
de: ~5 Hz (0,2 s Pause nach jedem Lesevorgang)
ja: 約 5 Hz ( 各 読み取り 後 に 0.2 秒 の 待機 )
