Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.motor.po
Languages: de, ja

source: fusion\_hat.motor module
de: fusion\_hat.motor Modul
ja: fusion\_hat.motor モジュール

source: This module provides a class for controlling motors on the Fusion Hat.
de: Dieses Modul stellt eine Klasse zur Steuerung von Motoren auf dem Fusion Hat bereit.
ja: この モジュール は Fusion Hat 上 の モーター を 制御 する ため の クラス を 提供 します 。

source: Example
de: Beispiel

source: Simple usage
de: Einfache Verwendung
ja: 簡単 な 使用 例

source: Change the direction of the motor.
de: Die Drehrichtung des Motors ändern.
ja: モーター の 回転 方向 を 変更 します 。

source: Spin the motor in the other direction.
de: Den Motor in die andere Richtung drehen.
ja: モーター を 反対 方向 に 回転 させます 。

source: Stop the motor
de: Den Motor stoppen
ja: モーター を 停止 します

source: Bases: :py:class:`~fusion_hat._base._Base`
de: Basisklassen: :py:class:`~fusion_hat._base._Base`

source: Motor class
de: Motorklasse
ja: モーター クラス

source: There are two ways to initialize a motor:
de: Es gibt zwei Möglichkeiten, einen Motor zu initialisieren:
ja: モーター を 初期化 する 方法 は 2 つ あります :

source: Method 1: Pass a motor name as a string.
de: Methode 1: Einen Motornamen als Zeichenkette übergeben.
ja: 方法 1 : モーター 名 を 文字列 として 渡します 。

source: Parameters
de: Parameter

source: Method 2: Pass two pwm pins as PWM objects.
de: Methode 2: Zwei PWM-Pins als PWM-Objekte übergeben.
ja: 方法 2 : 2 つ の PWM ピン を PWM オブジェクト として 渡します 。

source: Motor speed control pwm pin a
de: PWM-Pin A zur Steuerung der Motorgeschwindigkeit
ja: モーター 速度 制御 用 PWM ピン a

source: Motor speed control pwm pin b
de: PWM-Pin B zur Steuerung der Motorgeschwindigkeit
ja: モーター 速度 制御 用 PWM ピン b

source: Default PWM frequency
de: Standard-PWM-Frequenz
ja: デフォルト の PWM 周波数

source: Default maximum motor power
de: Standardmäßige maximale Motorleistung
ja: デフォルト の モーター 最大 出力

source: Default minimum motor power
de: Standardmäßige minimale Motorleistung
ja: デフォルト の モーター 最小 出力

source: [DEPRECATED] Get or set motor power
de: [ VERALTET ] Motorleistung abrufen oder einstellen
ja: [ 非推奨 ] モーター 出力 を 取得 または 設定 します

source: Motor power(-100.0~100.0). Defaults to None.
de: Motorleistung ( -100.0~100.0 ). Standard ist None.
ja: モーター 出力 ( -100.0 ~ 100.0 ) 。 デフォルト は None です 。

source: Get or set motor power
de: Motorleistung abrufen oder einstellen
ja: モーター 出力 を 取得 または 設定 します

source: Set motor is reversed or not
de: Festlegen, ob der Motor umgekehrt ist oder nicht
ja: モーター の 回転 方向 を 反転 する か どうか を 設定 します

source: True or False
de: True oder False
ja: True または False

source: Stop motor
de: Motor stoppen
ja: モーター を 停止 します

source: Motor
ja: モーター

source: Motor name
ja: モーター 名

source: Motor pins
ja: モーター ピン
