Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.compass.po
Languages: de, ja

source: fusion\_hat.modules.compass module
de: Modul fusion\_hat.modules.compass
ja: fusion\_hat.modules.compass モジュール

source: Bases: :py:class:`~fusion_hat.modules.magnetometer.Magnetometer`
de: Basisklasse: :py:class:`~fusion_hat.modules.magnetometer.Magnetometer`

source: Compass module for reading and calculating heading angles from magnetometer data.
de: Kompassmodul zum Lesen und Berechnen von Kurswinkeln aus Magnetometerdaten.
ja: 磁力計データから方位角を読み取り、計算するためのコンパスモジュールです。

source: This class extends the Magnetometer class to provide compass functionality that can be easily integrated into projects requiring heading information.
de: Diese Klasse erweitert die Magnetometerklasse, um Kompassfunktionen bereitzustellen, die sich leicht in Projekte integrieren lassen, die Kursinformationen benötigen.
ja: このクラスは Magnetometer クラスを拡張し、方位情報を必要とするプロジェクトに簡単に統合できるコンパス機能を提供します。

source: Public Methods:
de: Öffentliche Methoden:
ja: 公開メソッド:

source: read_raw(): Get raw magnetic field data read(): Get processed compass data including heading angle read_angle(): Get just the heading angle (with optional filtering) set_offset(): Calibrate the compass with offset values set_magnetic_declination(): Adjust for local magnetic declination clear_calibration(): Reset all calibration data
de: read_raw(): Rohdaten des Magnetfeldes abrufen read(): Verarbeitete Kompassdaten einschließlich Kurswinkel abrufen read_angle(): Nur den Kurswinkel abrufen (mit optionaler Filterung) set_offset(): Den Kompass mit Offset-Werten kalibrieren set_magnetic_declination(): An die lokale magnetische Deklination anpassen clear_calibration(): Alle Kalibrierungsdaten zurücksetzen
ja: read_raw(): 生の磁場データを取得します。 read(): 方位角を含む処理済みコンパスデータを取得します。 read_angle(): 方位角のみを取得します ( オプションでフィルタリング )。 set_offset(): オフセット値を用いてコンパスをキャリブレーションします。 set_magnetic_declination(): 地域の磁気偏角を調整します。 clear_calibration(): すべてのキャリブレーションデータをリセットします。

source: Read raw magnetometer data.
de: Rohdaten des Magnetometers lesen.
ja: 生の磁力計データを読み取ります。

source: Returns
de: Rückgabewert

source: Raw magnetic field data [x, y, z] in mGauss.
de: Rohdaten des Magnetfeldes [x, y, z] in mGauss.
ja: mGauss 単位の生の磁場データ [x, y, z] です。

source: Return type
de: Rückgabetyp

source: Convert magnetic declination from string format to numerical value.
de: Magnetische Deklination vom Zeichenkettenformat in einen Zahlenwert umwandeln.
ja: 磁気偏角を文字列形式から数値に変換します。

source: Parameters
de: Parameter

source: Magnetic declination in format "DD°MM'E" or "DD°MM'W".
de: Magnetische Deklination im Format "DD°MM'E" oder "DD°MM'W".
ja: "DD°MM'E" または "DD°MM'W" 形式の磁気偏角です。

source: Magnetic declination in degrees (positive for East, negative for West).
de: Magnetische Deklination in Grad (positiv für Osten, negativ für Westen).
ja: 度単位の磁気偏角です ( 東は正、 西は負 )。

source: Convert magnetic declination from numerical value to string format.
de: Magnetische Deklination von einem numerischen Wert in ein Zeichenkettenformat umwandeln.
ja: 磁気偏角を数値から文字列形式に変換します。

source: Read processed compass data.
de: Verarbeitete Kompassdaten lesen.
ja: 処理済みのコンパスデータを読み取ります。

source: Processed magnetic field data (x, y, z, angle) where: x, y, z are in mGauss after applying offsets, angle is the heading angle in degrees.
de: Verarbeitete Magnetfelddaten (x, y, z, Winkel), wobei: x, y, z nach Anwendung der Offsets in mGauss sind, der Winkel der Kurswinkel in Grad ist.
ja: 処理済み磁場データ ( x, y, z, angle ) です。 x, y, z はオフセット適用後の mGauss 値、 angle は度単位の方位角です。

source: Processed magnetic field data (x, y, z, angle) where:
de: Verarbeitete Magnetfelddaten (x, y, z, Winkel), wobei:

source: x, y, z are in mGauss after applying offsets, angle is the heading angle in degrees.
de: x, y, z nach Anwendung der Offsets in mGauss sind, der Winkel der Kurswinkel in Grad ist.

source: Read the current heading angle.
de: Den aktuellen Kurswinkel lesen.
ja: 現在の方位角を読み取ります。

source: Whether to apply moving average filter. Defaults to False.
de: Ob ein gleitender Mittelwertfilter angewendet werden soll. Standard ist False.
ja: 移動平均フィルタを適用するかどうかです。 デフォルトは False です。

source: Heading angle in degrees (0-360).
de: Kurswinkel in Grad (0–360).
ja: 度単位の方位角 ( 0–360 ) です。

source: Set calibration offsets for the magnetometer.
de: Kalibrierungs-Offsets für das Magnetometer einstellen.
ja: 磁力計のキャリブレーションオフセットを設定します。

source: Calibration offsets in mGauss. Format: [x_min, x_max, y_min, y_max, z_min, z_max].
de: Kalibrierungs-Offsets in mGauss. Format: [x_min, x_max, y_min, y_max, z_min, z_max].
ja: mGauss 単位のキャリブレーションオフセットです。 形式: [x_min, x_max, y_min, y_max, z_min, z_max]。

source: Reference:
de: Referenz:
ja: 参考:

source: Set magnetic declination.
de: Magnetische Deklination einstellen.
ja: 磁気偏角を設定します。

source: Magnetic declination. Can be either: - String format: "DD°MM'E" or "DD°MM'W" - Numeric format: Degrees (positive for East, negative for West)
de: Magnetische Deklination. Kann entweder sein: - Zeichenkettenformat: "DD°MM'E" oder "DD°MM'W" - Numerisches Format: Grad (positiv für Osten, negativ für Westen)
ja: 磁気偏角です。 以下のいずれかを指定できます。 - 文字列形式: "DD°MM'E" または "DD°MM'W" - 数値形式: 度 ( 東は正、 西は負 )

source: Clear all calibration data.
de: Alle Kalibrierungsdaten löschen.
ja: すべてのキャリブレーションデータをクリアします。

source: Resets all minimum/maximum values and offsets to zero.
de: Setzt alle Minimal- und Maximalwerte sowie Offsets auf Null zurück.
ja: すべての最小値 / 最大値およびオフセットをゼロにリセットします。
