Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.servo.po
Languages: de, ja

source: fusion\_hat.servo module
de: fusion\_hat.servo Modul
ja: fusion\_hat.servo モジュール

source: Servo motor class
de: Servomotor-Klasse
ja: サーボ モーター クラス

source: Example
de: Beispiel

source: Simple usage:
de: Einfache Verwendung:
ja: シンプル な 使い方 :

source: Change the angle range:
de: Den Winkelbereich ändern:
ja: 角度 範囲 を 変更 :

source: Add offset:
de: Offset hinzufügen:
ja: オフセット を 追加 :

source: Bases: :py:class:`~fusion_hat.pwm.PWM`
de: Basisklassen: :py:class:`~fusion_hat.pwm.PWM`

source: Parameters
de: Parameter

source: PWM channel number(0-14/P0-P14)
de: PWM-Kanalnummer ( 0–14 / P0–P14 )
ja: PWM チャンネル 番号 (0-14 / P0-P14)

source: offset value(-20.0~20.0), leave it None to use default offset, defaults to 0.0
de: Offset-Wert ( -20.0~20.0 ), None lassen, um den Standard-Offset zu verwenden, Standard ist 0.0
ja: オフセット 値 (-20.0~20.0) 。 None の 場合 は デフォルト の オフセット を 使用 。 デフォルト は 0.0

source: minimum angle(-90~90), leave it None to use default min angle, defaults to -90
de: Minimaler Winkel ( -90~90 ), None lassen, um den Standard-Minimalwinkel zu verwenden, Standard ist -90
ja: 最小 角度 (-90~90) 。 None の 場合 は デフォルト の 最小 角度 を 使用 。 デフォルト は -90

source: maximum angle(-90~90), leave it None to use default max angle, defaults to 90
de: Maximaler Winkel ( -90~90 ), None lassen, um den Standard-Maximalwinkel zu verwenden, Standard ist 90
ja: 最大 角度 (-90~90) 。 None の 場合 は デフォルト の 最大 角度 を 使用 。 デフォルト は 90

source: Pass to :class:`fusion_hat.pwm.PWM`
de: An :py:class:`fusion_hat.pwm.PWM` übergeben
ja: :class:`fusion_hat.pwm.PWM` に 渡す

source: Set the offset of the servo motor
de: Den Offset des Servomotors setzen
ja: サーボ モーター の オフセット を 設定 する

source: offset value(-20.0~20.0), leave it None to get the offset value, defaults to None
de: Offset-Wert ( -20.0~20.0 ), None lassen, um den Offset-Wert abzurufen, Standard ist None
ja: オフセット 値 (-20.0~20.0) 。 None の 場合 は オフセット 値 を 取得 。 デフォルト は None

source: Returns
de: Rückgabewerte

source: offset value(-20.0~20.0) if offset is None, else None
de: Offset-Wert ( -20.0~20.0 ), wenn offset None ist, sonst None
ja: offset が None の 場合 は オフセット 値 (-20.0~20.0) 、 それ 以外 は None

source: Return type
de: Rückgabetyp

source: Get or set the angle of the servo motor
de: Den Winkel des Servomotors abrufen oder setzen
ja: サーボ モーター の 角度 を 取得 または 設定 する

source: angle(-90~90), leave it None to get the angle value, defaults to None
de: Winkel ( -90~90 ), None lassen, um den Winkelwert abzurufen, Standard ist None
ja: 角度 (-90~90) 。 None の 場合 は 角度 値 を 取得 。 デフォルト は None

source: angle(-90~90) if angle is None, else None
de: Winkel ( -90~90 ), wenn angle None ist, sonst None
ja: angle が None の 場合 は 角度 (-90~90) 、 それ 以外 は None

source: Set the angle of the servo motor
de: Den Winkel des Servomotors setzen
ja: サーボ モーター の 角度 を 設定 する

source: angle(-90~90)
de: Winkel ( -90~90 )
ja: 角度 (-90~90)
