Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.grayscale_module.po
Languages: de, ja

source: fusion\_hat.modules.grayscale\_module module
de: Modul fusion\_hat.modules.grayscale\_module
ja: fusion\_hat.modules.grayscale\_module モジュール

source: Bases: :py:class:`object`
de: Basisklasse: :py:class:`object`

source: 3 channel Grayscale Module
de: 3-Kanal-Graustufenmodul
ja: 3 チャンネル グレースケール モジュール

source: Left Channel
de: Linker Kanal
ja: 左チャンネル

source: Middle Channel
de: Mittlerer Kanal
ja: 中央チャンネル

source: Right Channel
de: Rechter Kanal
ja: 右チャンネル

source: Get Set reference value
de: Referenzwert abrufen oder setzen
ja: 基準値 を 取得 / 設定 する

source: Parameters
de: Parameter

source: reference value, None to get reference value
de: Referenzwert, None um den Referenzwert abzurufen
ja: 基準値 。 None の場合は 基準値 を 取得 する

source: Returns
de: Rückgabe

source: reference value
de: Referenzwert
ja: 基準値

source: Return type
de: Rückgabetyp

source: Read line status
de: Linienstatus lesen
ja: ライン 状態 を 読み取る

source: list of grayscale datas, if None, read from sensor
de: Liste der Graustufendaten, None liest vom Sensor
ja: グレースケール データ の リスト 。 None の場合は センサー から 読み取る

source: list of line status, 0 for white, 1 for black
de: Liste der Linienzustände, 0 für Weiß, 1 für Schwarz
ja: ライン 状態 の リスト 。 0 は 白 、 1 は 黒

source: read a channel or all datas
de: Einen Kanal oder alle Daten lesen
ja: 単一 チャンネル または 全 データ を 読み取る

source: channel to read, leave empty to read all. 0, 1, 2 or Grayscale_Module.LEFT, Grayscale_Module.CENTER, Grayscale_Module.RIGHT
de: zu lesender Kanal, leer lassen um alle zu lesen. 0 , 1 , 2 oder Grayscale_Module.LEFT , Grayscale_Module.CENTER , Grayscale_Module.RIGHT
ja: 読み取る チャンネル 。 省略 すると 全て を 読み取る 。 0 、 1 、 2 または Grayscale_Module.LEFT 、 Grayscale_Module.CENTER 、 Grayscale_Module.RIGHT

source: list of grayscale data
de: Liste der Graustufendaten
ja: グレースケール データ の リスト

source: Line Tracker
de: Linienverfolger
ja: ライントラッカー

source: Read a channel
de: Einen Kanal lesen
ja: チャンネル を 読み取る

source: channel to read, 0, 1, 2 or Grayscale_Module.LEFT, Grayscale_Module.CENTER, Grayscale_Module.RIGHT
de: zu lesender Kanal, 0 , 1 , 2 oder Grayscale_Module.LEFT , Grayscale_Module.CENTER , Grayscale_Module.RIGHT
ja: 読み取る チャンネル 。 0 、 1 、 2 または Grayscale_Module.LEFT 、 Grayscale_Module.CENTER 、 Grayscale_Module.RIGHT

source: if True, return raw data, False to return calibrated data
de: wenn True , Rohdaten zurückgeben, False für kalibrierte Daten
ja: True の場合は 生 データ を 返す 。 False の場合は 補正 済み データ を 返す

source: grayscale data
de: Graustufendaten
ja: グレースケール データ

source: Calibrate grayscale data :param data: list of grayscale data :type data: list
de: Graustufendaten kalibrieren :param data: Liste der Graustufendaten :type data: list
ja: グレースケール データ を キャリブレーション する :param data: グレースケール データ の リスト :type data: list

source: list of calibrated grayscale data
de: Liste der kalibrierten Graustufendaten
ja: キャリブレーション 済み グレースケール データ の リスト

source: Check if robot is on cliff
de: Prüfen ob sich der Roboter an einer Klippe befindet
ja: ロボット が 崖 の 上 に いる か を 確認 する

source: list of grayscale data, leave empty to read from sensor
de: Liste der Graustufendaten, leer lassen um vom Sensor zu lesen
ja: グレースケール データ の リスト 。 省略 すると センサー から 読み取る

source: True if robot is on cliff, False otherwise
de: True wenn sich der Roboter an einer Klippe befindet, sonst False
ja: ロボット が 崖 の 上 に いる 場合は True 、 それ以外は False

source: Get line position
de: Linienposition abrufen
ja: ライン の 位置 を 取得 する

source: line position, -1 for left, 0 for center, 1 for right
de: Linienposition, -1 für links, 0 für Mitte, 1 für rechts
ja: ライン の 位置 。 -1 は 左 、 0 は 中央 、 1 は 右

source: Check if robot is on line
de: Prüfen ob sich der Roboter auf der Linie befindet
ja: ロボット が ライン 上 に いる か を 確認 する

source: True if robot is on line, False otherwise
de: True wenn sich der Roboter auf der Linie befindet, sonst False
ja: ロボット が ライン 上 に いる 場合は True 、 それ以外は False

source: Set calibration data :param slopes: list of slopes :type slopes: list :param offsets: list of offsets :type offsets: list
de: Kalibrierdaten setzen :param slopes: Liste der Steigungen :type slopes: list :param offsets: Liste der Offsets :type offsets: list
ja: キャリブレーション データ を 設定 する :param slopes: 傾き の リスト :type slopes: list :param offsets: オフセット の リスト :type offsets: list

source: Set cliff threshold :param threshold: cliff threshold :type threshold: int
de: Klippen-Schwellenwert setzen :param threshold: Klippen-Schwellenwert :type threshold: int
ja: 崖 判定 の しきい値 を 設定 する :param threshold: 崖 の しきい値 :type threshold: int

source: Get calibration data :returns: tuple of slopes and offsets :rtype: tuple
de: Kalibrierdaten abrufen :returns: Tupel aus Steigungen und Offsets :rtype: tuple
ja: キャリブレーション データ を 取得 する :returns: 傾き と オフセット の タプル :rtype: tuple

source: Calibrate line tracker :param light_data: list of light data :type light_data: list :param dark_data: list of dark data :type dark_data: list
de: Linienverfolger kalibrieren :param light_data: Liste der Hell-Daten :type light_data: list :param dark_data: Liste der Dunkel-Daten :type dark_data: list
ja: ライントラッカー を キャリブレーション する :param light_data: 明るい データ の リスト :type light_data: list :param dark_data: 暗い データ の リスト :type dark_data: list

source: Update the line background value
de: Hintergrundwert der Linie aktualisieren
ja: ライン 背景 の 値 を 更新 する

source: Update the line reference value
de: Referenzwert der Linie aktualisieren
ja: ライン 基準値 を 更新 する
