Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat._utils.po
Languages: de, ja

source: fusion\_hat.\_utils module
de: Modul fusion\_hat.\_utils
ja: fusion\_hat.\_utils モジュール

source: Retry decorator retry specified times if any error occurs
de: Retry-Dekorator, der bei Auftreten eines Fehlers die angegebene Anzahl von Wiederholungen ausführt
ja: エラーが発生した場合に、指定した回数だけ再試行するためのデコレータ

source: Parameters
de: Parameter

source: number of times to retry. Defaults to 5.
de: Anzahl der Wiederholungen. Standard ist 5.
ja: 再試行回数。デフォルトは 5 です。

source: Returns
de: Rückgabewerte

source: wrapper function
de: Wrapper-Funktion
ja: ラッパー関数

source: Return type
de: Rückgabetyp

source: Check if command exists
de: Prüft, ob ein Befehl existiert
ja: コマンドが存在するかを確認します

source: command to check
de: Zu prüfender Befehl
ja: 確認するコマンド

source: True if exists
de: True, wenn er existiert
ja: 存在する場合は True

source: Run command and return status and output
de: Führt einen Befehl aus und gibt Status und Ausgabe zurück
ja: コマンドを実行し、ステータスと出力を返します

source: command to run
de: Auszuführender Befehl
ja: 実行するコマンド

source: status, output
de: Status, Ausgabe
ja: ステータス、出力

source: Check if command is installed
de: Prüft, ob ein Befehl installiert ist
ja: コマンドがインストールされているかを確認します

source: True if installed
de: True, wenn installiert
ja: インストールされている場合は True

source: Map value from one range to another range
de: Ordnet einen Wert von einem Bereich einem anderen Bereich zu
ja: 値をある範囲から別の範囲へマッピングします

source: value to map
de: Zu zuordnender Wert
ja: マッピングする値

source: input minimum
de: Eingangs-Minimum
ja: 入力の最小値

source: input maximum
de: Eingangs-Maximum
ja: 入力の最大値

source: output minimum
de: Ausgangs-Minimum
ja: 出力の最小値

source: output maximum
de: Ausgangs-Maximum
ja: 出力の最大値

source: mapped value
de: Zugeordneter Wert
ja: マッピング後の値

source: Get IP address
de: IP-Adresse abrufen
ja: IP アドレスを取得します

source: interfaces to check, defaults to ['wlan0', 'eth0']
de: Zu prüfende Schnittstellen, Standard ist ['wlan0', 'eth0']
ja: 確認するインターフェース。デフォルトは ['wlan0', 'eth0'] です。

source: IP address or False if not found
de: IP-Adresse oder False, wenn nicht gefunden
ja: IP アドレス。見つからない場合は False

source: Get username
de: Benutzernamen abrufen
ja: ユーザー名を取得します

source: username
de: Benutzername
ja: ユーザー名

source: Constrain value to a range
de: Begrenzt einen Wert auf einen Bereich
ja: 値を指定した範囲内に制限します

source: value to constrain
de: Zu begrenzender Wert
ja: 制限する値

source: minimum value
de: Minimalwert
ja: 最小値

source: maximum value
de: Maximalwert
ja: 最大値

source: constrained value
de: Begrenzter Wert
ja: 制限後の値
