Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.battery.po
Languages: de, ja

source: fusion\_hat.battery module
de: Modul fusion\_hat.battery
ja: fusion\_hat.battery モジュール

source: Battery class
de: Batterieklasse
ja: Battery クラス

source: Read battery data from upower
de: Batteriedaten von upower lesen
ja: upower からバッテリー情報を読み取ります

source: Example
de: Beispiel

source: Bases: :py:class:`~fusion_hat._base._Base`
de: Basisklassen: :py:class:`~fusion_hat._base._Base`

source: Parameters
de: Parameter

source: pass to :class:`fusion_hat._base._base`
de: Wird an :class:`fusion_hat._base._base` übergeben
ja: :class:`fusion_hat._base._base` に渡されます

source: check if battery is present
de: Prüfen, ob eine Batterie vorhanden ist
ja: バッテリーが存在するかを確認します

source: Returns
de: Rückgabewert

source: True if battery is present, False otherwise
de: True, wenn eine Batterie vorhanden ist, sonst False
ja: バッテリーが存在する場合は True、そうでない場合は False

source: Return type
de: Rückgabetyp

source: check if battery is online
de: Prüfen, ob die Batterie online ist
ja: バッテリーがオンラインかどうかを確認します

source: True if battery is online, False otherwise
de: True, wenn die Batterie online ist, sonst False
ja: バッテリーがオンラインの場合は True、そうでない場合は False

source: get battery status
de: Batteriestatus abrufen
ja: バッテリーの状態を取得します

source: battery status
de: Batteriestatus
ja: バッテリーの状態

source: get battery capacity
de: Batteriekapazität abrufen
ja: バッテリー容量を取得します

source: battery capacity in percent
de: Batteriekapazität in Prozent
ja: バッテリー容量（パーセント）

source: get battery voltage
de: Batteriespannung abrufen
ja: バッテリー電圧を取得します

source: battery voltage in V
de: Batteriespannung in V
ja: バッテリー電圧（V）

source: get battery model name
de: Batteriemodellname abrufen
ja: バッテリーのモデル名を取得します

source: battery model name
de: Batteriemodellname
ja: バッテリーのモデル名

source: check if battery is charging
de: Prüfen, ob die Batterie geladen wird
ja: バッテリーが充電中かどうかを確認します

source: True if battery is charging, False otherwise
de: True, wenn die Batterie geladen wird, sonst False
ja: バッテリーが充電中の場合は True、そうでない場合は False

source: get battery manufacturer
de: Batteriehersteller abrufen
ja: バッテリーの製造元を取得します

source: battery manufacturer
de: Batteriehersteller
ja: バッテリーの製造元

source: get battery info
de: Batterieinformationen abrufen
ja: バッテリー情報を取得します

source: battery info
de: Batterieinformationen
ja: バッテリー情報
