Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat.modules.bmp180.po
Languages: de, ja

source: fusion\_hat.modules.bmp180 module
de: Modul fusion\_hat.modules.bmp180
ja: fusion\_hat.modules.bmp180 モジュール

source: Bases: :py:class:`object`
de: Basisklasse: :py:class:`object`

source: BMP180 pressure/temperature sensor driver class Used to measure atmospheric pressure and temperature, and can calculate altitude This is a concise implementation version that uses floating-point calculations to improve accuracy
de: BMP180 Druck- / Temperatur-Sensor-Treiberklasse Wird verwendet, um atmosphärischen Druck und Temperatur zu messen und kann die Höhe berechnen Dies ist eine kompakte Implementierung, die Gleitkomma-Berechnungen verwendet, um die Genauigkeit zu verbessern
ja: BMP180 気圧 / 温度センサーのドライバークラスです。 大気圧および温度の測定に使用でき、さらに高度を計算できます。 本実装は、精度向上のために浮動小数点計算を使用した簡潔な実装バージョンです

source: Read a signed 16-bit integer from the specified register
de: Liest eine vorzeichenbehaftete 16-Bit-Ganzzahl aus dem angegebenen Register
ja: 指定したレジスタから符号付き 16 ビット整数を読み取ります

source: Parameters
de: Parameter

source: register address
de: Registeradresse
ja: レジスタアドレス

source: Returns
de: Rückgabe

source: converted signed 16-bit integer value
de: konvertierter vorzeichenbehafteter 16-Bit-Ganzzahlwert
ja: 変換後の符号付き 16 ビット整数値

source: Return type
de: Rückgabetyp

source: Read an unsigned 16-bit integer from the specified register
de: Liest eine vorzeichenlose 16-Bit-Ganzzahl aus dem angegebenen Register
ja: 指定したレジスタから符号なし 16 ビット整数を読み取ります

source: converted unsigned 16-bit integer value
de: konvertierter vorzeichenloser 16-Bit-Ganzzahlwert
ja: 変換後の符号なし 16 ビット整数値

source: Read calibration parameters of the sensor Each BMP180 chip has unique calibration parameters stored in internal EEPROM These parameters are used to compensate for individual differences of the sensor
de: Kalibrierungsparameter des Sensors lesen Jeder BMP180-Chip besitzt einzigartige Kalibrierungsparameter, die im internen EEPROM gespeichert sind Diese Parameter werden verwendet, um individuelle Unterschiede des Sensors zu kompensieren
ja: センサーのキャリブレーションパラメータを読み取ります。 各 BMP180 チップには、内部 EEPROM に固有のキャリブレーションパラメータが保存されています。 これらのパラメータは、センサー個体差を補正するために使用されます

source: Read raw temperature value Trigger temperature conversion and wait for completion, then read the result
de: Rohen Temperaturwert lesen Temperaturmessung auslösen und auf Abschluss warten, dann das Ergebnis lesen
ja: 生の温度値を読み取ります。 温度変換をトリガーし、完了を待ってから結果を読み取ります

source: raw temperature value (16-bit unsigned integer)
de: roher Temperaturwert ( 16-Bit-vorzeichenlose Ganzzahl )
ja: 生の温度値 ( 16 ビット符号なし整数 )

source: Read raw pressure value Trigger pressure conversion and wait for completion, then read the result
de: Rohen Druckwert lesen Druckmessung auslösen und auf Abschluss warten, dann das Ergebnis lesen
ja: 生の気圧値を読み取ります。 気圧変換をトリガーし、完了を待ってから結果を読み取ります

source: raw pressure value (16-bit unsigned integer)
de: roher Druckwert ( 16-Bit-vorzeichenlose Ganzzahl )
ja: 生の気圧値 ( 16 ビット符号なし整数 )

source: Read and calculate temperature, pressure, and altitude Use standard formulas provided in BMP180 datasheet
de: Temperatur, Druck und Höhe lesen und berechnen Standardformeln aus dem BMP180-Datenblatt verwenden
ja: 温度、気圧、高度を読み取り計算します。 BMP180 データシートに記載されている標準的な計算式を使用します

source: (temperature(°C), pressure(Pa), altitude(m))
de: ( Temperatur ( °C ) , Druck ( Pa ) , Höhe ( m ) )
ja: ( 温度 ( °C )、 気圧 ( Pa )、 高度 ( m ) )
