Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/api/fusion_hat._i2c.po
Languages: de, ja

source: fusion\_hat.\_i2c module
de: Modul fusion\_hat.\_i2c
ja: fusion\_hat.\_i2c モジュール

source: I2C bus read/write functions
de: Lese- und Schreibfunktionen für den I2C-Bus
ja: I2C バスの読み書き関数

source: A simple wrap for smbus2 library.
de: Eine einfache Hülle für die smbus2-Bibliothek.
ja: smbus2 ライブラリのシンプルなラッパーです。

source: Example
de: Beispiel

source: Init I2C bus with address 0x17
de: Initialisiert den I2C-Bus mit der Adresse 0x17
ja: アドレス 0x17 で I2C バスを初期化

source: Write a byte 0x00
de: Schreibt ein Byte 0x00
ja: 1 バイト 0x00 を書き込み

source: Write a byte 0x01 to register 0x01
de: Schreibt ein Byte 0x01 in das Register 0x01
ja: レジスタ 0x01 に 1 バイト 0x01 を書き込み

source: Write a word 0x0001 to register 0x01
de: Schreibt ein Wort 0x0001 in das Register 0x01
ja: レジスタ 0x01 に ワード 0x0001 を書き込み

source: Write a word 0x0001 to register 0x01 in LSB first
de: Schreibt ein Wort 0x0001 in das Register 0x01 mit LSB zuerst
ja: LSB ファーストで レジスタ 0x01 に ワード 0x0001 を書き込み

source: Write a block of bytes to register 0x01
de: Schreibt einen Block von Bytes in das Register 0x01
ja: レジスタ 0x01 に バイト列（ブロック）を書き込み

source: Read a byte
de: Liest ein Byte
ja: 1 バイトを読み取り

source: Read a byte from register 0x01
de: Liest ein Byte aus dem Register 0x01
ja: レジスタ 0x01 から 1 バイトを読み取り

source: Read a word from register 0x01
de: Liest ein Wort aus dem Register 0x01
ja: レジスタ 0x01 から ワードを読み取り

source: Read a word from register 0x01 in LSB first
de: Liest ein Wort aus dem Register 0x01 mit LSB zuerst
ja: LSB ファーストで レジスタ 0x01 から ワードを読み取り

source: Read a block of bytes from register 0x01
de: Liest einen Block von Bytes aus dem Register 0x01
ja: レジスタ 0x01 から バイト列（ブロック）を読み取り

source: Bases: :py:class:`~fusion_hat._base._Base`
de: Basisklassen: :py:class:`~fusion_hat._base._Base`

source: Parameters
de: Parameter

source: I2C device address
de: I2C-Geräteadresse
ja: I2C デバイスアドレス

source: I2C bus number
de: I2C-Busnummer
ja: I2C バス番号

source: Parameters to pass to :class:`fusion_hat._base._Base`.
de: Parameter, die an :class:`fusion_hat._base._Base` übergeben werden.
ja: :class:`fusion_hat._base._Base` に渡すパラメータ。

source: Keyword arguments to pass to :class:`fusion_hat._base._Base`.
de: Schlüsselwortargumente, die an :class:`fusion_hat._base._Base` übergeben werden.
ja: :class:`fusion_hat._base._Base` に渡すキーワード引数。

source: Scan the I2C bus for devices
de: Scannt den I2C-Bus nach Geräten
ja: I2C バス上のデバイスをスキャンします

source: I2C bus number, default is 1
de: I2C-Busnummer, Standard ist 1
ja: I2C バス番号。デフォルトは 1 です

source: True if force to access the I2C bus, False otherwise, default is False
de: True, wenn der Zugriff auf den I2C-Bus erzwungen wird, andernfalls False, Standard ist False
ja: I2C バスへの強制アクセスを行う場合は True、それ以外は False。デフォルトは False です

source: Returns
de: Rückgabe

source: List of I2C addresses of devices found
de: Liste der I2C-Adressen der gefundenen Geräte
ja: 検出されたデバイスの I2C アドレスの一覧

source: Return type
de: Rückgabetyp

source: Write data to the I2C device
de: Schreibt Daten an das I2C-Gerät
ja: I2C デバイスにデータを書き込みます

source: Data to write
de: Zu schreibende Daten
ja: 書き込むデータ

source: Raises
de: Löst aus

source: if write is not an int, list or bytearray
de: wenn write kein int, keine Liste oder kein Bytearray ist
ja: 書き込みデータが int、list、または bytearray でない場合

source: Read data from I2C device
de: Liest Daten vom I2C-Gerät
ja: I2C デバイスからデータを読み取ります

source: Number of bytes to receive
de: Anzahl der zu empfangenden Bytes
ja: 受信するバイト数

source: Received data
de: Empfangene Daten
ja: 受信したデータ

source: Write data to specific register address
de: Schreibt Daten an eine bestimmte Registeradresse
ja: 特定のレジスタアドレスにデータを書き込みます

source: Data to send
de: Zu sendende Daten
ja: 送信するデータ

source: Register address
de: Registeradresse
ja: レジスタアドレス

source: If data is not int, list, or bytearray
de: Wenn die Daten kein int, keine Liste oder kein Bytearray sind
ja: データが int、list、または bytearray でない場合

source: Read data from specific register address
de: Liest Daten von einer bestimmten Registeradresse
ja: 特定のレジスタアドレスからデータを読み取ります

source: Received bytearray data or False if error
de: Empfangene Bytearray-Daten oder False bei Fehler
ja: 受信した bytearray データ、またはエラー時は False

source: Check if the I2C device is avaliable
de: Prüft, ob das I2C-Gerät verfügbar ist
ja: I2C デバイスが利用可能かどうかを確認します

source: True if the I2C device is avaliable, False otherwise
de: True, wenn das I2C-Gerät verfügbar ist, andernfalls False
ja: I2C デバイスが利用可能な場合は True、それ以外は False

source: [DEPRECATED] Write a byte to I2C register
de: [DEPRECATED] Schreibt ein Byte in ein I2C-Register
ja: [非推奨] I2C レジスタに 1 バイトを書き込みます

source: [DEPRECATED] Write a byte data to I2C register
de: [DEPRECATED] Schreibt ein Byte-Datum in ein I2C-Register
ja: [非推奨] I2C レジスタに バイトデータを書き込みます

source: [DEPRECATED] Write word data to I2C register
de: [DEPRECATED] Schreibt Wortdaten in ein I2C-Register
ja: [非推奨] I2C レジスタに ワードデータを書き込みます

source: [DEPRECATED] Write block data to I2C register
de: [DEPRECATED] Schreibt Blockdaten in ein I2C-Register
ja: [非推奨] I2C レジスタに ブロックデータを書き込みます

source: [DEPRECATED] Read a byte from the I2C bus
de: [DEPRECATED] Liest ein Byte vom I2C-Bus
ja: [非推奨] I2C バスから 1 バイトを読み取ります

source: byte read from the I2C bus
de: vom I2C-Bus gelesenes Byte
ja: I2C バスから読み取ったバイト

source: register address
de: Registeradresse
ja: レジスタアドレス

source: [DEPRECATED] Read a word from the I2C bus
de: [DEPRECATED] Liest ein Wort vom I2C-Bus
ja: [非推奨] I2C バスから ワードを読み取ります

source: word read from the I2C bus
de: vom I2C-Bus gelesenes Wort
ja: I2C バスから読み取ったワード

source: [DEPRECATED] Read block data from I2C register
de: [DEPRECATED] Liest Blockdaten aus einem I2C-Register
ja: [非推奨] I2C レジスタから ブロックデータを読み取ります

source: import I2C
ja: I2C をインポート
