Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/faq.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Genieße exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: Q1: Can the battery be connected while providing power to the Raspberry Pi at the same time?
de: Q1: Kann der Akku angeschlossen sein, während gleichzeitig der Raspberry Pi mit Strom versorgt wird?

source: A: Yes, the Fusion HAT+ has a built-in anti-backflow diode that prevents the Raspberry Pi's power from flowing back into the Fusion HAT.
de: A: Ja, der Fusion HAT+ verfügt über eine integrierte Rückstromschutzdiode, die verhindert, dass die Stromversorgung des Raspberry Pi zurück in den Fusion HAT fließt.

source: Q2: Can the Fusion HAT+ be used while charging?
de: Q2: Kann der Fusion HAT+ während des Ladevorgangs verwendet werden?

source: A: Yes, the Fusion HAT+ can be used while charging. When charging, the input power is boosted by the charging chip to charge the batteries, while also providing power to the DC-DC step-down for external use. The charging power is approximately 10W. If the external power consumption is too high for an extended period, the batteries may supplement the power, similar to how a mobile phone charges while in use. However, it is important to be mindful of the battery's capacity to avoid draining it completely during simultaneous charging and usage.
de: A: Ja, der Fusion HAT+ kann während des Ladevorgangs verwendet werden. Beim Laden wird die Eingangsspannung vom Ladechip erhöht, um die Akkus zu laden und gleichzeitig den DC-DC-Abwärtswandler für den externen Gebrauch mit Strom zu versorgen. Die Ladeleistung beträgt etwa 10 W. Wenn der externe Stromverbrauch über einen längeren Zeitraum zu hoch ist, können die Akkus die Versorgung ergänzen, ähnlich wie bei einem Mobiltelefon, das während der Nutzung geladen wird. Es ist jedoch wichtig, die Akkukapazität im Blick zu behalten, um ein vollständiges Entladen während gleichzeitigen Ladens und Betriebs zu vermeiden.

source: Q3: Why is there no sound from the speaker?
de: Q3: Warum kommt kein Ton aus dem Lautsprecher?

source: When your script is running but the speaker is not producing sound, there could be several reasons:
de: Wenn dein Skript läuft, der Lautsprecher aber keinen Ton ausgibt, kann es mehrere Gründe geben:

source: Check if the ``i2samp.sh`` script has been installed. For detailed instructions, please refer to: :ref:`install_fusion_hat`.
de: Überprüfe, ob das Skript ``i2samp.sh`` installiert wurde. Ausführliche Anweisungen findest du unter: :ref:`install_fusion_hat`.

source: When running scripts related to speakers, it's necessary to add ``sudo`` to obtain administrative privileges. For example, ``sudo python3 tts.py``.
de: Beim Ausführen von lautsprecherbezogenen Skripten ist es notwendig, ``sudo`` hinzuzufügen, um Administratorrechte zu erhalten. Zum Beispiel ``sudo python3 tts.py``.

source: Don't using Raspberry Pi's built-in programming tools, like Geany to run Speaker-related scripts. These tools run with standard user privileges, while hardware control, such as managing speakers, often requires higher permissions.
de: Verwende nicht die integrierten Programmierwerkzeuge des Raspberry Pi wie Geany, um lautsprecherbezogene Skripte auszuführen. Diese Werkzeuge laufen mit normalen Benutzerrechten, während die Hardwaresteuerung, wie z. B. die Verwaltung von Lautsprechern, oft höhere Berechtigungen erfordert.
