Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: de

source: About this HAT
de: Über dieses HAT

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Experten-Support**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitig Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Genieße exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke [|link_sf_facebook|] und tritt noch heute bei!

source: **Welcome to the Fusion HAT+ Documentation**
de: **Willkommen zur Fusion HAT+ Dokumentation**

source: The **Fusion HAT+** is a powerful and developer-friendly expansion board designed to unlock the full potential of the Raspberry Pi in robotics and automation projects. Whether you're an educator, maker, or professional developer, Fusion HAT+ provides the essential hardware foundation to rapidly build smart, interactive robots—from autonomous vehicles to voice-controlled assistants.
de: Der **Fusion HAT+** ist eine leistungsstarke und entwicklerfreundliche Erweiterungsplatine, die entwickelt wurde, um das volle Potenzial des Raspberry Pi in Robotik- und Automatisierungsprojekten zu erschließen. Egal, ob du Lehrer, Maker oder professioneller Entwickler bist, der Fusion HAT+ bietet die wesentliche Hardwarebasis, um schnell intelligente, interaktive Roboter zu bauen – von autonomen Fahrzeugen bis hin zu sprachgesteuerten Assistenten.

source: This board features an onboard MCU, extending the Raspberry Pi’s capabilities with additional PWM outputs and ADC inputs. Integrated motor drivers, audio modules, and user-friendly debugging features make development smoother and more efficient. From basic motion control to advanced voice interaction, Fusion HAT+ grows with your project needs.
de: Diese Platine verfügt über einen integrierten MCU, der die Fähigkeiten des Raspberry Pi durch zusätzliche PWM-Ausgänge und ADC-Eingänge erweitert. Integrierte Motortreiber, Audiomodule und benutzerfreundliche Debugging-Funktionen machen die Entwicklung reibungsloser und effizienter. Von einfacher Bewegungssteuerung bis hin zu fortgeschrittener Sprachinteraktion wächst der Fusion HAT+ mit den Anforderungen deines Projekts.

source: **Key Features**
de: **Hauptmerkmale**

source: **Microcontroller-based control** for enhanced PWM/ADC support
de: **Mikrocontroller-basierte Steuerung** für erweiterte PWM/ADC-Unterstützung

source: **Motor drivers** for flexible mobility
de: **Motortreiber** für flexible Mobilität

source: **Built-in I2S audio** and mono speaker for sound interaction
de: **Integriertes I2S-Audio** und Mono-Lautsprecher für Klanginteraktion

source: **Customizable I/O interfaces** for easy sensor and actuator integration
de: **Anpassbare I/O-Schnittstellen** für eine einfache Integration von Sensoren und Aktoren

source: **Smart power design** with status LEDs, user button, and expansion-ready layout
de: **Intelligentes Stromversorgungsdesign** mit Status-LEDs, Benutzer-Taste und erweiterungsbereitem Layout

source: Onboard **microphone** for voice recognition and audio input
de: Integriertes **Mikrofon** für Spracherkennung und Audioeingang

source: Dedicated **ZERO button** for fast servo alignment
de: Dedizierte **ZERO-Taste** für eine schnelle Servo-Ausrichtung

source: Enhanced hardware stability and usability
de: Verbesserte Hardware-Stabilität und Benutzerfreundlichkeit

source: **Copyright Notice**
de: **Urheberrechtshinweis**

source: All contents including but not limited to texts, images, and code in this manual are owned by the SunFounder Company. You should only use it for personal study,investigation, enjoyment, or other non-commercial or nonprofit purposes, under therelated regulations and copyrights laws, without infringing the legal rights of the author and relevant right holders. For any individual or organization that uses these for commercial profit without permission, the Company reserves the right to take legal action.
de: Alle Inhalte dieses Handbuchs, einschließlich, aber nicht beschränkt auf Texte, Bilder und Code, sind Eigentum der Firma SunFounder. Du darfst sie nur für persönliches Studium, Recherche, Vergnügen oder andere nicht-kommerzielle oder gemeinnützige Zwecke gemäß den entsprechenden Vorschriften und Urheberrechtsgesetzen verwenden, ohne die gesetzlichen Rechte des Autors und der relevanten Rechteinhaber zu verletzen. Für jede Person oder Organisation, die diese ohne Genehmigung zu kommerziellen Zwecken nutzt, behält sich das Unternehmen das Recht vor, rechtliche Schritte einzuleiten.
