Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/hardware/battery.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitigen Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Genieße exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke auf [|link_sf_facebook|] und tritt noch heute bei!

source: About the Battery
de: Über die Batterie

source: **Battery**
de: **Batterie**

source: **VCC**: Battery positive terminal, here there are two sets of VCC and GND is to increase the current and reduce the resistance.
de: **VCC**: Positiver Batterieanschluss, hier gibt es zwei Sätze von VCC und GND, um den Strom zu erhöhen und den Widerstand zu verringern.

source: **Middle**: To balance the voltage between the two cells and thus protect the battery.
de: **Middle**: Zum Ausgleichen der Spannung zwischen den beiden Zellen und damit zum Schutz der Batterie.

source: **GND**: Negative battery terminal.
de: **GND**: Negativer Batterieanschluss.

source: This is a custom battery pack made by SunFounder consisting of two 18650 batteries with a capacity of 2000mAh. The connector is XH2.54 3 pin, which can be charged directly after being inserted into the shield.
de: Dies ist ein kundenspezifisches Akkupack von SunFounder, bestehend aus zwei 18650-Batterien mit einer Kapazität von 2000 mAh. Der Anschluss ist ein XH2.54-3-Pin, der direkt geladen werden kann, nachdem er in das Shield eingesteckt wurde.

source: **Features**
de: **Merkmale**

source: Composition: Li-ion
de: Zusammensetzung: Li-Ion

source: Battery Capacity: 2000mAh, 14.8Wh
de: Batteriekapazität: 2000 mAh, 14,8 Wh

source: Battery Weight: 90.8g
de: Batteriegewicht: 90,8 g

source: Number of Cells: 2
de: Anzahl der Zellen: 2

source: Connector: XH2.54 3pin
de: Anschluss: XH2.54 3-Pin

source: Over-discharge protection: 6.0V
de: Tiefentladeschutz: 6,0 V
