Repository: sunfounder/fusion-hat
Catalog: docs/source/locale/*/LC_MESSAGES/hardware/features.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo, willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Community auf Facebook! Tauche gemeinsam mit anderen Enthusiasten tiefer in Raspberry Pi, Arduino und ESP32 ein.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Löse After-Sales-Probleme und technische Herausforderungen mit Hilfe unserer Community und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tausche Tipps und Tutorials aus, um deine Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalte frühzeitigen Zugang zu neuen Produktankündigungen und Sneak Peeks.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezielle Rabatte**: Genieße exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nimm an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Bereit, mit uns zu entdecken und zu erschaffen? Klicke auf [|link_sf_facebook|] und tritt noch heute bei!

source: Features
de: Merkmale

source: Shutdown Current: 40mA
de: Abschaltstrom: 40 mA

source: Power Input: USB Type-C, 5V/3A
de: Stromeingang: USB Typ-C, 5 V / 3 A

source: Charging Power: 7.4V/1.5A 15W
de: Ladeleistung: 7,4 V / 1,5 A, 15 W

source: Output Power: 5V/5A, 3.3V/1A
de: Ausgangsleistung: 5 V / 5 A, 3,3 V / 1 A

source: Included Batteries: 2 x 3.7V 18650 Lithium-ion Batteries, XH2.54 3P Interface
de: Enthaltene Batterien: 2 × 3,7 V 18650 Lithium-Ionen-Batterien, XH2.54-3P-Schnittstelle

source: Battery Protection: Reverse polarity protection
de: Batterieschutz: Verpolungsschutz

source: Charging Protection: Input undervoltage protection, input overvoltage protection, charging balance, overheat protection
de: Ladeschutz: Eingang-Unterspannungsschutz, Eingang-Überspannungsschutz, Ladeausgleich, Überhitzungsschutz

source: Onboard Power Indicator Light: PWR
de: Onboard-Stromanzeige: PWR

source: Onboard 2 Battery Level Indicator LEDs
de: Onboard 2 Batterie-Ladestandsanzeigen (LEDs)

source: Onboard User LED, 2 tactile switches
de: Onboard Benutzer-LED, 2 Taster

source: Motor Driver: 5V/1.8A x 4
de: Motortreiber: 5 V / 1,8 A × 4

source: 4-channel 12-bit ADC
de: 4-Kanal-12-Bit-ADC

source: 12-channel PWM (8-channel shared with motor)
de: 12-Kanal-PWM (8 Kanäle gemeinsam mit Motoren)

source: 4-channel digital signals
de: 4-Kanal-Digitalsignale

source: Onboard SPI interface, UART interface, I2C interface, WS2812 interface
de: Onboard-SPI-Schnittstelle, UART-Schnittstelle, I2C-Schnittstelle, WS2812-Schnittstelle

source: Mono Speaker: 4Ω2.5W
de: Mono-Lautsprecher: 4 Ω, 2,5 W

source: Power Button: Safe shutdown
de: Power-Taste: Sicheres Herunterfahren

source: Microphone: Onboard I2S microphone
de: Mikrofon: Onboard-I2S-Mikrofon

source: Compatibility and Power Notes
de: Kompatibilität und Stromhinweise

source: The **Fusion HAT+** supports a wide range of commonly used servos and DC motors, including:
de: Der **Fusion HAT+** unterstützt eine breite Palette gängiger Servos und Gleichstrommotoren, darunter:

source: **Micro servos:** SG90, MG90S
de: **Mikro-Servos:** SG90, MG90S

source: **SunFounder custom servos**
de: **SunFounder kundenspezifische Servos**

source: **Low-current DC motors:** 130 series, N20 series
de: **Niedrigstrom-DC-Motoren:** Serie 130, Serie N20

source: **SunFounder custom DC motors** with **XH2.54 2-pin connectors**
de: **SunFounder kundenspezifische DC-Motoren** mit **XH2.54-2-Pin-Anschlüssen**

source: **Servo Power (PWM Interface)**
de: **Servo-Stromversorgung ( PWM-Schnittstelle )**

source: The PWM interface provides up to **5V/5A** maximum output, which is shared with the Raspberry Pi.
de: Die PWM-Schnittstelle liefert bis zu **5 V / 5 A** maximale Ausgangsleistung, die mit dem Raspberry Pi geteilt wird.

source: When connecting multiple servos, carefully account for their current draw.
de: Beim Anschluss mehrerer Servos ist deren Stromaufnahme sorgfältig zu berücksichtigen.

source: If the total servo current exceeds 5A, use an **external power supply (BEC)** to avoid overload and ensure stable operation.
de: Wenn der Gesamtstrom der Servos 5 A überschreitet, verwenden Sie eine **externe Stromversorgung ( BEC )**, um Überlastung zu vermeiden und einen stabilen Betrieb sicherzustellen.

source: **DC Motor Power**
de: **DC-Motor-Stromversorgung**

source: DC motors are powered **directly from the onboard batteries (6–8.4V)**.
de: DC-Motoren werden **direkt von den Onboard-Batterien ( 6–8,4 V )** versorgt.

source: Each motor channel supports up to **1.8A maximum current**.
de: Jeder Motorkanal unterstützt bis zu **1,8 A maximalen Strom**.

source: Do **not** connect motors with higher current requirements, as this may damage the motor driver chip.
de: Schließen Sie **keine** Motoren mit höherem Strombedarf an, da dies den Motortreiber-Chip beschädigen kann.

source: Electrical Characteristics
de: Elektrische Eigenschaften

source: Parameters:
de: Parameter:

source: Minimum Value:
de: Minimalwert:

source: Typical Value:
de: Typischer Wert:

source: Maximum Value:
de: Maximalwert:

source: Unit:
de: Einheit:

source: Input Voltage:
de: Eingangsspannung:

source: Battery Input Voltage:
de: Batterie-Eingangsspannung:

source: Overcharge Protection (Battery):
de: Überladeschutz ( Batterie ):

source: Input Undervoltage Protection:
de: Eingang-Unterspannungsschutz:

source: Input Overvoltage Protection:
de: Eingang-Überspannungsschutz:

source: Charging Current (5V):
de: Ladestrom ( 5 V ):

source: Output Current (5V):
de: Ausgangsstrom ( 5 V ):

source: Output Voltage:
de: Ausgangsspannung:

source: Charging Overheat Protection:
de: Überhitzungsschutz beim Laden:

source: DC-DC Overheat Protection:
de: DC-DC-Überhitzungsschutz:

source: Motor Output Current:
de: Motor-Ausgangsstrom:

source: Overdischarge Protectiont:
de: Tiefentladeschutz:
